
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Volatile · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../../android/readme.md">
            
                <span>
            
                    
                    1 android
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../../android/kotlin/readme.md">
            
                <span>
            
                    
                    1.1 kotlin
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1.1" data-path="../../android/kotlin/函数.html">
            
                <a href="../../android/kotlin/函数.html">
            
                    
                    1.1.1 函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.1.2" data-path="../../android/kotlin/习惯写法.html">
            
                <a href="../../android/kotlin/习惯写法.html">
            
                    
                    1.1.2 习惯写法
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.2.2" >
            
                <span>
            
                    
                    1.2 基础
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../../android/基础/AAC.html">
            
                <a href="../../android/基础/AAC.html">
            
                    
                    1.2.1 AAC
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../../android/基础/架构组件.html">
            
                <a href="../../android/基础/架构组件.html">
            
                    
                    1.2.3 架构组件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../../android/基础/网络.html">
            
                <a href="../../android/基础/网络.html">
            
                    
                    1.2.5 网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    2 Java
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" >
            
                <span>
            
                    
                    2.1 Memory
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.6.1.1" data-path="volatile.html">
            
                <a href="volatile.html">
            
                    
                    Volatile
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >Volatile</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <blockquote>
<p>  from </p>
</blockquote>
<h1 id="&#x5185;&#x5B58;&#x6A21;&#x578B;&#x7684;&#x76F8;&#x5173;&#x6982;&#x5FF5;">&#x5185;&#x5B58;&#x6A21;&#x578B;&#x7684;&#x76F8;&#x5173;&#x6982;&#x5FF5;</h1>
<p>&#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x5728;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x6BCF;&#x6761;&#x6307;&#x4EE4;&#x90FD;&#x662F;&#x5728; <code>CPU</code> &#x4E2D;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x800C;&#x6267;&#x884C;&#x6307;&#x4EE4;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x52BF;&#x5FC5;&#x6D89;&#x53CA;&#x5230;&#x6570;&#x636E;&#x7684;&#x8BFB;&#x53D6;&#x548C;&#x5199;&#x5165;&#x3002;&#x7531;&#x4E8E;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x4E34;&#x65F6;&#x6570;&#x636E;&#x662F;&#x5B58;&#x653E;&#x5728;<code>&#x4E3B;&#x5B58;&#xFF08;&#x7269;&#x7406;&#x5185;&#x5B58;&#xFF09;</code>&#x5F53;&#x4E2D;&#x7684;&#xFF0C;&#x8FD9;&#x65F6;&#x5C31;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x7531;&#x4E8E;CPU&#x6267;&#x884C;&#x901F;&#x5EA6;&#x5F88;&#x5FEB;&#xFF0C;&#x800C;&#x4ECE;&#x5185;&#x5B58;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x548C;&#x5411;&#x5185;&#x5B58;&#x5199;&#x5165;&#x6570;&#x636E;&#x7684;&#x8FC7;&#x7A0B;&#x8DDF; CPU &#x6267;&#x884C;&#x6307;&#x4EE4;&#x7684;&#x901F;&#x5EA6;&#x6BD4;&#x8D77;&#x6765;&#x8981;&#x6162;&#x7684;&#x591A;&#xFF0C;&#x56E0;&#x6B64;&#x5982;&#x679C;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x5BF9;&#x6570;&#x636E;&#x7684;&#x64CD;&#x4F5C;&#x90FD;&#x8981;&#x901A;&#x8FC7;&#x548C;&#x5185;&#x5B58;&#x7684;&#x4EA4;&#x4E92;&#x6765;&#x8FDB;&#x884C;&#xFF0C;&#x4F1A;&#x5927;&#x5927;&#x964D;&#x4F4E;&#x6307;&#x4EE4;&#x6267;&#x884C;&#x7684;&#x901F;&#x5EA6;&#x3002;&#x56E0;&#x6B64;&#x5728; CPU &#x91CC;&#x9762;&#x5C31;&#x6709;&#x4E86;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x3002;</p>
<p>&#x4E5F;&#x5C31;&#x662F;&#xFF0C;<strong>&#x5F53;&#x7A0B;&#x5E8F;&#x5728;&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F1A;&#x5C06;&#x8FD0;&#x7B97;&#x9700;&#x8981;&#x7684;&#x6570;&#x636E;&#x4ECE;&#x4E3B;&#x5B58;&#x590D;&#x5236;&#x4E00;&#x4EFD;&#x5230; CPU &#x7684;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x5F53;&#x4E2D;</strong>&#xFF0C;&#x90A3;&#x4E48;CPU&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#x65F6;&#x5C31;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4ECE;&#x5B83;&#x7684;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x548C;&#x5411;&#x5176;&#x4E2D;&#x5199;&#x5165;&#x6570;&#x636E;&#xFF0C;&#x5F53;&#x8FD0;&#x7B97;&#x7ED3;&#x675F;&#x4E4B;&#x540E;&#xFF0C;&#x518D;&#x5C06;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5237;&#x65B0;&#x5230;&#x4E3B;&#x5B58;&#x5F53;&#x4E2D;&#x3002;&#x4E3E;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x6BD4;&#x5982;&#x4E0B;&#x9762;&#x7684;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-java">i = i+<span class="hljs-number">1</span>;
</code></pre>
<p>&#x5F53;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x8BED;&#x53E5;&#x65F6;&#xFF0C;&#x4F1A;&#x5148;&#x4ECE;&#x4E3B;&#x5B58;&#x5F53;&#x4E2D;&#x8BFB;&#x53D6;i&#x7684;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x590D;&#x5236;&#x4E00;&#x4EFD;&#x5230;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x5F53;&#x4E2D;&#xFF0C;&#x7136;&#x540E; CPU &#x6267;&#x884C;&#x6307;&#x4EE4;&#x5BF9; i &#x8FDB;&#x884C;&#x52A0; 1 &#x64CD;&#x4F5C;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x6570;&#x636E;&#x5199;&#x5165;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#xFF0C;&#x6700;&#x540E;&#x5C06;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x4E2D;i&#x6700;&#x65B0;&#x7684;&#x503C;&#x5237;&#x65B0;&#x5230;&#x4E3B;&#x5B58;&#x5F53;&#x4E2D;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x4EE3;&#x7801;&#x5728;&#x5355;&#x7EBF;&#x7A0B;&#x4E2D;&#x8FD0;&#x884C;&#x662F;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x4E2D;&#x8FD0;&#x884C;&#x5C31;&#x4F1A;&#x6709;&#x95EE;&#x9898;&#x4E86;&#x3002;&#x5728;&#x591A;&#x6838; CPU &#x4E2D;&#xFF0C;&#x6BCF;&#x6761;&#x7EBF;&#x7A0B;&#x53EF;&#x80FD;&#x8FD0;&#x884C;&#x4E8E;&#x4E0D;&#x540C;&#x7684; CPU &#x4E2D;&#xFF0C;&#x56E0;&#x6B64;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x8FD0;&#x884C;&#x65F6;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#xFF08;&#x5BF9;&#x5355;&#x6838;CPU&#x6765;&#x8BF4;&#xFF0C;&#x5176;&#x5B9E;&#x4E5F;&#x4F1A;&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x95EE;&#x9898;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x4EE5;&#x7EBF;&#x7A0B;&#x8C03;&#x5EA6;&#x7684;&#x5F62;&#x5F0F;&#x6765;&#x5206;&#x522B;&#x6267;&#x884C;&#x7684;&#xFF09;&#x3002;&#x672C;&#x6587;&#x6211;&#x4EEC;&#x4EE5;&#x591A;&#x6838; CPU &#x4E3A;&#x4F8B;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x540C;&#x65F6;&#x6709; 2 &#x4E2A;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#xFF0C;&#x5047;&#x5982;&#x521D;&#x59CB;&#x65F6; i &#x7684;&#x503C;&#x4E3A; 0&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x5B8C;&#x4E4B;&#x540E; i &#x7684;&#x503C;&#x53D8;&#x4E3A; 2&#x3002;&#x4F46;&#x662F;&#x4E8B;&#x5B9E;&#x4F1A;&#x662F;&#x8FD9;&#x6837;&#x5417;&#xFF1F;</p>
<p>&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x4E0B;&#x9762;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;&#x521D;&#x59CB;&#x65F6;&#xFF0C;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x5206;&#x522B;&#x8BFB;&#x53D6;i&#x7684;&#x503C;&#x5B58;&#x5165;&#x5404;&#x81EA;&#x6240;&#x5728;&#x7684; CPU &#x7684;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x5F53;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x7EBF;&#x7A0B; 1 &#x8FDB;&#x884C;&#x52A0; 1 &#x64CD;&#x4F5C;&#xFF0C;&#x7136;&#x540E;&#x628A;i&#x7684;&#x6700;&#x65B0;&#x503C; 1 &#x5199;&#x5165;&#x5230;&#x5185;&#x5B58;&#x3002;&#x6B64;&#x65F6;&#x7EBF;&#x7A0B; 2 &#x7684;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x5F53;&#x4E2D; i &#x7684;&#x503C;&#x8FD8;&#x662F; 0&#xFF0C;&#x8FDB;&#x884C;&#x52A0; 1 &#x64CD;&#x4F5C;&#x4E4B;&#x540E;&#xFF0C;i &#x7684;&#x503C;&#x4E3A;1&#xFF0C;&#x7136;&#x540E;&#x7EBF;&#x7A0B; 2 &#x628A; i &#x7684;&#x503C;&#x5199;&#x5165;&#x5185;&#x5B58;&#x3002;</p>
<p>&#x6700;&#x7EC8;&#x7ED3;&#x679C; i &#x7684;&#x503C;&#x662F; 1&#xFF0C;&#x800C;&#x4E0D;&#x662F; 2&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x8457;&#x540D;&#x7684;<code>&#x7F13;&#x5B58;&#x4E00;&#x81F4;&#x6027;</code>&#x95EE;&#x9898;&#x3002;&#x901A;&#x5E38;&#x79F0;&#x8FD9;&#x79CD;&#x88AB;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x8BBF;&#x95EE;&#x7684;&#x53D8;&#x91CF;&#x4E3A;<code>&#x5171;&#x4EAB;&#x53D8;&#x91CF;</code>&#x3002;</p>
<p><strong>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x5728;&#x591A;&#x4E2A;CPU&#x4E2D;&#x90FD;&#x5B58;&#x5728;&#x7F13;&#x5B58;&#xFF08;&#x4E00;&#x822C;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x7F16;&#x7A0B;&#x65F6;&#x624D;&#x4F1A;&#x51FA;&#x73B0;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x7F13;&#x5B58;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x95EE;&#x9898;</strong>&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x7F13;&#x5B58;&#x4E0D;&#x4E00;&#x81F4;&#x6027;&#x95EE;&#x9898;&#xFF0C;&#x901A;&#x5E38;&#x6765;&#x8BF4;&#x6709;&#x4EE5;&#x4E0B; 2 &#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF1A;</p>
<ul>
<li>&#x901A;&#x8FC7;&#x5728;&#x603B;&#x7EBF;&#x52A0; LOCK# &#x9501;&#x7684;&#x65B9;&#x5F0F;</li>
<li>&#x901A;&#x8FC7;&#x7F13;&#x5B58;&#x4E00;&#x81F4;&#x6027;&#x534F;&#x8BAE;</li>
</ul>
<p>&#x8FD9; 2 &#x79CD;&#x65B9;&#x5F0F;&#x90FD;&#x662F;<code>&#x786C;&#x4EF6;&#x5C42;&#x9762;</code>&#x4E0A;&#x63D0;&#x4F9B;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x5728;&#x65E9;&#x671F;&#x7684; CPU &#x4E2D;&#xFF0C;&#x662F;&#x901A;&#x8FC7;&#x5728;&#x603B;&#x7EBF;&#x4E0A;&#x52A0; LOCK# &#x9501;&#x7684;&#x5F62;&#x5F0F;&#x6765;&#x89E3;&#x51B3;&#x7F13;&#x5B58;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x95EE;&#x9898;&#x3002;&#x56E0;&#x4E3A; CPU &#x548C;&#x5176;&#x4ED6;&#x90E8;&#x4EF6;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x603B;&#x7EBF;&#x6765;&#x8FDB;&#x884C;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x603B;&#x7EBF;&#x52A0; LOCK# &#x9501;&#x7684;&#x8BDD;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x963B;&#x585E;&#x4E86;&#x5176;&#x4ED6; CPU &#x5BF9;&#x5176;&#x4ED6;&#x90E8;&#x4EF6;&#x8BBF;&#x95EE;&#xFF08;&#x5982;&#x5185;&#x5B58;&#xFF09;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x5F97;&#x53EA;&#x80FD;&#x6709;&#x4E00;&#x4E2A; CPU &#x80FD;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x5185;&#x5B58;&#x3002;&#x6BD4;&#x5982;&#x4E0A;&#x9762;&#x4F8B;&#x5B50;&#x4E2D; &#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5728;&#x6267;&#x884C; i = i +1&#xFF0C;&#x5982;&#x679C;&#x5728;&#x6267;&#x884C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5728;&#x603B;&#x7EBF;&#x4E0A;&#x53D1;&#x51FA;&#x4E86; LCOK# &#x9501;&#x7684;&#x4FE1;&#x53F7;&#xFF0C;&#x90A3;&#x4E48;&#x53EA;&#x6709;&#x7B49;&#x5F85;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x5B8C;&#x5168;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x4E4B;&#x540E;&#xFF0C;&#x5176;&#x4ED6;CPU &#x624D;&#x80FD;&#x4ECE;&#x53D8;&#x91CF; i &#x6240;&#x5728;&#x7684;&#x5185;&#x5B58;&#x8BFB;&#x53D6;&#x53D8;&#x91CF;&#xFF0C;&#x7136;&#x540E;&#x8FDB;&#x884C;&#x76F8;&#x5E94;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x89E3;&#x51B3;&#x4E86;&#x7F13;&#x5B58;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x4E0A;&#x9762;&#x7684;&#x65B9;&#x5F0F;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x7531;&#x4E8E;&#x5728;&#x9501;&#x4F4F;&#x603B;&#x7EBF;&#x671F;&#x95F4;&#xFF0C;&#x5176;&#x4ED6; CPU &#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#xFF0C;&#x5BFC;&#x81F4;&#x6548;&#x7387;&#x4F4E;&#x4E0B;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x5C31;&#x51FA;&#x73B0;&#x4E86;&#x7F13;&#x5B58;&#x4E00;&#x81F4;&#x6027;&#x534F;&#x8BAE;&#x3002;&#x6700;&#x51FA;&#x540D;&#x7684;&#x5C31;&#x662F; Intel &#x7684; MESI &#x534F;&#x8BAE;&#xFF0C;MESI &#x534F;&#x8BAE;&#x4FDD;&#x8BC1;&#x4E86;&#x6BCF;&#x4E2A;&#x7F13;&#x5B58;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x7684;&#x526F;&#x672C;&#x662F;&#x4E00;&#x81F4;&#x7684;&#x3002;&#x5B83;&#x6838;&#x5FC3;&#x7684;&#x601D;&#x60F3;&#x662F;&#xFF1A;&#x5F53; CPU &#x5199;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x64CD;&#x4F5C;&#x7684;&#x53D8;&#x91CF;&#x662F;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#xFF0C;&#x5373;&#x5728;&#x5176;&#x4ED6; CPU &#x4E2D;&#x4E5F;&#x5B58;&#x5728;&#x8BE5;&#x53D8;&#x91CF;&#x7684;&#x526F;&#x672C;&#xFF0C;&#x4F1A;&#x53D1;&#x51FA;&#x4FE1;&#x53F7;&#x901A;&#x77E5;&#x5176;&#x4ED6; CPU &#x5C06;&#x8BE5;&#x53D8;&#x91CF;&#x7684;&#x7F13;&#x5B58;&#x884C;&#x7F6E;&#x4E3A;&#x65E0;&#x6548;&#x72B6;&#x6001;&#xFF0C;&#x56E0;&#x6B64;&#x5F53;&#x5176;&#x4ED6; CPU &#x9700;&#x8981;&#x8BFB;&#x53D6;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x65F6;&#xFF0C;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7F13;&#x5B58;&#x4E2D;&#x7F13;&#x5B58;&#x8BE5;&#x53D8;&#x91CF;&#x7684;&#x7F13;&#x5B58;&#x884C;&#x662F;&#x65E0;&#x6548;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C31;&#x4F1A;&#x4ECE;&#x5185;&#x5B58;&#x91CD;&#x65B0;&#x8BFB;&#x53D6;&#x3002;</p>
<p><img src="https://mmbiz.qpic.cn/mmbiz_jpg/libYRuvULTdXfguz2lU2cpURRORvhAA9j9XYFQsLyKBkZ3aGcg4H5ibI3r47DSt8ick4bWDBFrAVUOw2DAHKlcuNQ/640?wx_fmt=jpeg&amp;tp=webp&amp;wxfrom=5&amp;wx_lazy=1&amp;wx_co=1" alt="img"></p>
<h1 id="&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#x4E2D;&#x7684;&#x4E09;&#x4E2A;&#x6982;&#x5FF5;">&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#x4E2D;&#x7684;&#x4E09;&#x4E2A;&#x6982;&#x5FF5;</h1>
<p>&#x5728;&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x4F1A;&#x9047;&#x5230;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;<strong>&#x539F;&#x5B50;&#x6027;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x89C1;&#x6027;&#x95EE;&#x9898;&#xFF0C;&#x6709;&#x5E8F;&#x6027;&#x95EE;&#x9898;</strong>&#x3002;&#x6211;&#x4EEC;&#x5148;&#x770B;&#x5177;&#x4F53;&#x770B;&#x4E00;&#x4E0B;&#x8FD9;&#x4E09;&#x4E2A;&#x6982;&#x5FF5;&#xFF1A;</p>
<h2 id="&#x539F;&#x5B50;&#x6027;">&#x539F;&#x5B50;&#x6027;</h2>
<p>&#x539F;&#x5B50;&#x6027;&#xFF1A;&#x5373;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x6216;&#x8005;&#x591A;&#x4E2A;&#x64CD;&#x4F5C; &#x8981;&#x4E48;&#x5168;&#x90E8;&#x6267;&#x884C;&#x5E76;&#x4E14;&#x6267;&#x884C;&#x7684;&#x8FC7;&#x7A0B;&#x4E0D;&#x4F1A;&#x88AB;&#x4EFB;&#x4F55;&#x56E0;&#x7D20;&#x6253;&#x65AD;&#xFF0C;&#x8981;&#x4E48;&#x5C31;&#x90FD;&#x4E0D;&#x6267;&#x884C;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x5F88;&#x7ECF;&#x5178;&#x7684;&#x4F8B;&#x5B50;&#x5C31;&#x662F;&#x94F6;&#x884C;&#x8D26;&#x6237;&#x8F6C;&#x8D26;&#x95EE;&#x9898;&#xFF1A;</p>
<p>&#x6BD4;&#x5982;&#x4ECE;&#x8D26;&#x6237; A &#x5411;&#x8D26;&#x6237; B &#x8F6C; 1000 &#x5143;&#xFF0C;&#x90A3;&#x4E48;&#x5FC5;&#x7136;&#x5305;&#x62EC; 2 &#x4E2A;&#x64CD;&#x4F5C;&#xFF1A;&#x4ECE;&#x8D26;&#x6237; A &#x51CF;&#x53BB; 1000 &#x5143;&#xFF0C;&#x5F80;&#x8D26;&#x6237; B &#x52A0;&#x4E0A; 1000 &#x5143;&#x3002;</p>
<p>&#x8BD5;&#x60F3;&#x4E00;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x8FD9; 2 &#x4E2A;&#x64CD;&#x4F5C;&#x4E0D;&#x5177;&#x5907;&#x539F;&#x5B50;&#x6027;&#xFF0C;&#x4F1A;&#x9020;&#x6210;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x540E;&#x679C;&#x3002;&#x5047;&#x5982;&#x4ECE;&#x8D26;&#x6237; A &#x51CF;&#x53BB; 1000 &#x5143;&#x4E4B;&#x540E;&#xFF0C;&#x64CD;&#x4F5C;&#x7A81;&#x7136;&#x4E2D;&#x6B62;&#x3002;&#x7136;&#x540E;&#x53C8;&#x4ECE; B &#x53D6;&#x51FA;&#x4E86; 500 &#x5143;&#xFF0C;&#x53D6;&#x51FA; 500 &#x5143;&#x4E4B;&#x540E;&#xFF0C;&#x518D;&#x6267;&#x884C;&#x5F80;&#x8D26;&#x6237; B &#x52A0;&#x4E0A; 1000 &#x5143; &#x7684;&#x64CD;&#x4F5C;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;&#x8D26;&#x6237; A&#x867D;&#x7136;&#x51CF;&#x53BB;&#x4E86; 1000 &#x5143;&#xFF0C;&#x4F46;&#x662F;&#x8D26;&#x6237; B &#x6CA1;&#x6709;&#x6536;&#x5230;&#x8FD9;&#x4E2A;&#x8F6C;&#x8FC7;&#x6765;&#x7684; 1000 &#x5143;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8FD9; 2 &#x4E2A;&#x64CD;&#x4F5C;&#x5FC5;&#x987B;&#x8981;&#x5177;&#x5907;&#x539F;&#x5B50;&#x6027;&#x624D;&#x80FD;&#x4FDD;&#x8BC1;&#x4E0D;&#x51FA;&#x73B0;&#x4E00;&#x4E9B;&#x610F;&#x5916;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x540C;&#x6837;&#x5730;&#x53CD;&#x6620;&#x5230;&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#x4E2D;&#x4F1A;&#x51FA;&#x73B0;&#x4EC0;&#x4E48;&#x7ED3;&#x679C;&#x5462;&#xFF1F;</p>
<p>&#x4E3E;&#x4E2A;&#x6700;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5927;&#x5BB6;&#x60F3;&#x4E00;&#x4E0B;&#x5047;&#x5982;&#x4E3A;&#x4E00;&#x4E2A; 32 &#x4F4D;&#x7684;&#x53D8;&#x91CF;&#x8D4B;&#x503C;&#x8FC7;&#x7A0B;&#x4E0D;&#x5177;&#x5907;&#x539F;&#x5B50;&#x6027;&#x7684;&#x8BDD;&#xFF0C;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x540E;&#x679C;&#xFF1F;</p>
<pre><code class="lang-java">i = <span class="hljs-number">9</span>;
</code></pre>
<p>&#x5047;&#x82E5;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x5230;&#x8FD9;&#x4E2A;&#x8BED;&#x53E5;&#x65F6;&#xFF0C;&#x6211;&#x6682;&#x4E14;&#x5047;&#x8BBE;&#x4E3A;&#x4E00;&#x4E2A; 32 &#x4F4D;&#x7684;&#x53D8;&#x91CF;&#x8D4B;&#x503C;&#x5305;&#x62EC;&#x4E24;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF1A;&#x4E3A;&#x4F4E; 16 &#x4F4D;&#x8D4B;&#x503C;&#xFF0C;&#x4E3A;&#x9AD8; 16 &#x4F4D;&#x8D4B;&#x503C;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x5C31;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;&#x5F53;&#x5C06;&#x4F4E; 16 &#x4F4D;&#x6570;&#x503C;&#x5199;&#x5165;&#x4E4B;&#x540E;&#xFF0C;&#x7A81;&#x7136;&#x88AB;&#x4E2D;&#x65AD;&#xFF0C;&#x800C;&#x6B64;&#x65F6;&#x53C8;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x53BB;&#x8BFB;&#x53D6;i&#x7684;&#x503C;&#xFF0C;&#x90A3;&#x4E48;&#x8BFB;&#x53D6;&#x5230;&#x7684;&#x5C31;&#x662F;&#x9519;&#x8BEF;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<h2 id="&#x53EF;&#x89C1;&#x6027;">&#x53EF;&#x89C1;&#x6027;</h2>
<p>&#x53EF;&#x89C1;&#x6027;&#x662F;&#x6307;&#x5F53;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x8BBF;&#x95EE;&#x540C;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x65F6;&#xFF0C;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4FEE;&#x6539;&#x4E86;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x503C;&#xFF0C;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x80FD;&#x591F;&#x7ACB;&#x5373;&#x770B;&#x5F97;&#x5230;&#x4FEE;&#x6539;&#x7684;&#x503C;&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x770B;&#x4E0B;&#x9762;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-java"><span class="hljs-comment">//&#x7EBF;&#x7A0B;1&#x6267;&#x884C;&#x7684;&#x4EE3;&#x7801;</span>
<span class="hljs-keyword">int</span> i = <span class="hljs-number">0</span>;
i = <span class="hljs-number">10</span>;

<span class="hljs-comment">//&#x7EBF;&#x7A0B;2&#x6267;&#x884C;&#x7684;&#x4EE3;&#x7801;</span>
j = i;
</code></pre>
<p>&#x5047;&#x82E5;&#x6267;&#x884C;&#x7EBF;&#x7A0B;1&#x7684;&#x662F;CPU1&#xFF0C;&#x6267;&#x884C;&#x7EBF;&#x7A0B;2&#x7684;&#x662F;CPU2&#x3002;&#x7531;&#x4E0A;&#x9762;&#x7684;&#x5206;&#x6790;&#x53EF;&#x77E5;&#xFF0C;&#x5F53;&#x7EBF;&#x7A0B;1&#x6267;&#x884C; i =10&#x8FD9;&#x53E5;&#x65F6;&#xFF0C;&#x4F1A;&#x5148;&#x628A;i&#x7684;&#x521D;&#x59CB;&#x503C;&#x52A0;&#x8F7D;&#x5230;CPU1&#x7684;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x8D4B;&#x503C;&#x4E3A;10&#xFF0C;&#x90A3;&#x4E48;&#x5728;CPU1&#x7684;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x5F53;&#x4E2D;i&#x7684;&#x503C;&#x53D8;&#x4E3A;10&#x4E86;&#xFF0C;&#x5374;&#x6CA1;&#x6709;&#x7ACB;&#x5373;&#x5199;&#x5165;&#x5230;&#x4E3B;&#x5B58;&#x5F53;&#x4E2D;&#x3002;</p>
<p>&#x6B64;&#x65F6;&#x7EBF;&#x7A0B; 2 &#x6267;&#x884C; j = i&#xFF0C;&#x5B83;&#x4F1A;&#x5148;&#x53BB;&#x4E3B;&#x5B58;&#x8BFB;&#x53D6;i&#x7684;&#x503C;&#x5E76;&#x52A0;&#x8F7D;&#x5230; CPU2 &#x7684;&#x7F13;&#x5B58;&#x5F53;&#x4E2D;&#xFF0C;&#x6CE8;&#x610F;&#x6B64;&#x65F6;&#x5185;&#x5B58;&#x5F53;&#x4E2D;i&#x7684;&#x503C;&#x8FD8;&#x662F; 0&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F1A;&#x4F7F;&#x5F97; j &#x7684;&#x503C;&#x4E3A; 0&#xFF0C;&#x800C;&#x4E0D;&#x662F; 10&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x53EF;&#x89C1;&#x6027;&#x95EE;&#x9898;&#xFF0C;&#x7EBF;&#x7A0B; 1 &#x5BF9;&#x53D8;&#x91CF; i &#x4FEE;&#x6539;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;&#x7EBF;&#x7A0B; 2 &#x6CA1;&#x6709;&#x7ACB;&#x5373;&#x770B;&#x5230;&#x7EBF;&#x7A0B; 1 &#x4FEE;&#x6539;&#x7684;&#x503C;&#x3002;</p>
<h2 id="&#x6709;&#x5E8F;&#x6027;">&#x6709;&#x5E8F;&#x6027;</h2>
<p>&#x6709;&#x5E8F;&#x6027;&#xFF1A;&#x5373;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x987A;&#x5E8F;&#x6309;&#x7167;&#x4EE3;&#x7801;&#x7684;&#x5148;&#x540E;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x3002;&#x4E3E;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x770B;&#x4E0B;&#x9762;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-java"><span class="hljs-keyword">int</span> i = <span class="hljs-number">0</span>;              
<span class="hljs-keyword">boolean</span> flag = <span class="hljs-keyword">false</span>;
i = <span class="hljs-number">1</span>;                <span class="hljs-comment">//&#x8BED;&#x53E5;1  </span>
flag = <span class="hljs-keyword">true</span>;          <span class="hljs-comment">//&#x8BED;&#x53E5;2</span>
</code></pre>
<p>&#x4E0A;&#x9762;&#x4EE3;&#x7801;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A; int &#x578B;&#x53D8;&#x91CF;&#xFF0C;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A; boolean &#x7C7B;&#x578B;&#x53D8;&#x91CF;&#xFF0C;&#x7136;&#x540E;&#x5206;&#x522B;&#x5BF9;&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x8FDB;&#x884C;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#x3002;&#x4ECE;&#x4EE3;&#x7801;&#x987A;&#x5E8F;&#x4E0A;&#x770B;&#xFF0C;&#x8BED;&#x53E5; 1 &#x662F;&#x5728;&#x8BED;&#x53E5; 2 &#x524D;&#x9762;&#x7684;&#xFF0C;&#x90A3;&#x4E48; JVM &#x5728;&#x771F;&#x6B63;&#x6267;&#x884C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x4FDD;&#x8BC1;&#x8BED;&#x53E5; 1 &#x4E00;&#x5B9A;&#x4F1A;&#x5728;&#x8BED;&#x53E5; 2 &#x524D;&#x9762;&#x6267;&#x884C;&#x5417;&#xFF1F;&#x4E0D;&#x4E00;&#x5B9A;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x8FD9;&#x91CC;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;<code>&#x6307;&#x4EE4;&#x91CD;&#x6392;&#x5E8F;&#xFF08;Instruction Reorder&#xFF09;</code>&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#x4EC0;&#x4E48;&#x662F;&#x6307;&#x4EE4;&#x91CD;&#x6392;&#x5E8F;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x5904;&#x7406;&#x5668;&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x6548;&#x7387;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5BF9;&#x8F93;&#x5165;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#xFF0C;&#x5B83;&#x4E0D;&#x4FDD;&#x8BC1;&#x7A0B;&#x5E8F;&#x4E2D;&#x5404;&#x4E2A;&#x8BED;&#x53E5;&#x7684;&#x6267;&#x884C;&#x5148;&#x540E;&#x987A;&#x5E8F;&#x540C;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x987A;&#x5E8F;&#x4E00;&#x81F4;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4F1A;&#x4FDD;&#x8BC1;&#x7A0B;&#x5E8F;&#x6700;&#x7EC8;&#x6267;&#x884C;&#x7ED3;&#x679C;&#x548C;&#x4EE3;&#x7801;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x4E00;&#x81F4;&#x7684;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x8BED;&#x53E5; 1 &#x548C;&#x8BED;&#x53E5; 2 &#x8C01;&#x5148;&#x6267;&#x884C;&#x5BF9;&#x6700;&#x7EC8;&#x7684;&#x7A0B;&#x5E8F;&#x7ED3;&#x679C;&#x5E76;&#x6CA1;&#x6709;&#x5F71;&#x54CD;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x6709;&#x53EF;&#x80FD;&#x5728;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8BED;&#x53E5; 2 &#x5148;&#x6267;&#x884C;&#x800C;&#x8BED;&#x53E5; 1 &#x540E;&#x6267;&#x884C;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x867D;&#x7136;&#x5904;&#x7406;&#x5668;&#x4F1A;&#x5BF9;&#x6307;&#x4EE4;&#x8FDB;&#x884C;&#x91CD;&#x6392;&#x5E8F;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4F1A;&#x4FDD;&#x8BC1;&#x7A0B;&#x5E8F;&#x6700;&#x7EC8;&#x7ED3;&#x679C;&#x4F1A;&#x548C;&#x4EE3;&#x7801;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x7ED3;&#x679C;&#x76F8;&#x540C;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x9760;&#x4EC0;&#x4E48;&#x4FDD;&#x8BC1;&#x7684;&#x5462;&#xFF1F;&#x518D;&#x770B;&#x4E0B;&#x9762;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>int a = 10;    //&#x8BED;&#x53E5;1
int r = 2;    //&#x8BED;&#x53E5;2
a = a + 3;    //&#x8BED;&#x53E5;3
r = a*a;     //&#x8BED;&#x53E5;4
</code></pre><p>&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x6709;4&#x4E2A;&#x8BED;&#x53E5;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x80FD;&#x7684;&#x4E00;&#x4E2A;&#x6267;&#x884C;&#x987A;&#x5E8F;&#x662F;&#xFF1A;</p>
<p><img src="https://mmbiz.qpic.cn/mmbiz_jpg/libYRuvULTdXfguz2lU2cpURRORvhAA9jDu1pjsOgMhz8ILiclh4pdgW6wT9Q2NuZJnyyhKz2VzfFURraY1thk5g/640?wx_fmt=jpeg&amp;tp=webp&amp;wxfrom=5&amp;wx_lazy=1&amp;wx_co=1" alt="img"></p>
<p>&#x90A3;&#x4E48;&#x53EF;&#x4E0D;&#x53EF;&#x80FD;&#x662F;&#x8FD9;&#x4E2A;&#x6267;&#x884C;&#x987A;&#x5E8F;&#x5462;&#xFF1A;&#x8BED;&#x53E5;2  &#x8BED;&#x53E5;1  &#x8BED;&#x53E5;4  &#x8BED;&#x53E5;3</p>
<p>&#x4E0D;&#x53EF;&#x80FD;&#xFF0C;&#x56E0;&#x4E3A;&#x5904;&#x7406;&#x5668;&#x5728;&#x8FDB;&#x884C;&#x91CD;&#x6392;&#x5E8F;&#x65F6;&#x662F;&#x4F1A;&#x8003;&#x8651;&#x6307;&#x4EE4;&#x4E4B;&#x95F4;&#x7684;&#x6570;&#x636E;&#x4F9D;&#x8D56;&#x6027;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x6307;&#x4EE4; Instruction 2  &#x5FC5;&#x987B;&#x7528;&#x5230;Instruction 1&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x90A3;&#x4E48;&#x5904;&#x7406;&#x5668;&#x4F1A;&#x4FDD;&#x8BC1; Instruction 1&#x4F1A;&#x5728; Instruction 2 &#x4E4B;&#x524D;&#x6267;&#x884C;&#x3002;</p>
<p>&#x867D;&#x7136;&#x91CD;&#x6392;&#x5E8F;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5355;&#x4E2A;&#x7EBF;&#x7A0B;&#x5185;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x4F46;&#x662F;&#x591A;&#x7EBF;&#x7A0B;&#x5462;&#xFF1F;&#x4E0B;&#x9762;&#x770B;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>//&#x7EBF;&#x7A0B;1:
context = loadContext();   //&#x8BED;&#x53E5;1
inited = true;             //&#x8BED;&#x53E5;2

//&#x7EBF;&#x7A0B;2:
while(!inited ){
  sleep()
}
doSomethingwithconfig(context);
</code></pre><p>&#x4E0A;&#x9762;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x7531;&#x4E8E;&#x8BED;&#x53E5; 1 &#x548C;&#x8BED;&#x53E5; 2 &#x6CA1;&#x6709;&#x6570;&#x636E;&#x4F9D;&#x8D56;&#x6027;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x91CD;&#x6392;&#x5E8F;&#x3002;&#x5047;&#x5982;&#x53D1;&#x751F;&#x4E86;&#x91CD;&#x6392;&#x5E8F;&#xFF0C;&#x5728;&#x7EBF;&#x7A0B; 1 &#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x5148;&#x6267;&#x884C;&#x8BED;&#x53E5; 2&#xFF0C;&#x800C;&#x6B64;&#x65F6;&#x7EBF;&#x7A0B; 2 &#x4F1A;&#x4EE5;&#x4E3A;&#x521D;&#x59CB;&#x5316;&#x5DE5;&#x4F5C;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F1A;&#x8DF3;&#x51FA; while &#x5FAA;&#x73AF;&#xFF0C;&#x53BB;&#x6267;&#x884C;<code>doSomethingwithconfig(context)</code>&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x6B64;&#x65F6; context &#x5E76;&#x6CA1;&#x6709;&#x88AB;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x51FA;&#x9519;&#x3002;</p>
<p>&#x4ECE;&#x4E0A;&#x9762;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x6307;&#x4EE4;&#x91CD;&#x6392;&#x5E8F;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5355;&#x4E2A;&#x7EBF;&#x7A0B;&#x7684;&#x6267;&#x884C;&#xFF0C;&#x4F46;&#x662F;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x7EBF;&#x7A0B;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x7684;&#x6B63;&#x786E;&#x6027;&#x3002;</p>
<p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x8981;&#x60F3;&#x5E76;&#x53D1;&#x7A0B;&#x5E8F;&#x6B63;&#x786E;&#x5730;&#x6267;&#x884C;&#xFF0C;<strong>&#x5FC5;&#x987B;&#x8981;&#x4FDD;&#x8BC1;&#x539F;&#x5B50;&#x6027;&#x3001;&#x53EF;&#x89C1;&#x6027;&#x4EE5;&#x53CA;&#x6709;&#x5E8F;&#x6027;</strong>&#x3002;&#x53EA;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x88AB;&#x4FDD;&#x8BC1;&#xFF0C;&#x5C31;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x4E0D;&#x6B63;&#x786E;&#x3002;</p>
<h2 id="java&#x5185;&#x5B58;&#x6A21;&#x578B;">Java&#x5185;&#x5B58;&#x6A21;&#x578B;</h2>
<p>&#x5728;&#x524D;&#x9762;&#x8C08;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x5173;&#x4E8E;&#x5185;&#x5B58;&#x6A21;&#x578B;&#x4EE5;&#x53CA;&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#x4E2D;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x7684;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x3002;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E0B; Java &#x5185;&#x5B58;&#x6A21;&#x578B;&#xFF0C;&#x7814;&#x7A76;&#x4E00;&#x4E0B; Java &#x5185;&#x5B58;&#x6A21;&#x578B;&#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x54EA;&#x4E9B;&#x4FDD;&#x8BC1;&#x4EE5;&#x53CA;&#x5728; java &#x4E2D;&#x63D0;&#x4F9B;&#x4E86;&#x54EA;&#x4E9B;&#x65B9;&#x6CD5;&#x548C;&#x673A;&#x5236;&#x6765;&#x8BA9;&#x6211;&#x4EEC;&#x5728;&#x8FDB;&#x884C;&#x591A;&#x7EBF;&#x7A0B;&#x7F16;&#x7A0B;&#x65F6;&#x80FD;&#x591F;&#x4FDD;&#x8BC1;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x6B63;&#x786E;&#x6027;&#x3002;</p>
<p>&#x5728; Java &#x865A;&#x62DF;&#x673A;&#x89C4;&#x8303;&#x4E2D;&#x8BD5;&#x56FE;&#x5B9A;&#x4E49;&#x4E00;&#x79CD; <code>Java &#x5185;&#x5B58;&#x6A21;&#x578B;&#xFF08;Java Memory Model&#xFF0C;JMM&#xFF09;</code>&#x6765;&#x5C4F;&#x853D;&#x5404;&#x4E2A;&#x786C;&#x4EF6;&#x5E73;&#x53F0;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x5DEE;&#x5F02;&#xFF0C;&#x4EE5;&#x5B9E;&#x73B0;&#x8BA9; Java &#x7A0B;&#x5E8F;&#x5728;&#x5404;&#x79CD;&#x5E73;&#x53F0;&#x4E0B;&#x90FD;&#x80FD;&#x8FBE;&#x5230;&#x4E00;&#x81F4;&#x7684;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x6548;&#x679C;&#x3002;&#x90A3;&#x4E48; Java &#x5185;&#x5B58;&#x6A21;&#x578B;&#x89C4;&#x5B9A;&#x4E86;&#x54EA;&#x4E9B;&#x4E1C;&#x897F;&#xFF1F;&#x5B83;&#x5B9A;&#x4E49;&#x4E86;&#x7A0B;&#x5E8F;&#x4E2D;&#x53D8;&#x91CF;&#x7684;&#x8BBF;&#x95EE;&#x89C4;&#x5219;&#xFF0C;&#x5F80;&#x5927;&#x4E00;&#x70B9;&#x8BF4;&#x662F;&#x5B9A;&#x4E49;&#x4E86;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x6B21;&#x5E8F;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x4E3A;&#x4E86;&#x83B7;&#x5F97;&#x8F83;&#x597D;&#x7684;&#x6267;&#x884C;&#x6027;&#x80FD;&#xFF0C;Java &#x5185;&#x5B58;&#x6A21;&#x578B;&#x5E76;&#x6CA1;&#x6709;&#x9650;&#x5236;&#x6267;&#x884C;&#x5F15;&#x64CE;&#x4F7F;&#x7528;&#x5904;&#x7406;&#x5668;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#x6216;&#x8005;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x6765;&#x63D0;&#x5347;&#x6307;&#x4EE4;&#x6267;&#x884C;&#x901F;&#x5EA6;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x9650;&#x5236;&#x7F16;&#x8BD1;&#x5668;&#x5BF9;&#x6307;&#x4EE4;&#x8FDB;&#x884C;&#x91CD;&#x6392;&#x5E8F;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5728; java &#x5185;&#x5B58;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x4E5F;&#x4F1A;&#x5B58;&#x5728;&#x7F13;&#x5B58;&#x4E00;&#x81F4;&#x6027;&#x95EE;&#x9898;&#x548C;&#x6307;&#x4EE4;&#x91CD;&#x6392;&#x5E8F;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>Java &#x5185;&#x5B58;&#x6A21;&#x578B;&#x89C4;&#x5B9A;&#x6240;&#x6709;&#x7684;&#x53D8;&#x91CF;&#x90FD;&#x662F;&#x5B58;&#x5728;&#x4E3B;&#x5B58;&#x5F53;&#x4E2D;&#xFF08;&#x7C7B;&#x4F3C;&#x4E8E;&#x524D;&#x9762;&#x8BF4;&#x7684;&#x7269;&#x7406;&#x5185;&#x5B58;&#xFF09;&#xFF0C;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#xFF08;&#x7C7B;&#x4F3C;&#x4E8E;&#x524D;&#x9762;&#x7684;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#xFF09;&#x3002;&#x7EBF;&#x7A0B;&#x5BF9;&#x53D8;&#x91CF;&#x7684;&#x6240;&#x6709;&#x64CD;&#x4F5C;&#x90FD;&#x5FC5;&#x987B;&#x5728;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E2D;&#x8FDB;&#x884C;&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x5BF9;&#x4E3B;&#x5B58;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x3002;&#x5E76;&#x4E14;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E0D;&#x80FD;&#x8BBF;&#x95EE;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x7684;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;&#x5728; java&#x4E2D;&#xFF0C;&#x6267;&#x884C;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x8BED;&#x53E5;&#xFF1A;</p>
<pre><code>i = 10;
</code></pre><p>&#x6267;&#x884C;&#x7EBF;&#x7A0B;&#x5FC5;&#x987B;&#x5148;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x7EBF;&#x7A0B;&#x4E2D;&#x5BF9;&#x53D8;&#x91CF; i &#x6240;&#x5728;&#x7684;&#x7F13;&#x5B58;&#x884C;&#x8FDB;&#x884C;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x5199;&#x5165;&#x4E3B;&#x5B58;&#x5F53;&#x4E2D;&#x3002;&#x800C;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x5C06;&#x6570;&#x503C; 10 &#x5199;&#x5165;&#x4E3B;&#x5B58;&#x5F53;&#x4E2D;&#x3002;</p>
<p>&#x90A3;&#x4E48;Java &#x8BED;&#x8A00; &#x672C;&#x8EAB;&#x5BF9;&#x539F;&#x5B50;&#x6027;&#x3001;&#x53EF;&#x89C1;&#x6027;&#x4EE5;&#x53CA;&#x6709;&#x5E8F;&#x6027;&#x63D0;&#x4F9B;&#x4E86;&#x54EA;&#x4E9B;&#x4FDD;&#x8BC1;&#x5462;&#xFF1F;</p>
<h3 id="&#x539F;&#x5B50;&#x6027;">&#x539F;&#x5B50;&#x6027;</h3>
<p>&#x5728;Java&#x4E2D;&#xFF0C;&#x5BF9;&#x57FA;&#x672C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#x7684;&#x8BFB;&#x53D6;&#x548C;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#x662F;&#x539F;&#x5B50;&#x6027;&#x64CD;&#x4F5C;&#xFF0C;&#x5373;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x662F;&#x4E0D;&#x53EF;&#x88AB;&#x4E2D;&#x65AD;&#x7684;&#xFF0C;&#x8981;&#x4E48;&#x6267;&#x884C;&#xFF0C;&#x8981;&#x4E48;&#x4E0D;&#x6267;&#x884C;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x4E00;&#x53E5;&#x8BDD;&#x867D;&#x7136;&#x770B;&#x8D77;&#x6765;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x662F;&#x7406;&#x89E3;&#x8D77;&#x6765;&#x5E76;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x5BB9;&#x6613;&#x3002;&#x770B;&#x4E0B;&#x9762;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;i&#xFF1A;</p>
<p>&#x8BF7;&#x5206;&#x6790;&#x4EE5;&#x4E0B;&#x54EA;&#x4E9B;&#x64CD;&#x4F5C;&#x662F;&#x539F;&#x5B50;&#x6027;&#x64CD;&#x4F5C;&#xFF1A;</p>
<pre><code>x = 10;         //&#x8BED;&#x53E5;1
y = x;         //&#x8BED;&#x53E5;2
x++;           //&#x8BED;&#x53E5;3
x = x + 1;     //&#x8BED;&#x53E5;4
</code></pre><p>&#x548B;&#x4E00;&#x770B;&#xFF0C;&#x6709;&#x4E9B;&#x670B;&#x53CB;&#x53EF;&#x80FD;&#x4F1A;&#x8BF4;&#x4E0A;&#x9762;&#x7684; 4 &#x4E2A;&#x8BED;&#x53E5;&#x4E2D;&#x7684;&#x64CD;&#x4F5C;&#x90FD;&#x662F;&#x539F;&#x5B50;&#x6027;&#x64CD;&#x4F5C;&#x3002;&#x5176;&#x5B9E;&#x53EA;&#x6709;&#x8BED;&#x53E5; 1 &#x662F;&#x539F;&#x5B50;&#x6027;&#x64CD;&#x4F5C;&#xFF0C;&#x5176;&#x4ED6;&#x4E09;&#x4E2A;&#x8BED;&#x53E5;&#x90FD;&#x4E0D;&#x662F;&#x539F;&#x5B50;&#x6027;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x8BED;&#x53E5; 1 &#x662F;&#x76F4;&#x63A5;&#x5C06;&#x6570;&#x503C; 10 &#x8D4B;&#x503C;&#x7ED9; x&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x8BED;&#x53E5;&#x7684;&#x4F1A;&#x76F4;&#x63A5;&#x5C06;&#x6570;&#x503C; 10 &#x5199;&#x5165;&#x5230;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E2D;&#x3002;</p>
<p>&#x8BED;&#x53E5; 2 &#x5B9E;&#x9645;&#x4E0A;&#x5305;&#x542B; 2 &#x4E2A;&#x64CD;&#x4F5C;&#xFF0C;&#x5B83;&#x5148;&#x8981;&#x53BB;&#x8BFB;&#x53D6; x &#x7684;&#x503C;&#xFF0C;&#x518D;&#x5C06; x &#x7684;&#x503C;&#x5199;&#x5165;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#xFF0C;&#x867D;&#x7136;&#x8BFB;&#x53D6; x &#x7684;&#x503C;&#x4EE5;&#x53CA; &#x5C06; x &#x7684;&#x503C;&#x5199;&#x5165;&#x5DE5;&#x4F5C;&#x5185;&#x5B58; &#x8FD9; 2 &#x4E2A;&#x64CD;&#x4F5C;&#x90FD;&#x662F;&#x539F;&#x5B50;&#x6027;&#x64CD;&#x4F5C;&#xFF0C;&#x4F46;&#x662F;&#x5408;&#x8D77;&#x6765;&#x5C31;&#x4E0D;&#x662F;&#x539F;&#x5B50;&#x6027;&#x64CD;&#x4F5C;&#x4E86;&#x3002;</p>
<p>&#x540C;&#x6837;&#x7684;&#xFF0C;x++ &#x548C; x = x+1 &#x5305;&#x62EC; 3 &#x4E2A;&#x64CD;&#x4F5C;&#xFF1A;&#x8BFB;&#x53D6; x &#x7684;&#x503C;&#xFF0C;&#x8FDB;&#x884C;&#x52A0; 1 &#x64CD;&#x4F5C;&#xFF0C;&#x5199;&#x5165;&#x65B0;&#x7684;&#x503C;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x4E0A;&#x9762; 4 &#x4E2A;&#x8BED;&#x53E5;&#x53EA;&#x6709;&#x8BED;&#x53E5; 1 &#x7684;&#x64CD;&#x4F5C;&#x5177;&#x5907;&#x539F;&#x5B50;&#x6027;&#x3002;</p>
<p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;<strong>&#x53EA;&#x6709;&#x7B80;&#x5355;&#x7684;&#x8BFB;&#x53D6;&#x3001;&#x8D4B;&#x503C;&#xFF08;&#x800C;&#x4E14;&#x5FC5;&#x987B;&#x662F;&#x5C06;&#x6570;&#x5B57;&#x8D4B;&#x503C;&#x7ED9;&#x67D0;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x53D8;&#x91CF;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x8D4B;&#x503C;&#x4E0D;&#x662F;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#xFF09;&#x624D;&#x662F;&#x539F;&#x5B50;&#x64CD;&#x4F5C;</strong>&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x70B9;&#x9700;&#x8981;&#x6CE8;&#x610F;&#xFF1A;&#x5728; 32 &#x4F4D;&#x5E73;&#x53F0;&#x4E0B;&#xFF0C;&#x5BF9; 64 &#x4F4D;&#x6570;&#x636E;&#x7684;&#x8BFB;&#x53D6;&#x548C;&#x8D4B;&#x503C;&#x662F;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x6765;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x5176;&#x539F;&#x5B50;&#x6027;&#x3002;&#x4F46;&#x662F;&#x597D;&#x50CF;&#x5728;&#x6700;&#x65B0;&#x7684; JDK &#x4E2D;&#xFF0C;JVM &#x5DF2;&#x7ECF;&#x4FDD;&#x8BC1;&#x5BF9; 64 &#x4F4D;&#x6570;&#x636E;&#x7684;&#x8BFB;&#x53D6;&#x548C;&#x8D4B;&#x503C;&#x4E5F;&#x662F;&#x539F;&#x5B50;&#x6027;&#x64CD;&#x4F5C;&#x4E86;&#x3002;</p>
<p>&#x4ECE;&#x4E0A;&#x9762;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;Java &#x5185;&#x5B58;&#x6A21;&#x578B;&#x53EA;&#x4FDD;&#x8BC1;&#x4E86;&#x57FA;&#x672C;&#x8BFB;&#x53D6;&#x548C;&#x8D4B;&#x503C;&#x662F;&#x539F;&#x5B50;&#x6027;&#x64CD;&#x4F5C;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x5B9E;&#x73B0;&#x66F4;&#x5927;&#x8303;&#x56F4;&#x64CD;&#x4F5C;&#x7684;&#x539F;&#x5B50;&#x6027;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; synchronized &#x548C; Lock &#x6765;&#x5B9E;&#x73B0;&#x3002;&#x7531;&#x4E8E; synchronized &#x548C; Lock &#x80FD;&#x591F;&#x4FDD;&#x8BC1;&#x4EFB;&#x4E00;&#x65F6;&#x523B;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x8BE5;&#x4EE3;&#x7801;&#x5757;&#xFF0C;&#x90A3;&#x4E48;&#x81EA;&#x7136;&#x5C31;&#x4E0D;&#x5B58;&#x5728;&#x539F;&#x5B50;&#x6027;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x4ECE;&#x800C;&#x4FDD;&#x8BC1;&#x4E86;&#x539F;&#x5B50;&#x6027;&#x3002;</p>
<h3 id="&#x53EF;&#x89C1;&#x6027;">&#x53EF;&#x89C1;&#x6027;</h3>
<p>&#x5BF9;&#x4E8E;&#x53EF;&#x89C1;&#x6027;&#xFF0C;Java&#x63D0;&#x4F9B;&#x4E86; volatile &#x5173;&#x952E;&#x5B57;&#x6765;&#x4FDD;&#x8BC1;&#x53EF;&#x89C1;&#x6027;&#x3002;</p>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x88AB; volatile &#x4FEE;&#x9970;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x4FDD;&#x8BC1;&#x4FEE;&#x6539;&#x7684;&#x503C;&#x4F1A;&#x7ACB;&#x5373;&#x88AB;&#x66F4;&#x65B0;&#x5230;&#x4E3B;&#x5B58;&#xFF0C;&#x5F53;&#x6709;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x9700;&#x8981;&#x8BFB;&#x53D6;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x53BB;&#x5185;&#x5B58;&#x4E2D;&#x8BFB;&#x53D6;&#x65B0;&#x503C;&#x3002;</p>
<p>&#x800C;&#x666E;&#x901A;&#x7684;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x53EF;&#x89C1;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x666E;&#x901A;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x88AB;&#x4FEE;&#x6539;&#x4E4B;&#x540E;&#xFF0C;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x88AB;&#x5199;&#x5165;&#x4E3B;&#x5B58;&#x662F;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x5F53;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x53BB;&#x8BFB;&#x53D6;&#x65F6;&#xFF0C;&#x6B64;&#x65F6;&#x5185;&#x5B58;&#x4E2D;&#x53EF;&#x80FD;&#x8FD8;&#x662F;&#x539F;&#x6765;&#x7684;&#x65E7;&#x503C;&#xFF0C;&#x56E0;&#x6B64;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x53EF;&#x89C1;&#x6027;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x901A;&#x8FC7; synchronized &#x548C; Lock &#x4E5F;&#x80FD;&#x591F;&#x4FDD;&#x8BC1;&#x53EF;&#x89C1;&#x6027;&#xFF0C;synchronized &#x548C; Lock &#x80FD;&#x4FDD;&#x8BC1;&#x540C;&#x4E00;&#x65F6;&#x523B;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x83B7;&#x53D6;&#x9501;&#x7136;&#x540E;&#x6267;&#x884C;&#x540C;&#x6B65;&#x4EE3;&#x7801;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x91CA;&#x653E;&#x9501;&#x4E4B;&#x524D;&#x4F1A;&#x5C06;&#x5BF9;&#x53D8;&#x91CF;&#x7684;&#x4FEE;&#x6539;&#x5237;&#x65B0;&#x5230;&#x4E3B;&#x5B58;&#x5F53;&#x4E2D;&#x3002;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x53EF;&#x89C1;&#x6027;&#x3002;</p>
<h3 id="&#x6709;&#x5E8F;&#x6027;">&#x6709;&#x5E8F;&#x6027;</h3>
<p>&#x5728; Java &#x5185;&#x5B58;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x5141;&#x8BB8;&#x7F16;&#x8BD1;&#x5668;&#x548C;&#x5904;&#x7406;&#x5668;&#x5BF9;&#x6307;&#x4EE4;&#x8FDB;&#x884C;&#x91CD;&#x6392;&#x5E8F;&#xFF0C;&#x4F46;&#x662F;&#x91CD;&#x6392;&#x5E8F;&#x8FC7;&#x7A0B;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x5355;&#x7EBF;&#x7A0B;&#x7A0B;&#x5E8F;&#x7684;&#x6267;&#x884C;&#xFF0C;&#x5374;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x591A;&#x7EBF;&#x7A0B;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x7684;&#x6B63;&#x786E;&#x6027;&#x3002;</p>
<p>&#x5728; Java &#x91CC;&#x9762;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; volatile &#x5173;&#x952E;&#x5B57;&#x6765;&#x4FDD;&#x8BC1;&#x4E00;&#x5B9A;&#x7684;<code>&#x6709;&#x5E8F;&#x6027;</code>&#xFF08;&#x5177;&#x4F53;&#x539F;&#x7406;&#x5728;&#x4E0B;&#x4E00;&#x8282;&#x8BB2;&#x8FF0;&#xFF09;&#x3002;&#x53E6;&#x5916;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; synchronized &#x548C; Lock &#x6765;&#x4FDD;&#x8BC1;&#x6709;&#x5E8F;&#x6027;&#xFF0C;&#x5F88;&#x663E;&#x7136;&#xFF0C;synchronized &#x548C; Lock &#x4FDD;&#x8BC1;&#x6BCF;&#x4E2A;&#x65F6;&#x523B;&#x662F;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x540C;&#x6B65;&#x4EE3;&#x7801;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x662F;&#x8BA9;&#x7EBF;&#x7A0B;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x540C;&#x6B65;&#x4EE3;&#x7801;&#xFF0C;&#x81EA;&#x7136;&#x5C31;&#x4FDD;&#x8BC1;&#x4E86;&#x6709;&#x5E8F;&#x6027;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;Java &#x5185;&#x5B58;&#x6A21;&#x578B;&#x5177;&#x5907;&#x4E00;&#x4E9B;&#x5148;&#x5929;&#x7684;<code>&#x6709;&#x5E8F;&#x6027;</code>&#xFF0C;&#x5373;&#x4E0D;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x4EFB;&#x4F55;&#x624B;&#x6BB5;&#x5C31;&#x80FD;&#x591F;&#x5F97;&#x5230;&#x4FDD;&#x8BC1;&#x7684;&#x6709;&#x5E8F;&#x6027;&#xFF0C;&#x8FD9;&#x4E2A;&#x901A;&#x5E38;&#x4E5F;&#x79F0;&#x4E3A; <code>happens-before &#x539F;&#x5219;</code>&#x3002;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x7684;&#x6267;&#x884C;&#x6B21;&#x5E8F;&#x65E0;&#x6CD5;&#x4ECE; happens-before &#x539F;&#x5219;&#x63A8;&#x5BFC;&#x51FA;&#x6765;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x4EEC;&#x5C31;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x5B83;&#x4EEC;&#x7684;&#x6709;&#x5E8F;&#x6027;&#xFF0C;&#x865A;&#x62DF;&#x673A;&#x53EF;&#x4EE5;&#x968F;&#x610F;&#x5730;&#x5BF9;&#x5B83;&#x4EEC;&#x8FDB;&#x884C;&#x91CD;&#x6392;&#x5E8F;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x5C31;&#x6765;&#x5177;&#x4F53;&#x4ECB;&#x7ECD;&#x4E0B; happens-before&#x539F;&#x5219;&#xFF08;&#x5148;&#x884C;&#x53D1;&#x751F;&#x539F;&#x5219;&#xFF09;&#xFF1A;</p>
<ul>
<li><p>&#x7A0B;&#x5E8F;&#x6B21;&#x5E8F;&#x89C4;&#x5219;&#xFF1A;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5185;&#xFF0C;&#x6309;&#x7167;&#x4EE3;&#x7801;&#x987A;&#x5E8F;&#xFF0C;&#x4E66;&#x5199;&#x5728;&#x524D;&#x9762;&#x7684;&#x64CD;&#x4F5C;&#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;&#x4E66;&#x5199;&#x5728;&#x540E;&#x9762;&#x7684;&#x64CD;&#x4F5C;</p>
</li>
<li><p>&#x9501;&#x5B9A;&#x89C4;&#x5219;&#xFF1A;&#x4E00;&#x4E2A; unLock &#x64CD;&#x4F5C;&#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;&#x540E;&#x9762;&#x5BF9;&#x540C;&#x4E00;&#x4E2A;&#x9501;&#x989D; lock &#x64CD;&#x4F5C;</p>
</li>
<li><p>volatile &#x53D8;&#x91CF;&#x89C4;&#x5219;&#xFF1A;&#x5BF9;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x5199;&#x64CD;&#x4F5C;&#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;&#x540E;&#x9762;&#x5BF9;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x8BFB;&#x64CD;&#x4F5C;</p>
</li>
<li><p>&#x4F20;&#x9012;&#x89C4;&#x5219;&#xFF1A;&#x5982;&#x679C;&#x64CD;&#x4F5C; A &#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;&#x64CD;&#x4F5C; B&#xFF0C;&#x800C;&#x64CD;&#x4F5C; B &#x53C8;&#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;&#x64CD;&#x4F5C; C&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;&#x64CD;&#x4F5C; A &#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;&#x64CD;&#x4F5C;C</p>
</li>
<li><p>&#x7EBF;&#x7A0B;&#x542F;&#x52A8;&#x89C4;&#x5219;&#xFF1A;Thread &#x5BF9;&#x8C61;&#x7684; <code>start()</code> &#x65B9;&#x6CD5;&#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;&#x6B64;&#x7EBF;&#x7A0B;&#x7684;&#x6BCF;&#x4E2A;&#x4E00;&#x4E2A;&#x52A8;&#x4F5C;</p>
</li>
<li><p>&#x7EBF;&#x7A0B;&#x4E2D;&#x65AD;&#x89C4;&#x5219;&#xFF1A;&#x5BF9;&#x7EBF;&#x7A0B;<code>interrupt()</code>&#x65B9;&#x6CD5;&#x7684;&#x8C03;&#x7528;&#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;&#x88AB;&#x4E2D;&#x65AD;&#x7EBF;&#x7A0B;&#x7684;&#x4EE3;&#x7801;&#x68C0;&#x6D4B;&#x5230;&#x4E2D;&#x65AD;&#x4E8B;&#x4EF6;&#x7684;&#x53D1;&#x751F;</p>
</li>
<li><p>&#x7EBF;&#x7A0B;&#x7EC8;&#x7ED3;&#x89C4;&#x5219;&#xFF1A;&#x7EBF;&#x7A0B;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x64CD;&#x4F5C;&#x90FD;&#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;&#x7EBF;&#x7A0B;&#x7684;&#x7EC8;&#x6B62;&#x68C0;&#x6D4B;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; <code>Thread.join()</code> &#x65B9;&#x6CD5;&#x7ED3;&#x675F;&#x3001;<code>Thread.isAlive()</code>&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x624B;&#x6BB5;&#x68C0;&#x6D4B;&#x5230;&#x7EBF;&#x7A0B;&#x5DF2;&#x7ECF;&#x7EC8;&#x6B62;&#x6267;&#x884C;</p>
</li>
<li><p>&#x5BF9;&#x8C61;&#x7EC8;&#x7ED3;&#x89C4;&#x5219;&#xFF1A;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x521D;&#x59CB;&#x5316;&#x5B8C;&#x6210;&#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;&#x4ED6;&#x7684;<code>finalize()</code>&#x65B9;&#x6CD5;&#x7684;&#x5F00;&#x59CB;</p>
<p>&#x8FD9; 8 &#x6761;&#x539F;&#x5219;&#x6458;&#x81EA;&#x300A;&#x6DF1;&#x5165;&#x7406;&#x89E3;Java&#x865A;&#x62DF;&#x673A;&#x300B;&#x3002;</p>
<p>&#x8FD9; 8 &#x6761;&#x89C4;&#x5219;&#x4E2D;&#xFF0C;&#x524D; 4 &#x6761;&#x89C4;&#x5219;&#x662F;&#x6BD4;&#x8F83;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x540E; 4 &#x6761;&#x89C4;&#x5219;&#x90FD;&#x662F;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#x524D; 4 &#x6761;&#x89C4;&#x5219;&#xFF1A;</p>
<p>&#x5BF9;&#x4E8E;&#x7A0B;&#x5E8F;&#x6B21;&#x5E8F;&#x89C4;&#x5219;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x7684;&#x7406;&#x89E3;&#x5C31;&#x662F;&#x4E00;&#x6BB5;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x7684;&#x6267;&#x884C;&#x5728;&#x5355;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x770B;&#x8D77;&#x6765;&#x662F;&#x6709;&#x5E8F;&#x7684;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x867D;&#x7136;&#x8FD9;&#x6761;&#x89C4;&#x5219;&#x4E2D;&#x63D0;&#x5230;&#x201C;&#x4E66;&#x5199;&#x5728;&#x524D;&#x9762;&#x7684;&#x64CD;&#x4F5C;&#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;&#x4E66;&#x5199;&#x5728;&#x540E;&#x9762;&#x7684;&#x64CD;&#x4F5C;&#x201D;&#xFF0C;&#x8FD9;&#x4E2A;&#x5E94;&#x8BE5;&#x662F;&#x7A0B;&#x5E8F;&#x770B;&#x8D77;&#x6765;&#x6267;&#x884C;&#x7684;&#x987A;&#x5E8F;&#x662F;&#x6309;&#x7167;&#x4EE3;&#x7801;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x865A;&#x62DF;&#x673A;&#x53EF;&#x80FD;&#x4F1A;&#x5BF9;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x6307;&#x4EE4;&#x91CD;&#x6392;&#x5E8F;&#x3002;&#x867D;&#x7136;&#x8FDB;&#x884C;&#x91CD;&#x6392;&#x5E8F;&#xFF0C;&#x4F46;&#x662F;&#x6700;&#x7EC8;&#x6267;&#x884C;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x4E0E;&#x7A0B;&#x5E8F;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x7ED3;&#x679C;&#x4E00;&#x81F4;&#x7684;&#xFF0C;&#x5B83;&#x53EA;&#x4F1A;&#x5BF9;&#x4E0D;&#x5B58;&#x5728;&#x6570;&#x636E;&#x4F9D;&#x8D56;&#x6027;&#x7684;&#x6307;&#x4EE4;&#x8FDB;&#x884C;&#x91CD;&#x6392;&#x5E8F;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x5355;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#xFF0C;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x770B;&#x8D77;&#x6765;&#x662F;&#x6709;&#x5E8F;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x8981;&#x6CE8;&#x610F;&#x7406;&#x89E3;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E2A;&#x89C4;&#x5219;&#x662F;&#x7528;&#x6765;&#x4FDD;&#x8BC1;&#x7A0B;&#x5E8F;&#x5728;&#x5355;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x7ED3;&#x679C;&#x7684;&#x6B63;&#x786E;&#x6027;&#xFF0C;&#x4F46;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x7A0B;&#x5E8F;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x7684;&#x6B63;&#x786E;&#x6027;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x6761;&#x89C4;&#x5219;&#x4E5F;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x65E0;&#x8BBA;&#x5728;&#x5355;&#x7EBF;&#x7A0B;&#x4E2D;&#x8FD8;&#x662F;&#x591A;&#x7EBF;&#x7A0B;&#x4E2D;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;&#x9501;&#x5982;&#x679C;&#x5904;&#x4E8E;&#x88AB;&#x9501;&#x5B9A;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x90A3;&#x4E48;&#x5FC5;&#x987B;&#x5148;&#x5BF9;&#x9501;&#x8FDB;&#x884C;&#x4E86;&#x91CA;&#x653E;&#x64CD;&#x4F5C;&#xFF0C;&#x540E;&#x9762;&#x624D;&#x80FD;&#x7EE7;&#x7EED;&#x8FDB;&#x884C; lock &#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x6761;&#x89C4;&#x5219;&#x662F;&#x4E00;&#x6761;&#x6BD4;&#x8F83;&#x91CD;&#x8981;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x4E5F;&#x662F;&#x540E;&#x6587;&#x5C06;&#x8981;&#x91CD;&#x70B9;&#x8BB2;&#x8FF0;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x76F4;&#x89C2;&#x5730;&#x89E3;&#x91CA;&#x5C31;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5148;&#x53BB;&#x5199;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x7136;&#x540E;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x53BB;&#x8FDB;&#x884C;&#x8BFB;&#x53D6;&#xFF0C;&#x90A3;&#x4E48;&#x5199;&#x5165;&#x64CD;&#x4F5C;&#x80AF;&#x5B9A;&#x4F1A;&#x5148;&#x884C;&#x53D1;&#x751F;&#x4E8E;&#x8BFB;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x7B2C;&#x56DB;&#x6761;&#x89C4;&#x5219;&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x662F;&#x4F53;&#x73B0; happens-before &#x539F;&#x5219;&#x5177;&#x5907;&#x4F20;&#x9012;&#x6027;&#x3002;</p>
</li>
</ul>
<h2 id="&#x6DF1;&#x5165;&#x5256;&#x6790;volatile&#x5173;&#x952E;&#x5B57;">&#x6DF1;&#x5165;&#x5256;&#x6790;volatile&#x5173;&#x952E;&#x5B57;</h2>
<p>&#x5728;&#x524D;&#x9762;&#x8BB2;&#x8FF0;&#x4E86;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#xFF0C;&#x5176;&#x5B9E;&#x90FD;&#x662F;&#x4E3A;&#x8BB2;&#x8FF0; volatile &#x5173;&#x952E;&#x5B57;&#x4F5C;&#x94FA;&#x57AB;&#xFF0C;&#x90A3;&#x4E48;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x5C31;&#x8FDB;&#x5165;&#x4E3B;&#x9898;&#x3002;</p>
<h3 id="volatile&#x5173;&#x952E;&#x5B57;&#x7684;&#x4E24;&#x5C42;&#x8BED;&#x4E49;">volatile&#x5173;&#x952E;&#x5B57;&#x7684;&#x4E24;&#x5C42;&#x8BED;&#x4E49;</h3>
<p>&#x4E00;&#x65E6;&#x4E00;&#x4E2A;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#xFF08;&#x7C7B;&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x3001;&#x7C7B;&#x7684;&#x9759;&#x6001;&#x6210;&#x5458;&#x53D8;&#x91CF;&#xFF09;&#x88AB; volatile &#x4FEE;&#x9970;&#x4E4B;&#x540E;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x5177;&#x5907;&#x4E86;&#x4E24;&#x5C42;&#x8BED;&#x4E49;&#xFF1A;</p>
<ul>
<li>&#x4FDD;&#x8BC1;&#x4E86;&#x4E0D;&#x540C;&#x7EBF;&#x7A0B;&#x5BF9;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x65F6;&#x7684;&#x53EF;&#x89C1;&#x6027;&#xFF0C;&#x5373;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4FEE;&#x6539;&#x4E86;&#x67D0;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x503C;&#xFF0C;&#x8FD9;&#x65B0;&#x503C;&#x5BF9;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x6765;&#x8BF4;&#x662F;&#x7ACB;&#x5373;&#x53EF;&#x89C1;&#x7684;&#x3002;</li>
<li>&#x7981;&#x6B62;&#x8FDB;&#x884C;&#x6307;&#x4EE4;&#x91CD;&#x6392;&#x5E8F;&#x3002;</li>
</ul>
<p>&#x5148;&#x770B;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#xFF0C;&#x5047;&#x5982;&#x7EBF;&#x7A0B; 1 &#x5148;&#x6267;&#x884C;&#xFF0C;&#x7EBF;&#x7A0B; 2 &#x540E;&#x6267;&#x884C;&#xFF1A;</p>
<pre><code>//&#x7EBF;&#x7A0B;1
boolean stop = false;
while(!stop){
    doSomething();
}

//&#x7EBF;&#x7A0B;2
stop = true;
</code></pre><p>&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x662F;&#x5F88;&#x5178;&#x578B;&#x7684;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x5728;&#x4E2D;&#x65AD;&#x7EBF;&#x7A0B;&#x65F6;&#x53EF;&#x80FD;&#x90FD;&#x4F1A;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x6807;&#x8BB0;&#x529E;&#x6CD5;&#x3002;&#x4F46;&#x662F;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x4F1A;&#x5B8C;&#x5168;&#x8FD0;&#x884C;&#x6B63;&#x786E;&#x4E48;&#xFF1F;&#x5373;&#x4E00;&#x5B9A;&#x4F1A;&#x5C06;&#x7EBF;&#x7A0B;&#x4E2D;&#x65AD;&#x4E48;&#xFF1F;&#x4E0D;&#x4E00;&#x5B9A;&#xFF0C;&#x4E5F;&#x8BB8;&#x5728;&#x5927;&#x591A;&#x6570;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E2A;&#x4EE3;&#x7801;&#x80FD;&#x591F;&#x628A;&#x7EBF;&#x7A0B;&#x4E2D;&#x65AD;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x65E0;&#x6CD5;&#x4E2D;&#x65AD;&#x7EBF;&#x7A0B;&#xFF08;&#x867D;&#x7136;&#x8FD9;&#x4E2A;&#x53EF;&#x80FD;&#x6027;&#x5F88;&#x5C0F;&#xFF0C;&#x4F46;&#x662F;&#x53EA;&#x8981;&#x4E00;&#x65E6;&#x53D1;&#x751F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5C31;&#x4F1A;&#x9020;&#x6210;&#x6B7B;&#x5FAA;&#x73AF;&#x4E86;&#xFF09;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x4E3A;&#x4F55;&#x6709;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x65E0;&#x6CD5;&#x4E2D;&#x65AD;&#x7EBF;&#x7A0B;&#x3002;&#x5728;&#x524D;&#x9762;&#x5DF2;&#x7ECF;&#x89E3;&#x91CA;&#x8FC7;&#xFF0C;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x5728;&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#xFF0C;&#x90A3;&#x4E48;&#x7EBF;&#x7A0B;1&#x5728;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x5C06; stop &#x53D8;&#x91CF;&#x7684;&#x503C;&#x62F7;&#x8D1D;&#x4E00;&#x4EFD;&#x653E;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x5F53;&#x4E2D;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x5F53;&#x7EBF;&#x7A0B; 2 &#x66F4;&#x6539;&#x4E86; stop &#x53D8;&#x91CF;&#x7684;&#x503C;&#x4E4B;&#x540E;&#xFF0C;&#x4F46;&#x662F;&#x8FD8;&#x6CA1;&#x6765;&#x5F97;&#x53CA;&#x5199;&#x5165;&#x4E3B;&#x5B58;&#x5F53;&#x4E2D;&#xFF0C;&#x7EBF;&#x7A0B; 2 &#x8F6C;&#x53BB;&#x505A;&#x5176;&#x4ED6;&#x4E8B;&#x60C5;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x7EBF;&#x7A0B; 1&#x7531;&#x4E8E;&#x4E0D;&#x77E5;&#x9053;&#x7EBF;&#x7A0B; 2 &#x5BF9; stop &#x53D8;&#x91CF;&#x7684;&#x66F4;&#x6539;&#xFF0C;&#x56E0;&#x6B64;&#x8FD8;&#x4F1A;&#x4E00;&#x76F4;&#x5FAA;&#x73AF;&#x4E0B;&#x53BB;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x7528; volatile &#x4FEE;&#x9970;&#x4E4B;&#x540E;&#x5C31;&#x53D8;&#x5F97;&#x4E0D;&#x4E00;&#x6837;&#x4E86;&#xFF1A;</p>
<ul>
<li>&#x4F7F;&#x7528; volatile &#x5173;&#x952E;&#x5B57;&#x4F1A;&#x5F3A;&#x5236;&#x5C06;&#x4FEE;&#x6539;&#x7684;&#x503C;&#x7ACB;&#x5373;&#x5199;&#x5165;&#x4E3B;&#x5B58;&#xFF1B;</li>
<li>&#x4F7F;&#x7528; volatile &#x5173;&#x952E;&#x5B57;&#x7684;&#x8BDD;&#xFF0C;&#x5F53;&#x7EBF;&#x7A0B; 2 &#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x65F6;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x7EBF;&#x7A0B; 1 &#x7684;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E2D;&#x7F13;&#x5B58;&#x53D8;&#x91CF; stop &#x7684;&#x7F13;&#x5B58;&#x884C;&#x65E0;&#x6548;&#xFF08;&#x53CD;&#x6620;&#x5230;&#x786C;&#x4EF6;&#x5C42;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x662F;CPU &#x7684; L1 &#x6216;&#x8005; L2 &#x7F13;&#x5B58;&#x4E2D;&#x5BF9;&#x5E94;&#x7684;&#x7F13;&#x5B58;&#x884C;&#x65E0;&#x6548;&#xFF09;&#xFF1B;</li>
<li>&#x7531;&#x4E8E;&#x7EBF;&#x7A0B;1&#x7684;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E2D;&#x7F13;&#x5B58;&#x53D8;&#x91CF; stop &#x7684;&#x7F13;&#x5B58;&#x884C;&#x65E0;&#x6548;&#xFF0C;&#x6240;&#x4EE5;&#x7EBF;&#x7A0B; 1 &#x518D;&#x6B21;&#x8BFB;&#x53D6;&#x53D8;&#x91CF; stop &#x7684;&#x503C;&#x65F6;&#x4F1A;&#x53BB;&#x4E3B;&#x5B58;&#x8BFB;&#x53D6;&#x3002;</li>
</ul>
<p>&#x90A3;&#x4E48;&#x5728;&#x7EBF;&#x7A0B; 2 &#x4FEE;&#x6539; stop &#x503C;&#x65F6;&#xFF08;&#x5F53;&#x7136;&#x8FD9;&#x91CC;&#x5305;&#x62EC; 2 &#x4E2A;&#x64CD;&#x4F5C;&#xFF0C;&#x4FEE;&#x6539;&#x7EBF;&#x7A0B; 2 &#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x4FEE;&#x6539;&#x540E;&#x7684;&#x503C;&#x5199;&#x5165;&#x5185;&#x5B58;&#xFF09;&#xFF0C;&#x4F1A;&#x4F7F;&#x5F97;&#x7EBF;&#x7A0B; 1 &#x7684;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E2D;&#x7F13;&#x5B58;&#x53D8;&#x91CF; stop &#x7684;&#x7F13;&#x5B58;&#x884C;&#x65E0;&#x6548;&#xFF0C;&#x7136;&#x540E;&#x7EBF;&#x7A0B; 1 &#x8BFB;&#x53D6;&#x65F6;&#xFF0C;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x7F13;&#x5B58;&#x884C;&#x65E0;&#x6548;&#xFF0C;&#x5B83;&#x4F1A;&#x7B49;&#x5F85;&#x7F13;&#x5B58;&#x884C;&#x5BF9;&#x5E94;&#x7684;&#x4E3B;&#x5B58;&#x5730;&#x5740;&#x88AB;&#x66F4;&#x65B0;&#x4E4B;&#x540E;&#xFF0C;&#x7136;&#x540E;&#x53BB;&#x5BF9;&#x5E94;&#x7684;&#x4E3B;&#x5B58;&#x8BFB;&#x53D6;&#x6700;&#x65B0;&#x7684;&#x503C;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x7EBF;&#x7A0B; 1 &#x8BFB;&#x53D6;&#x5230;&#x7684;&#x5C31;&#x662F;&#x6700;&#x65B0;&#x7684;&#x6B63;&#x786E;&#x7684;&#x503C;&#x3002;</p>
<h3 id="volatile-&#x4FDD;&#x8BC1;&#x539F;&#x5B50;&#x6027;&#x5417;">volatile &#x4FDD;&#x8BC1;&#x539F;&#x5B50;&#x6027;&#x5417;</h3>
<p>&#x4ECE;&#x4E0A;&#x9762;&#x77E5;&#x9053; volatile &#x5173;&#x952E;&#x5B57;&#x4FDD;&#x8BC1;&#x4E86;&#x64CD;&#x4F5C;&#x7684;&#x53EF;&#x89C1;&#x6027;&#xFF0C;&#x4F46;&#x662F; volatile &#x80FD;&#x4FDD;&#x8BC1;&#x5BF9;&#x53D8;&#x91CF;&#x7684;&#x64CD;&#x4F5C;&#x662F;&#x539F;&#x5B50;&#x6027;&#x5417;&#xFF1F;</p>
<p>&#x4E0B;&#x9762;&#x770B;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>public class Test {
    public volatile int inc = 0;

    public void increase() {
        inc++;
    }

    public static void main(String[] args) {
        final Test test = new Test();
        for(int i=0;i&lt;10;i++){
            new Thread(){
                public void run() {
                    for(int j=0;j&lt;1000;j++)
                        test.increase();
                };
            }.start();
        }

        while(Thread.activeCount()&gt;1)  //&#x4FDD;&#x8BC1;&#x524D;&#x9762;&#x7684;&#x7EBF;&#x7A0B;&#x90FD;&#x6267;&#x884C;&#x5B8C;
            Thread.yield();
        System.out.println(test.inc);
    }
}
</code></pre><p>&#x5927;&#x5BB6;&#x60F3;&#x4E00;&#x4E0B;&#x8FD9;&#x6BB5;&#x7A0B;&#x5E8F;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x662F;&#x591A;&#x5C11;&#xFF1F;&#x4E5F;&#x8BB8;&#x6709;&#x4E9B;&#x670B;&#x53CB;&#x8BA4;&#x4E3A;&#x662F; 10000&#x3002;&#x4F46;&#x662F;&#x4E8B;&#x5B9E;&#x4E0A;&#x8FD0;&#x884C;&#x5B83;&#x4F1A;&#x53D1;&#x73B0;&#x6BCF;&#x6B21;&#x8FD0;&#x884C;&#x7ED3;&#x679C;&#x90FD;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x5C0F;&#x4E8E; 10000 &#x7684;&#x6570;&#x5B57;&#x3002;</p>
<p>&#x53EF;&#x80FD;&#x6709;&#x7684;&#x670B;&#x53CB;&#x5C31;&#x4F1A;&#x6709;&#x7591;&#x95EE;&#xFF0C;&#x4E0D;&#x5BF9;&#x554A;&#xFF0C;&#x4E0A;&#x9762;&#x662F;&#x5BF9;&#x53D8;&#x91CF; inc &#x8FDB;&#x884C;&#x81EA;&#x589E;&#x64CD;&#x4F5C;&#xFF0C;&#x7531;&#x4E8E; volatile &#x4FDD;&#x8BC1;&#x4E86;&#x53EF;&#x89C1;&#x6027;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x5BF9; inc &#x81EA;&#x589E;&#x5B8C;&#x4E4B;&#x540E;&#xFF0C;&#x5728;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x4E2D;&#x90FD;&#x80FD;&#x770B;&#x5230;&#x4FEE;&#x6539;&#x540E;&#x7684;&#x503C;&#x554A;&#xFF0C;&#x6240;&#x4EE5;&#x6709; 10 &#x4E2A;&#x7EBF;&#x7A0B;&#x5206;&#x522B;&#x8FDB;&#x884C;&#x4E86; 1000 &#x6B21;&#x64CD;&#x4F5C;&#xFF0C;&#x90A3;&#x4E48;&#x6700;&#x7EC8; inc &#x7684;&#x503C;&#x5E94;&#x8BE5;&#x662F; 1000*10=10000&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x9762;&#x5C31;&#x6709;&#x4E00;&#x4E2A;&#x8BEF;&#x533A;&#x4E86;&#xFF0C;volatile &#x5173;&#x952E;&#x5B57;&#x80FD;&#x4FDD;&#x8BC1;&#x53EF;&#x89C1;&#x6027;&#x6CA1;&#x6709;&#x9519;&#xFF0C;&#x4F46;&#x662F;&#x4E0A;&#x9762;&#x7684;&#x7A0B;&#x5E8F;&#x9519;&#x5728;&#x6CA1;&#x80FD;&#x4FDD;&#x8BC1;&#x539F;&#x5B50;&#x6027;&#x3002;&#x53EF;&#x89C1;&#x6027;&#x53EA;&#x80FD;&#x4FDD;&#x8BC1;&#x6BCF;&#x6B21;&#x8BFB;&#x53D6;&#x7684;&#x662F;&#x6700;&#x65B0;&#x7684;&#x503C;&#xFF0C;&#x4F46;&#x662F; volatile &#x6CA1;&#x529E;&#x6CD5;&#x4FDD;&#x8BC1;&#x5BF9;&#x53D8;&#x91CF;&#x7684;&#x64CD;&#x4F5C;&#x7684;&#x539F;&#x5B50;&#x6027;&#x3002;</p>
<p>&#x5728;&#x524D;&#x9762;&#x5DF2;&#x7ECF;&#x63D0;&#x5230;&#x8FC7;&#xFF0C;&#x81EA;&#x589E;&#x64CD;&#x4F5C;&#x662F;&#x4E0D;&#x5177;&#x5907;&#x539F;&#x5B50;&#x6027;&#x7684;&#xFF0C;&#x5B83;&#x5305;&#x62EC;&#x8BFB;&#x53D6;&#x53D8;&#x91CF;&#x7684;&#x539F;&#x59CB;&#x503C;&#x3001;&#x8FDB;&#x884C;&#x52A0; 1 &#x64CD;&#x4F5C;&#x3001;&#x5199;&#x5165;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x3002;&#x90A3;&#x4E48;&#x5C31;&#x662F;&#x8BF4;&#x81EA;&#x589E;&#x64CD;&#x4F5C;&#x7684;&#x4E09;&#x4E2A;&#x5B50;&#x64CD;&#x4F5C;&#x53EF;&#x80FD;&#x4F1A;&#x5206;&#x5272;&#x5F00;&#x6267;&#x884C;&#xFF0C;&#x5C31;&#x6709;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x4E0B;&#x9762;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x51FA;&#x73B0;&#xFF1A;</p>
<p>&#x5047;&#x5982;&#x67D0;&#x4E2A;&#x65F6;&#x523B;&#x53D8;&#x91CF; inc &#x7684;&#x503C;&#x4E3A;10&#xFF0C;</p>
<p>&#x7EBF;&#x7A0B; 1 &#x5BF9;&#x53D8;&#x91CF;&#x8FDB;&#x884C;&#x81EA;&#x589E;&#x64CD;&#x4F5C;&#xFF0C;&#x7EBF;&#x7A0B; 1 &#x5148;&#x8BFB;&#x53D6;&#x4E86;&#x53D8;&#x91CF;inc&#x7684;&#x539F;&#x59CB;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x7EBF;&#x7A0B;1&#x88AB;&#x963B;&#x585E;&#x4E86;&#xFF1B;</p>
<p>&#x7136;&#x540E;&#x7EBF;&#x7A0B; 2 &#x5BF9;&#x53D8;&#x91CF;&#x8FDB;&#x884C;&#x81EA;&#x589E;&#x64CD;&#x4F5C;&#xFF0C;&#x7EBF;&#x7A0B; 2 &#x4E5F;&#x53BB;&#x8BFB;&#x53D6;&#x53D8;&#x91CF; inc &#x7684;&#x539F;&#x59CB;&#x503C;&#xFF0C;&#x7531;&#x4E8E;&#x7EBF;&#x7A0B; 1 &#x53EA;&#x662F;&#x5BF9;&#x53D8;&#x91CF; inc &#x8FDB;&#x884C;&#x8BFB;&#x53D6;&#x64CD;&#x4F5C;&#xFF0C;&#x800C;&#x6CA1;&#x6709;&#x5BF9;&#x53D8;&#x91CF;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x64CD;&#x4F5C;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4;&#x7EBF;&#x7A0B; 2 &#x7684;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E2D;&#x7F13;&#x5B58;&#x53D8;&#x91CF; inc &#x7684;&#x7F13;&#x5B58;&#x884C;&#x65E0;&#x6548;&#xFF0C;&#x6240;&#x4EE5;&#x7EBF;&#x7A0B; 2 &#x4F1A;&#x76F4;&#x63A5;&#x53BB;&#x4E3B;&#x5B58;&#x8BFB;&#x53D6; inc &#x7684;&#x503C;&#xFF0C;&#x53D1;&#x73B0; inc &#x7684;&#x503C;&#x662F; 10&#xFF0C;&#x7136;&#x540E;&#x8FDB;&#x884C;&#x52A0; 1 &#x64CD;&#x4F5C;&#xFF0C;&#x5E76;&#x628A; 11 &#x5199;&#x5165;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#xFF0C;&#x6700;&#x540E;&#x5199;&#x5165;&#x4E3B;&#x5B58;&#x3002;</p>
<p>&#x7136;&#x540E;&#x7EBF;&#x7A0B; 1 &#x63A5;&#x7740;&#x8FDB;&#x884C;&#x52A0; 1 &#x64CD;&#x4F5C;&#xFF0C;&#x7531;&#x4E8E;&#x5DF2;&#x7ECF;&#x8BFB;&#x53D6;&#x4E86; inc &#x7684;&#x503C;&#xFF0C;&#x6CE8;&#x610F;&#x6B64;&#x65F6;&#x5728;&#x7EBF;&#x7A0B; 1 &#x7684;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#x4E2D; inc &#x7684;&#x503C;&#x4ECD;&#x7136;&#x4E3A; 10&#xFF0C;&#x6240;&#x4EE5;&#x7EBF;&#x7A0B; 1 &#x5BF9; inc &#x8FDB;&#x884C;&#x52A0; 1 &#x64CD;&#x4F5C;&#x540E; inc &#x7684;&#x503C;&#x4E3A; 11&#xFF0C;&#x7136;&#x540E;&#x5C06; 11 &#x5199;&#x5165;&#x5DE5;&#x4F5C;&#x5185;&#x5B58;&#xFF0C;&#x6700;&#x540E;&#x5199;&#x5165;&#x4E3B;&#x5B58;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x5206;&#x522B;&#x8FDB;&#x884C;&#x4E86;&#x4E00;&#x6B21;&#x81EA;&#x589E;&#x64CD;&#x4F5C;&#x540E;&#xFF0C;inc &#x53EA;&#x589E;&#x52A0;&#x4E86; 1&#x3002;</p>
<p>&#x89E3;&#x91CA;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x53EF;&#x80FD;&#x6709;&#x670B;&#x53CB;&#x4F1A;&#x6709;&#x7591;&#x95EE;&#xFF0C;&#x4E0D;&#x5BF9;&#x554A;&#xFF0C;&#x524D;&#x9762;&#x4E0D;&#x662F;&#x4FDD;&#x8BC1;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x5728;&#x4FEE;&#x6539; volatile &#x53D8;&#x91CF;&#x65F6;&#xFF0C;&#x4F1A;&#x8BA9;&#x7F13;&#x5B58;&#x884C;&#x65E0;&#x6548;&#x5417;&#xFF1F;&#x7136;&#x540E;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x53BB;&#x8BFB;&#x5C31;&#x4F1A;&#x8BFB;&#x5230;&#x65B0;&#x7684;&#x503C;&#xFF0C;&#x5BF9;&#xFF0C;&#x8FD9;&#x4E2A;&#x6CA1;&#x9519;&#x3002;&#x8FD9;&#x4E2A;&#x5C31;&#x662F;&#x4E0A;&#x9762;&#x7684; happens-before &#x89C4;&#x5219;&#x4E2D;&#x7684; volatile &#x53D8;&#x91CF;&#x89C4;&#x5219;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x7EBF;&#x7A0B; 1 &#x5BF9;&#x53D8;&#x91CF;&#x8FDB;&#x884C;&#x8BFB;&#x53D6;&#x64CD;&#x4F5C;&#x4E4B;&#x540E;&#xFF0C;&#x88AB;&#x963B;&#x585E;&#x4E86;&#x7684;&#x8BDD;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x5BF9; inc &#x503C;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x3002;&#x7136;&#x540E;&#x867D;&#x7136; volatile&#x80FD;&#x4FDD;&#x8BC1;&#x7EBF;&#x7A0B; 2 &#x5BF9;&#x53D8;&#x91CF; inc &#x7684;&#x503C;&#x8BFB;&#x53D6;&#x662F;&#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x8BFB;&#x53D6;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x7EBF;&#x7A0B; 1 &#x6CA1;&#x6709;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#xFF0C;&#x6240;&#x4EE5;&#x7EBF;&#x7A0B; 2 &#x6839;&#x672C;&#x5C31;&#x4E0D;&#x4F1A;&#x770B;&#x5230;&#x4FEE;&#x6539;&#x7684;&#x503C;&#x3002;</p>
<p>&#x6839;&#x6E90;&#x5C31;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x81EA;&#x589E;&#x64CD;&#x4F5C;&#x4E0D;&#x662F;&#x539F;&#x5B50;&#x6027;&#x64CD;&#x4F5C;&#xFF0C;&#x800C;&#x4E14; volatile &#x4E5F;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x5BF9;&#x53D8;&#x91CF;&#x7684;&#x4EFB;&#x4F55;&#x64CD;&#x4F5C;&#x90FD;&#x662F;&#x539F;&#x5B50;&#x6027;&#x7684;&#x3002;</p>
<p>&#x628A;&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x6539;&#x6210;&#x4EE5;&#x4E0B;&#x4EFB;&#x4F55;&#x4E00;&#x79CD;&#x90FD;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x6548;&#x679C;&#xFF1A;</p>
<p>&#x91C7;&#x7528;synchronized&#xFF1A;</p>
<pre><code>public class Test {
    public  int inc = 0;

    public synchronized void increase() {
        inc++;
    }

    public static void main(String[] args) {
        final Test test = new Test();
        for(int i=0;i&lt;10;i++){
            new Thread(){
                public void run() {
                    for(int j=0;j&lt;1000;j++)
                        test.increase();
                };
            }.start();
        }

        while(Thread.activeCount()&gt;1)  //&#x4FDD;&#x8BC1;&#x524D;&#x9762;&#x7684;&#x7EBF;&#x7A0B;&#x90FD;&#x6267;&#x884C;&#x5B8C;
            Thread.yield();
        System.out.println(test.inc);
    }
}
</code></pre><p>&#x7528;Lock</p>
<pre><code>public class Test {
    public  int inc = 0;
    Lock lock = new ReentrantLock();

    public  void increase() {
        lock.lock();
        try {
            inc++;
        } finally{
            lock.unlock();
        }
    }

    public static void main(String[] args) {
        final Test test = new Test();
        for(int i=0;i&lt;10;i++){
            new Thread(){
                public void run() {
                    for(int j=0;j&lt;1000;j++)
                        test.increase();
                };
            }.start();
        }

        while(Thread.activeCount()&gt;1)  //&#x4FDD;&#x8BC1;&#x524D;&#x9762;&#x7684;&#x7EBF;&#x7A0B;&#x90FD;&#x6267;&#x884C;&#x5B8C;
            Thread.yield();
        System.out.println(test.inc);
    }
}
</code></pre><h3 id="volatile&#x80FD;&#x4FDD;&#x8BC1;&#x6709;&#x5E8F;&#x6027;&#x5417;">volatile&#x80FD;&#x4FDD;&#x8BC1;&#x6709;&#x5E8F;&#x6027;&#x5417;</h3>
<p>&#x5728;&#x524D;&#x9762;&#x63D0;&#x5230; volatile &#x5173;&#x952E;&#x5B57;&#x80FD;&#x7981;&#x6B62;&#x6307;&#x4EE4;&#x91CD;&#x6392;&#x5E8F;&#xFF0C;&#x6240;&#x4EE5; volatile &#x80FD;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x4FDD;&#x8BC1;&#x6709;&#x5E8F;&#x6027;&#x3002;</p>
<p>volatile &#x5173;&#x952E;&#x5B57;&#x7981;&#x6B62;&#x6307;&#x4EE4;&#x91CD;&#x6392;&#x5E8F;&#x6709;&#x4E24;&#x5C42;&#x610F;&#x601D;&#xFF1A;</p>
<ul>
<li>&#x5F53;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x5230; volatile &#x53D8;&#x91CF;&#x7684;&#x8BFB;&#x64CD;&#x4F5C;&#x6216;&#x8005;&#x5199;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x5728;&#x5176;&#x524D;&#x9762;&#x7684;&#x64CD;&#x4F5C;&#x7684;&#x66F4;&#x6539;&#x80AF;&#x5B9A;&#x5168;&#x90E8;&#x5DF2;&#x7ECF;&#x8FDB;&#x884C;&#xFF0C;&#x4E14;&#x7ED3;&#x679C;&#x5DF2;&#x7ECF;&#x5BF9;&#x540E;&#x9762;&#x7684;&#x64CD;&#x4F5C;&#x53EF;&#x89C1;&#xFF1B;&#x5728;&#x5176;&#x540E;&#x9762;&#x7684;&#x64CD;&#x4F5C;&#x80AF;&#x5B9A;&#x8FD8;&#x6CA1;&#x6709;&#x8FDB;&#x884C;&#xFF1B;</li>
<li>&#x5728;&#x8FDB;&#x884C;&#x6307;&#x4EE4;&#x4F18;&#x5316;&#x65F6;&#xFF0C;&#x4E0D;&#x80FD;&#x5C06;&#x5728;&#x5BF9; volatile &#x53D8;&#x91CF;&#x8BBF;&#x95EE;&#x7684;&#x8BED;&#x53E5;&#x653E;&#x5728;&#x5176;&#x540E;&#x9762;&#x6267;&#x884C;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x628A; volatile &#x53D8;&#x91CF;&#x540E;&#x9762;&#x7684;&#x8BED;&#x53E5;&#x653E;&#x5230;&#x5176;&#x524D;&#x9762;&#x6267;&#x884C;&#x3002;</li>
</ul>
<p>&#x53EF;&#x80FD;&#x4E0A;&#x9762;&#x8BF4;&#x7684;&#x6BD4;&#x8F83;&#x7ED5;&#xFF0C;&#x4E3E;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>//x&#x3001;y&#x4E3A;&#x975E;volatile&#x53D8;&#x91CF;
//flag&#x4E3A;volatile&#x53D8;&#x91CF;

x = 2;        //&#x8BED;&#x53E5;1
y = 0;        //&#x8BED;&#x53E5;2
flag = true;  //&#x8BED;&#x53E5;3
x = 4;         //&#x8BED;&#x53E5;4
y = -1;       //&#x8BED;
</code></pre><p>&#x7531;&#x4E8E; flag &#x53D8;&#x91CF;&#x4E3A; volatile &#x53D8;&#x91CF;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x8FDB;&#x884C;&#x6307;&#x4EE4;&#x91CD;&#x6392;&#x5E8F;&#x7684;&#x8FC7;&#x7A0B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E0D;&#x4F1A;&#x5C06;&#x8BED;&#x53E5; 3 &#x653E;&#x5230;&#x8BED;&#x53E5; 1&#x3001;&#x8BED;&#x53E5; 2 &#x524D;&#x9762;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x8BB2;&#x8BED;&#x53E5; 3 &#x653E;&#x5230;&#x8BED;&#x53E5; 4&#x3001;&#x8BED;&#x53E5; 5 &#x540E;&#x9762;&#x3002;&#x4F46;&#x662F;&#x8981;&#x6CE8;&#x610F;&#x8BED;&#x53E5; 1 &#x548C;&#x8BED;&#x53E5; 2 &#x7684;&#x987A;&#x5E8F;&#x3001;&#x8BED;&#x53E5; 4 &#x548C;&#x8BED;&#x53E5; 5 &#x7684;&#x987A;&#x5E8F;&#x662F;&#x4E0D;&#x4F5C;&#x4EFB;&#x4F55;&#x4FDD;&#x8BC1;&#x7684;&#x3002;</p>
<p>&#x5E76;&#x4E14; volatile &#x5173;&#x952E;&#x5B57;&#x80FD;&#x4FDD;&#x8BC1;&#xFF0C;&#x6267;&#x884C;&#x5230;&#x8BED;&#x53E5; 3 &#x65F6;&#xFF0C;&#x8BED;&#x53E5; 1 &#x548C;&#x8BED;&#x53E5; 2 &#x5FC5;&#x5B9A;&#x662F;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x4E86;&#x7684;&#xFF0C;&#x4E14;&#x8BED;&#x53E5; 1 &#x548C;&#x8BED;&#x53E5; 2 &#x7684;&#x6267;&#x884C;&#x7ED3;&#x679C;&#x5BF9;&#x8BED;&#x53E5; 3&#x3001;&#x8BED;&#x53E5; 4&#x3001;&#x8BED;&#x53E5; 5 &#x662F;&#x53EF;&#x89C1;&#x7684;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x56DE;&#x5230;&#x524D;&#x9762;&#x4E3E;&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>//&#x7EBF;&#x7A0B;1:
context = loadContext();   //&#x8BED;&#x53E5;1
inited = true;             //&#x8BED;&#x53E5;2

//&#x7EBF;&#x7A0B;2:
while(!inited ){
  sleep()
}
doSomethingwithconfig(context);
</code></pre><p>&#x524D;&#x9762;&#x4E3E;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x63D0;&#x5230;&#x6709;&#x53EF;&#x80FD;&#x8BED;&#x53E5; 2 &#x4F1A;&#x5728;&#x8BED;&#x53E5; 1 &#x4E4B;&#x524D;&#x6267;&#x884C;&#xFF0C;&#x90A3;&#x4E48;&#x4E45;&#x53EF;&#x80FD;&#x5BFC;&#x81F4; context &#x8FD8;&#x6CA1;&#x88AB;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x800C;&#x7EBF;&#x7A0B; 2 &#x4E2D;&#x5C31;&#x4F7F;&#x7528;&#x672A;&#x521D;&#x59CB;&#x5316;&#x7684; context &#x53BB;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x51FA;&#x9519;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x5982;&#x679C;&#x7528; volatile &#x5173;&#x952E;&#x5B57;&#x5BF9; inited &#x53D8;&#x91CF;&#x8FDB;&#x884C;&#x4FEE;&#x9970;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x6267;&#x884C;&#x5230;&#x8BED;&#x53E5; 2 &#x65F6;&#xFF0C;&#x5FC5;&#x5B9A;&#x80FD;&#x4FDD;&#x8BC1; context &#x5DF2;&#x7ECF;&#x521D;&#x59CB;&#x5316;&#x5B8C;&#x6BD5;&#x3002;</p>
<h3 id="volatile-&#x7684;&#x539F;&#x7406;&#x548C;&#x5B9E;&#x73B0;&#x673A;&#x5236;">volatile &#x7684;&#x539F;&#x7406;&#x548C;&#x5B9E;&#x73B0;&#x673A;&#x5236;</h3>
<p>&#x524D;&#x9762;&#x8BB2;&#x8FF0;&#x4E86;&#x6E90;&#x4E8E; volatile &#x5173;&#x952E;&#x5B57;&#x7684;&#x4E00;&#x4E9B;&#x4F7F;&#x7528;&#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x63A2;&#x8BA8;&#x4E00;&#x4E0B; volatile &#x5230;&#x5E95;&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x53EF;&#x89C1;&#x6027;&#x548C;&#x7981;&#x6B62;&#x6307;&#x4EE4;&#x91CD;&#x6392;&#x5E8F;&#x7684;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x8FD9;&#x6BB5;&#x8BDD;&#x6458;&#x81EA;&#x300A;&#x6DF1;&#x5165;&#x7406;&#x89E3;Java&#x865A;&#x62DF;&#x673A;&#x300B;</p>
<p><strong>&#x89C2;&#x5BDF;&#x52A0;&#x5165; volatile &#x5173;&#x952E;&#x5B57;&#x548C;&#x6CA1;&#x6709;&#x52A0;&#x5165; volatile &#x5173;&#x952E;&#x5B57;&#x65F6;&#x6240;&#x751F;&#x6210;&#x7684;&#x6C47;&#x7F16;&#x4EE3;&#x7801;&#x53D1;&#x73B0;&#xFF0C;&#x52A0;&#x5165; volatile &#x5173;&#x952E;&#x5B57;&#x65F6;&#xFF0C;&#x4F1A;&#x591A;&#x51FA;&#x4E00;&#x4E2A; lock &#x524D;&#x7F00;&#x6307;&#x4EE4;</strong></p>
<p>lock &#x524D;&#x7F00;&#x6307;&#x4EE4;&#x5B9E;&#x9645;&#x4E0A;&#x76F8;&#x5F53;&#x4E8E;&#x4E00;&#x4E2A;&#x5185;&#x5B58;&#x5C4F;&#x969C;&#xFF08;&#x4E5F;&#x79F0;&#x5185;&#x5B58;&#x6805;&#x680F;&#xFF09;&#xFF0C;&#x5185;&#x5B58;&#x5C4F;&#x969C;&#x4F1A;&#x63D0;&#x4F9B; 3 &#x4E2A;&#x529F;&#x80FD;&#xFF1A;</p>
<ul>
<li>&#x5B83;&#x786E;&#x4FDD;&#x6307;&#x4EE4;&#x91CD;&#x6392;&#x5E8F;&#x65F6;&#x4E0D;&#x4F1A;&#x628A;&#x5176;&#x540E;&#x9762;&#x7684;&#x6307;&#x4EE4;&#x6392;&#x5230;&#x5185;&#x5B58;&#x5C4F;&#x969C;&#x4E4B;&#x524D;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x628A;&#x524D;&#x9762;&#x7684;&#x6307;&#x4EE4;&#x6392;&#x5230;&#x5185;&#x5B58;&#x5C4F;&#x969C;&#x7684;&#x540E;&#x9762;&#xFF1B;&#x5373;&#x5728;&#x6267;&#x884C;&#x5230;&#x5185;&#x5B58;&#x5C4F;&#x969C;&#x8FD9;&#x53E5;&#x6307;&#x4EE4;&#x65F6;&#xFF0C;&#x5728;&#x5B83;&#x524D;&#x9762;&#x7684;&#x64CD;&#x4F5C;&#x5DF2;&#x7ECF;&#x5168;&#x90E8;&#x5B8C;&#x6210;&#xFF1B;</li>
<li>&#x5B83;&#x4F1A;&#x5F3A;&#x5236;&#x5C06;&#x5BF9;&#x7F13;&#x5B58;&#x7684;&#x4FEE;&#x6539;&#x64CD;&#x4F5C;&#x7ACB;&#x5373;&#x5199;&#x5165;&#x4E3B;&#x5B58;&#xFF1B;</li>
<li>&#x5982;&#x679C;&#x662F;&#x5199;&#x64CD;&#x4F5C;&#xFF0C;&#x5B83;&#x4F1A;&#x5BFC;&#x81F4;&#x5176;&#x4ED6; CPU &#x4E2D;&#x5BF9;&#x5E94;&#x7684;&#x7F13;&#x5B58;&#x884C;&#x65E0;&#x6548;&#x3002;</li>
</ul>
<h2 id="&#x4F7F;&#x7528;-volatile-&#x5173;&#x952E;&#x5B57;&#x7684;&#x573A;&#x666F;">&#x4F7F;&#x7528; volatile &#x5173;&#x952E;&#x5B57;&#x7684;&#x573A;&#x666F;</h2>
<p>synchronized &#x5173;&#x952E;&#x5B57;&#x662F;&#x9632;&#x6B62;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x540C;&#x65F6;&#x6267;&#x884C;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F1A;&#x5F88;&#x5F71;&#x54CD;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x6548;&#x7387;&#xFF0C;&#x800C; volatile &#x5173;&#x952E;&#x5B57;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x6027;&#x80FD;&#x8981;&#x4F18;&#x4E8E; synchronized&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x6CE8;&#x610F; volatile &#x5173;&#x952E;&#x5B57;&#x662F;&#x65E0;&#x6CD5;&#x66FF;&#x4EE3; synchronized &#x5173;&#x952E;&#x5B57;&#x7684;&#xFF0C;&#x56E0;&#x4E3A; volatile &#x5173;&#x952E;&#x5B57;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x64CD;&#x4F5C;&#x7684;&#x539F;&#x5B50;&#x6027;&#x3002;&#x901A;&#x5E38;&#x6765;&#x8BF4;&#xFF0C;&#x4F7F;&#x7528; volatile &#x5FC5;&#x987B;&#x5177;&#x5907;&#x4EE5;&#x4E0B; 2 &#x4E2A;&#x6761;&#x4EF6;&#xFF1A;</p>
<ul>
<li>&#x5BF9;&#x53D8;&#x91CF;&#x7684;&#x5199;&#x64CD;&#x4F5C;&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;&#x5F53;&#x524D;&#x503C;</li>
<li>&#x8BE5;&#x53D8;&#x91CF;&#x6CA1;&#x6709;&#x5305;&#x542B;&#x5728;&#x5177;&#x6709;&#x5176;&#x4ED6;&#x53D8;&#x91CF;&#x7684;&#x4E0D;&#x53D8;&#x5F0F;&#x4E2D;</li>
</ul>
<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E9B;&#x6761;&#x4EF6;&#x8868;&#x660E;&#xFF0C;&#x53EF;&#x4EE5;&#x88AB;&#x5199;&#x5165; volatile &#x53D8;&#x91CF;&#x7684;&#x8FD9;&#x4E9B;&#x6709;&#x6548;&#x503C;&#x72EC;&#x7ACB;&#x4E8E;&#x4EFB;&#x4F55;&#x7A0B;&#x5E8F;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x5305;&#x62EC;&#x53D8;&#x91CF;&#x7684;&#x5F53;&#x524D;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6211;&#x7684;&#x7406;&#x89E3;&#x5C31;&#x662F;&#x4E0A;&#x9762;&#x7684; 2 &#x4E2A;&#x6761;&#x4EF6;&#x9700;&#x8981;&#x4FDD;&#x8BC1;&#x64CD;&#x4F5C;&#x662F;&#x539F;&#x5B50;&#x6027;&#x64CD;&#x4F5C;&#xFF0C;&#x624D;&#x80FD;&#x4FDD;&#x8BC1;&#x4F7F;&#x7528; volatile &#x5173;&#x952E;&#x5B57;&#x7684;&#x7A0B;&#x5E8F;&#x5728;&#x5E76;&#x53D1;&#x65F6;&#x80FD;&#x591F;&#x6B63;&#x786E;&#x6267;&#x884C;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Volatile","level":"1.6.1.1","depth":3,"previous":{"title":"2.1 Memory","level":"1.6.1","depth":2,"ref":"","articles":[{"title":"Volatile","level":"1.6.1.1","depth":3,"path":"java/memory/volatile.md","ref":"java/memory/volatile.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["expandable-chapters"],"pluginsConfig":{"expandable-chapters":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"java/memory/volatile.md","mtime":"2020-07-24T02:32:51.501Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-07-24T02:33:55.722Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

