
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1.2.2 安卓基础 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="架构组件.html" />
    
    
    <link rel="prev" href="AAC.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    1 android
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" >
            
                <span>
            
                    
                    1.1 kotlin
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1.1" data-path="../kotlin/函数.html">
            
                <a href="../kotlin/函数.html">
            
                    
                    1.1.1 函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.1.2" data-path="../kotlin/习惯写法.html">
            
                <a href="../kotlin/习惯写法.html">
            
                    
                    1.1.2 习惯写法
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.2.2" >
            
                <span>
            
                    
                    1.2 基础
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.2.1" data-path="AAC.html">
            
                <a href="AAC.html">
            
                    
                    1.2.1 AAC
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.2.1.1" data-path="安卓基础.html">
            
                <a href="安卓基础.html">
            
                    
                    1.2.2 安卓基础
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.2.2.2" data-path="架构组件.html">
            
                <a href="架构组件.html">
            
                    
                    1.2.3 架构组件
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.2.2.1" data-path="数据库存储.html">
            
                <a href="数据库存储.html">
            
                    
                    1.2.4 数据库存储
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.2.2.3" data-path="网络.html">
            
                <a href="网络.html">
            
                    
                    1.2.5 网络
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    2 Java
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" >
            
                <span>
            
                    
                    2.1 Memory
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1" data-path="../../java/memory/volatile.html">
            
                <a href="../../java/memory/volatile.html">
            
                    
                    Volatile
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >1.2.2 安卓基础</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>[TOC]</p>
<h1 id="&#x5E94;&#x7528;&#x57FA;&#x7840;&#x77E5;&#x8BC6;">&#x5E94;&#x7528;&#x57FA;&#x7840;&#x77E5;&#x8BC6;</h1>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; Kotlin&#x3001;Java &#x548C; C++ &#x8BED;&#x8A00;&#x7F16;&#x5199; Android &#x5E94;&#x7528;&#x3002;Android SDK &#x5DE5;&#x5177;&#x4F1A;&#x5C06;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x8FDE;&#x540C;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x548C;&#x8D44;&#x6E90;&#x6587;&#x4EF6;&#x7F16;&#x8BD1;&#x6210;&#x4E00;&#x4E2A; APK&#xFF08;<em>Android &#x8F6F;&#x4EF6;&#x5305;</em>&#xFF09;&#xFF0C;&#x5373;&#x5E26;&#x6709; <code>.apk</code> &#x540E;&#x7F00;&#x7684;&#x5F52;&#x6863;&#x6587;&#x4EF6;&#x3002;&#x4E00;&#x4E2A; APK &#x6587;&#x4EF6;&#x5305;&#x542B; Android &#x5E94;&#x7528;&#x7684;&#x6240;&#x6709;&#x5185;&#x5BB9;&#xFF0C;&#x5B83;&#x4E5F;&#x662F; Android &#x8BBE;&#x5907;&#x7528;&#x6765;&#x5B89;&#x88C5;&#x5E94;&#x7528;&#x7684;&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x6BCF;&#x4E2A; Android &#x5E94;&#x7528;&#x90FD;&#x5904;&#x4E8E;&#x5404;&#x81EA;&#x7684;&#x5B89;&#x5168;&#x6C99;&#x76D2;&#x4E2D;&#xFF0C;&#x5E76;&#x53D7;&#x4EE5;&#x4E0B; Android &#x5B89;&#x5168;&#x529F;&#x80FD;&#x7684;&#x4FDD;&#x62A4;&#xFF1A;</p>
<ul>
<li><p>Android &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x662F;&#x4E00;&#x79CD;&#x591A;&#x7528;&#x6237; Linux &#x7CFB;&#x7EDF;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5E94;&#x7528;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7528;&#x6237;&#xFF1B;</p>
</li>
<li><p>&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x4E3A;&#x6BCF;&#x4E2A;&#x5E94;&#x7528;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684; Linux &#x7528;&#x6237; ID&#xFF08;&#x8BE5; ID &#x4EC5;&#x7531;&#x7CFB;&#x7EDF;&#x4F7F;&#x7528;&#xFF0C;&#x5E94;&#x7528;&#x5E76;&#x4E0D;&#x77E5;&#x6653;&#xFF09;&#x3002;&#x7CFB;&#x7EDF;&#x4F1A;&#x4E3A;&#x5E94;&#x7528;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x6587;&#x4EF6;&#x8BBE;&#x7F6E;&#x6743;&#x9650;&#xFF0C;&#x4F7F;&#x5F97;&#x53EA;&#x6709;&#x5206;&#x914D;&#x7ED9;&#x8BE5;&#x5E94;&#x7528;&#x7684;&#x7528;&#x6237; ID &#x624D;&#x80FD;&#x8BBF;&#x95EE;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#xFF1B;</p>
</li>
<li>&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x90FD;&#x62E5;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x865A;&#x62DF;&#x673A; (VM)&#xFF0C;&#x56E0;&#x6B64;&#x5E94;&#x7528;&#x4EE3;&#x7801;&#x72EC;&#x7ACB;&#x4E8E;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x800C;&#x8FD0;&#x884C;&#x3002;</li>
<li>&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x5E94;&#x7528;&#x90FD;&#x5728;&#x5176;&#x81EA;&#x5DF1;&#x7684; Linux &#x8FDB;&#x7A0B;&#x5185;&#x8FD0;&#x884C;&#x3002;Android &#x7CFB;&#x7EDF;&#x4F1A;&#x5728;&#x9700;&#x8981;&#x6267;&#x884C;&#x4EFB;&#x4F55;&#x5E94;&#x7528;&#x7EC4;&#x4EF6;&#x65F6;&#x542F;&#x52A8;&#x8BE5;&#x8FDB;&#x7A0B;&#xFF0C;&#x7136;&#x540E;&#x5F53;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x8BE5;&#x8FDB;&#x7A0B;&#x6216;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x4E3A;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x6062;&#x590D;&#x5185;&#x5B58;&#x65F6;&#xFF0C;&#x5176;&#x4FBF;&#x4F1A;&#x5173;&#x95ED;&#x8BE5;&#x8FDB;&#x7A0B;&#x3002;</li>
</ul>
<p>Android &#x7CFB;&#x7EDF;&#x5B9E;&#x73B0;&#x4E86;<em>&#x6700;&#x5C0F;&#x6743;&#x9650;&#x539F;&#x5219;</em>&#x3002;&#x6362;&#x8A00;&#x4E4B;&#xFF0C;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x5E94;&#x7528;&#x53EA;&#x80FD;&#x8BBF;&#x95EE;&#x6267;&#x884C;&#x5176;&#x5DE5;&#x4F5C;&#x6240;&#x9700;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x8BBF;&#x95EE;&#x5176;&#x4ED6;&#x7EC4;&#x4EF6;&#x3002;&#x8FD9;&#x6837;&#x4FBF;&#x80FD;&#x521B;&#x5EFA;&#x975E;&#x5E38;&#x5B89;&#x5168;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x5728;&#x6B64;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x5E94;&#x7528;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x5176;&#x672A;&#x83B7;&#x5F97;&#x6743;&#x9650;&#x7684;&#x7CFB;&#x7EDF;&#x90E8;&#x5206;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x5E94;&#x7528;&#x4ECD;&#x53EF;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x9014;&#x5F84;&#x4E0E;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x4EE5;&#x53CA;&#x8BBF;&#x95EE;&#x7CFB;&#x7EDF;&#x670D;&#x52A1;&#xFF1A;</p>
<ul>
<li>&#x53EF;&#x4EE5;&#x5B89;&#x6392;&#x4E24;&#x4E2A;&#x5E94;&#x7528;&#x5171;&#x4EAB;&#x540C;&#x4E00; Linux &#x7528;&#x6237; ID&#xFF0C;&#x5728;&#x6B64;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E8C;&#x8005;&#x4FBF;&#x80FD;&#x8BBF;&#x95EE;&#x5F7C;&#x6B64;&#x7684;&#x6587;&#x4EF6;&#x3002;&#x4E3A;&#x8282;&#x7701;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#xFF0C;&#x4E5F;&#x53EF;&#x5B89;&#x6392;&#x62E5;&#x6709;&#x76F8;&#x540C;&#x7528;&#x6237; ID &#x7684;&#x5E94;&#x7528;&#x5728;&#x540C;&#x4E00; Linux &#x8FDB;&#x7A0B;&#x4E2D;&#x8FD0;&#x884C;&#xFF0C;&#x5E76;&#x5171;&#x4EAB;&#x540C;&#x4E00; VM&#x3002;&#x5E94;&#x7528;&#x8FD8;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x8BC1;&#x4E66;&#x8FDB;&#x884C;&#x7B7E;&#x540D;&#x3002;</li>
<li>&#x5E94;&#x7528;&#x53EF;&#x4EE5;&#x8BF7;&#x6C42;&#x8BBF;&#x95EE;&#x8BBE;&#x5907;&#x6570;&#x636E;&#xFF08;&#x5982;&#x7528;&#x6237;&#x7684;&#x8054;&#x7CFB;&#x4EBA;&#x3001;&#x77ED;&#x4FE1;&#x6D88;&#x606F;&#x3001;&#x53EF;&#x88C5;&#x8F7D;&#x5B58;&#x50A8;&#x88C5;&#x7F6E;&#xFF08;SD &#x5361;&#xFF09;&#x3001;&#x76F8;&#x673A;&#x3001;&#x84DD;&#x7259;&#x7B49;&#xFF09;&#x7684;&#x6743;&#x9650;&#x3002;&#x7528;&#x6237;&#x5FC5;&#x987B;&#x660E;&#x786E;&#x6388;&#x4E88;&#x8FD9;&#x4E9B;&#x6743;&#x9650;&#x3002;</li>
</ul>
<h2 id="&#x5E94;&#x7528;&#x7EC4;&#x4EF6;">&#x5E94;&#x7528;&#x7EC4;&#x4EF6;</h2>
<p>&#x5E94;&#x7528;&#x7EC4;&#x4EF6;&#x662F; Android &#x5E94;&#x7528;&#x7684;&#x57FA;&#x672C;&#x6784;&#x5EFA;&#x5757;&#x3002;&#x6BCF;&#x4E2A;&#x7EC4;&#x4EF6;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x5165;&#x53E3;&#x70B9;&#xFF0C;&#x7CFB;&#x7EDF;&#x6216;&#x7528;&#x6237;&#x53EF;&#x901A;&#x8FC7;&#x8BE5;&#x5165;&#x53E3;&#x70B9;&#x8FDB;&#x5165;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x3002;&#x6709;&#x4E9B;&#x7EC4;&#x4EF6;&#x4F1A;&#x4F9D;&#x8D56;&#x4E8E;&#x5176;&#x4ED6;&#x7EC4;&#x4EF6;&#x3002;</p>
<p>&#x5171;&#x6709;&#x56DB;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x5E94;&#x7528;&#x7EC4;&#x4EF6;&#x7C7B;&#x578B;&#xFF1A;</p>
<ul>
<li><a href="#Activity">Activity</a></li>
<li><a href="#&#x670D;&#x52A1;">&#x670D;&#x52A1;(Service)</a></li>
<li><a href="#&#x5E7F;&#x64AD;&#x63A5;&#x6536;&#x5668;">&#x5E7F;&#x64AD;&#x63A5;&#x6536;&#x5668;(BroadcastReceiver)</a></li>
<li><a href="#&#x5185;&#x5BB9;&#x63D0;&#x4F9B;&#x7A0B;&#x5E8F;">&#x5185;&#x5BB9;&#x63D0;&#x4F9B;&#x7A0B;&#x5E8F;(ContentProvider)</a></li>
</ul>
<h3 id="activity">Activity</h3>
<p>Activity &#x662F;&#x4E0E;&#x7528;&#x6237;&#x4EA4;&#x4E92;&#x7684;&#x5165;&#x53E3;&#x70B9;&#x3002;&#x5B83;&#x8868;&#x793A;&#x62E5;&#x6709;&#x754C;&#x9762;&#x7684;&#x5355;&#x4E2A;&#x5C4F;&#x5E55;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x5E94;&#x7528;&#x53EF;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x663E;&#x793A;&#x65B0;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x5217;&#x8868;&#x7684; Activity&#x3001;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x64B0;&#x5199;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x7684; Activity &#x4EE5;&#x53CA;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x9605;&#x8BFB;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x7684; Activity&#x3002;&#x5C3D;&#x7BA1;&#x8FD9;&#x4E9B; Activity &#x901A;&#x8FC7;&#x534F;&#x4F5C;&#x5728;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x5E94;&#x7528;&#x4E2D;&#x5F62;&#x6210;&#x4E00;&#x79CD;&#x7D27;&#x5BC6;&#x7ED3;&#x5408;&#x7684;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#xFF0C;&#x4F46;&#x6BCF;&#x4E2A; Activity &#x90FD;&#x72EC;&#x7ACB;&#x4E8E;&#x5176;&#x4ED6; Activity &#x800C;&#x5B58;&#x5728;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x53EF;&#x4EE5;&#x542F;&#x52A8;&#x5176;&#x4E2D;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A; Activity&#xFF08;&#x5982;&#x679C;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x5E94;&#x7528;&#x5141;&#x8BB8;&#xFF09;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x76F8;&#x673A;&#x5E94;&#x7528;&#x53EF;&#x4EE5;&#x542F;&#x52A8;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x5E94;&#x7528;&#x5185;&#x7528;&#x4E8E;&#x64B0;&#x5199;&#x65B0;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x7684; Activity&#xFF0C;&#x4EE5;&#x4FBF;&#x7528;&#x6237;&#x5171;&#x4EAB;&#x56FE;&#x7247;&#x3002;Activity &#x6709;&#x52A9;&#x4E8E;&#x5B8C;&#x6210;&#x7CFB;&#x7EDF;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E4B;&#x95F4;&#x7684;&#x4EE5;&#x4E0B;&#x91CD;&#x8981;&#x4EA4;&#x4E92;&#xFF1A;</p>
<ul>
<li><p>&#x8FFD;&#x8E2A;&#x7528;&#x6237;&#x5F53;&#x524D;&#x5173;&#x5FC3;&#x7684;&#x5185;&#x5BB9;&#xFF08;&#x5C4F;&#x5E55;&#x4E0A;&#x663E;&#x793A;&#x7684;&#x5185;&#x5BB9;&#xFF09;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x7CFB;&#x7EDF;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#x6258;&#x7BA1; Activity &#x7684;&#x8FDB;&#x7A0B;&#x3002;</p>
</li>
<li><p>&#x4E86;&#x89E3;&#x5148;&#x524D;&#x4F7F;&#x7528;&#x7684;&#x8FDB;&#x7A0B;&#x5305;&#x542B;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x8FD4;&#x56DE;&#x7684;&#x5185;&#x5BB9;&#xFF08;&#x5DF2;&#x505C;&#x6B62;&#x7684; Activity&#xFF09;&#xFF0C;&#x4ECE;&#x800C;&#x66F4;&#x4F18;&#x5148;&#x4FDD;&#x7559;&#x8FD9;&#x4E9B;&#x8FDB;&#x7A0B;&#x3002;</p>
</li>
<li><p>&#x5E2E;&#x52A9;&#x5E94;&#x7528;&#x5904;&#x7406;&#x7EC8;&#x6B62;&#x5176;&#x8FDB;&#x7A0B;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4EE5;&#x4FBF;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x8FD4;&#x56DE;&#x5DF2;&#x6062;&#x590D;&#x5176;&#x5148;&#x524D;&#x72B6;&#x6001;&#x7684; Activity&#x3002;</p>
</li>
<li><p>&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x9014;&#x5F84;&#xFF0C;&#x8BA9;&#x5E94;&#x7528;&#x5B9E;&#x73B0;&#x5F7C;&#x6B64;&#x4E4B;&#x95F4;&#x7684;&#x7528;&#x6237;&#x6D41;&#xFF0C;&#x5E76;&#x8BA9;&#x7CFB;&#x7EDF;&#x534F;&#x8C03;&#x8FD9;&#x4E9B;&#x7528;&#x6237;&#x6D41;&#x3002;</p>
</li>
</ul>
<h3 id="&#x670D;&#x52A1;">&#x670D;&#x52A1;</h3>
<p><em>&#x670D;&#x52A1;</em>&#x662F;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x5165;&#x53E3;&#x70B9;&#xFF0C;&#x7528;&#x4E8E;&#x56E0;&#x5404;&#x79CD;&#x539F;&#x56E0;&#x4F7F;&#x5E94;&#x7528;&#x5728;&#x540E;&#x53F0;&#x4FDD;&#x6301;&#x8FD0;&#x884C;&#x72B6;&#x6001;&#x3002;&#x5B83;&#x662F;&#x4E00;&#x79CD;&#x5728;&#x540E;&#x53F0;&#x8FD0;&#x884C;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x7528;&#x4E8E;&#x6267;&#x884C;&#x957F;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x6216;&#x4E3A;&#x8FDC;&#x7A0B;&#x8FDB;&#x7A0B;&#x6267;&#x884C;&#x4F5C;&#x4E1A;&#x3002;&#x670D;&#x52A1;&#x4E0D;&#x63D0;&#x4F9B;&#x754C;&#x9762;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5F53;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x65F6;&#xFF0C;&#x670D;&#x52A1;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x540E;&#x53F0;&#x64AD;&#x653E;&#x97F3;&#x4E50;&#x6216;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x83B7;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x8FD9;&#x4E0D;&#x4F1A;&#x963B;&#x65AD;&#x7528;&#x6237;&#x4E0E; Activity &#x7684;&#x4EA4;&#x4E92;&#x3002;&#x8BF8;&#x5982; Activity &#x7B49;&#x5176;&#x4ED6;&#x7EC4;&#x4EF6;&#x53EF;&#x4EE5;&#x542F;&#x52A8;&#x670D;&#x52A1;&#xFF0C;&#x4F7F;&#x8BE5;&#x670D;&#x52A1;&#x8FD0;&#x884C;&#x6216;&#x7ED1;&#x5B9A;&#x5230;&#x8BE5;&#x670D;&#x52A1;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E0E;&#x5176;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6709;&#x4E24;&#x79CD;&#x622A;&#x7136;&#x4E0D;&#x540C;&#x7684;&#x8BED;&#x4E49;&#x670D;&#x52A1;&#x53EF;&#x4EE5;&#x544A;&#x77E5;&#x7CFB;&#x7EDF;&#x5982;&#x4F55;&#x7BA1;&#x7406;&#x5E94;&#x7528;&#xFF1A;&#x5DF2;&#x542F;&#x52A8;&#x670D;&#x52A1;&#x4F1A;&#x544A;&#x77E5;&#x7CFB;&#x7EDF;&#x4F7F;&#x5176;&#x8FD0;&#x884C;&#x81F3;&#x5DE5;&#x4F5C;&#x5B8C;&#x6BD5;&#x3002;&#x6B64;&#x7C7B;&#x5DE5;&#x4F5C;&#x53EF;&#x4EE5;&#x662F;&#x5728;&#x540E;&#x53F0;&#x540C;&#x6B65;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#xFF0C;&#x6216;&#x8005;&#x5728;&#x7528;&#x6237;&#x79BB;&#x5F00;&#x5E94;&#x7528;&#x540E;&#x7EE7;&#x7EED;&#x64AD;&#x653E;&#x97F3;&#x4E50;&#x3002;&#x5728;&#x540E;&#x53F0;&#x540C;&#x6B65;&#x6570;&#x636E;&#x6216;&#x64AD;&#x653E;&#x97F3;&#x4E50;&#x4E5F;&#x4EE3;&#x8868;&#x4E86;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5DF2;&#x542F;&#x52A8;&#x670D;&#x52A1;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x7CFB;&#x7EDF;&#x5904;&#x7406;&#x5B83;&#x4EEC;&#x7684;&#x65B9;&#x5F0F;&#xFF1A;</p>
<ul>
<li>&#x97F3;&#x4E50;&#x64AD;&#x653E;&#x662F;&#x7528;&#x6237;&#x53EF;&#x76F4;&#x63A5;&#x611F;&#x77E5;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5E94;&#x7528;&#x4F1A;&#x5411;&#x7528;&#x6237;&#x53D1;&#x9001;&#x901A;&#x77E5;&#xFF0C;&#x8868;&#x660E;&#x5176;&#x5E0C;&#x671B;&#x6210;&#x4E3A;&#x524D;&#x53F0;&#xFF0C;&#x4ECE;&#x800C;&#x544A;&#x8BC9;&#x7CFB;&#x7EDF;&#x6B64;&#x6D88;&#x606F;&#xFF1B;&#x5728;&#x6B64;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7CFB;&#x7EDF;&#x660E;&#x767D;&#x5B83;&#x5E94;&#x5C3D;&#x5168;&#x529B;&#x7EF4;&#x6301;&#x8BE5;&#x670D;&#x52A1;&#x8FDB;&#x7A0B;&#x8FD0;&#x884C;&#xFF0C;&#x56E0;&#x4E3A;&#x8FDB;&#x7A0B;&#x6D88;&#x5931;&#x4F1A;&#x4EE4;&#x7528;&#x6237;&#x611F;&#x5230;&#x4E0D;&#x5FEB;&#x3002;</li>
<li>&#x901A;&#x5E38;&#xFF0C;&#x7528;&#x6237;&#x4E0D;&#x4F1A;&#x610F;&#x8BC6;&#x5230;&#x5E38;&#x89C4;&#x540E;&#x53F0;&#x670D;&#x52A1;&#x6B63;&#x5904;&#x4E8E;&#x8FD0;&#x884C;&#x72B6;&#x6001;&#xFF0C;&#x56E0;&#x6B64;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x66F4;&#x81EA;&#x7531;&#x5730;&#x7BA1;&#x7406;&#x5176;&#x8FDB;&#x7A0B;&#x3002;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x4F7F;&#x7528; RAM &#x6765;&#x5904;&#x7406;&#x7528;&#x6237;&#x66F4;&#x8FEB;&#x5207;&#x5173;&#x6CE8;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5219;&#x5176;&#x53EF;&#x80FD;&#x5141;&#x8BB8;&#x7EC8;&#x6B62;&#x670D;&#x52A1;&#xFF08;&#x7136;&#x540E;&#x5728;&#x7A0D;&#x540E;&#x7684;&#x67D0;&#x4E2A;&#x65F6;&#x523B;&#x91CD;&#x542F;&#x670D;&#x52A1;&#xFF09;&#x3002;</li>
</ul>
<p>&#x7ED1;&#x5B9A;&#x670D;&#x52A1;&#x4E4B;&#x6240;&#x4EE5;&#x80FD;&#x8FD0;&#x884C;&#xFF0C;&#x539F;&#x56E0;&#x662F;&#x67D0;&#x4E9B;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#xFF08;&#x6216;&#x7CFB;&#x7EDF;&#xFF09;&#x5DF2;&#x8868;&#x793A;&#x5E0C;&#x671B;&#x4F7F;&#x7528;&#x8BE5;&#x670D;&#x52A1;&#x3002;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x8BB2;&#xFF0C;&#x8FD9;&#x662F;&#x4E3A;&#x53E6;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x63D0;&#x4F9B; API &#x7684;&#x670D;&#x52A1;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x77E5;&#x6653;&#x8FD9;&#x4E9B;&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x8FDB;&#x7A0B; A &#x7ED1;&#x5B9A;&#x5230;&#x8FDB;&#x7A0B; B &#x4E2D;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x7CFB;&#x7EDF;&#x4FBF;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x9700;&#x4F7F;&#x8FDB;&#x7A0B; B&#xFF08;&#x53CA;&#x5176;&#x670D;&#x52A1;&#xFF09;&#x4E3A;&#x8FDB;&#x7A0B; A &#x4FDD;&#x6301;&#x8FD0;&#x884C;&#x72B6;&#x6001;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x8FDB;&#x7A0B; A &#x662F;&#x7528;&#x6237;&#x5173;&#x5FC3;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x7CFB;&#x7EDF;&#x968F;&#x5373;&#x4E5F;&#x77E5;&#x9053;&#x5C06;&#x8FDB;&#x7A0B; B &#x89C6;&#x4E3A;&#x7528;&#x6237;&#x5173;&#x5FC3;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x7531;&#x4E8E;&#x5B58;&#x5728;&#x7075;&#x6D3B;&#x6027;&#xFF08;&#x65E0;&#x8BBA;&#x597D;&#x574F;&#xFF09;&#xFF0C;&#x670D;&#x52A1;&#x5DF2;&#x6210;&#x4E3A;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#x6784;&#x5EFA;&#x5757;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x5B9E;&#x73B0;&#x5404;&#x79CD;&#x9AD8;&#x7EA7;&#x7CFB;&#x7EDF;&#x6982;&#x5FF5;&#x3002;&#x52A8;&#x6001;&#x58C1;&#x7EB8;&#x3001;&#x901A;&#x77E5;&#x4FA6;&#x542C;&#x5668;&#x3001;&#x5C4F;&#x5E55;&#x4FDD;&#x62A4;&#x7A0B;&#x5E8F;&#x3001;&#x8F93;&#x5165;&#x65B9;&#x6CD5;&#x3001;&#x65E0;&#x969C;&#x788D;&#x529F;&#x80FD;&#x670D;&#x52A1;&#x4EE5;&#x53CA;&#x4F17;&#x591A;&#x5176;&#x4ED6;&#x6838;&#x5FC3;&#x7CFB;&#x7EDF;&#x529F;&#x80FD;&#x5747;&#x53EF;&#x6784;&#x5EFA;&#x4E3A;&#x5728;&#x5176;&#x8FD0;&#x884C;&#x65F6;&#x7531;&#x5E94;&#x7528;&#x5B9E;&#x73B0;&#x3001;&#x7CFB;&#x7EDF;&#x7ED1;&#x5B9A;&#x7684;&#x670D;&#x52A1;&#x3002;</p>
<h3 id="&#x5E7F;&#x64AD;&#x63A5;&#x6536;&#x5668;">&#x5E7F;&#x64AD;&#x63A5;&#x6536;&#x5668;</h3>
<p>&#x501F;&#x52A9;<em>&#x5E7F;&#x64AD;&#x63A5;&#x6536;&#x5668;</em>&#x7EC4;&#x4EF6;&#xFF0C;&#x7CFB;&#x7EDF;&#x80FD;&#x591F;&#x5728;&#x5E38;&#x89C4;&#x7528;&#x6237;&#x6D41;&#x4E4B;&#x5916;&#x5411;&#x5E94;&#x7528;&#x4F20;&#x9012;&#x4E8B;&#x4EF6;&#xFF0C;&#x4ECE;&#x800C;&#x5141;&#x8BB8;&#x5E94;&#x7528;&#x54CD;&#x5E94;&#x7CFB;&#x7EDF;&#x8303;&#x56F4;&#x5185;&#x7684;&#x5E7F;&#x64AD;&#x901A;&#x77E5;&#x3002;&#x7531;&#x4E8E;&#x5E7F;&#x64AD;&#x63A5;&#x6536;&#x5668;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x660E;&#x786E;&#x5B9A;&#x4E49;&#x7684;&#x5E94;&#x7528;&#x5165;&#x53E3;&#xFF0C;&#x56E0;&#x6B64;&#x7CFB;&#x7EDF;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x5411;&#x5F53;&#x524D;&#x672A;&#x8FD0;&#x884C;&#x7684;&#x5E94;&#x7528;&#x4F20;&#x9012;&#x5E7F;&#x64AD;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5E94;&#x7528;&#x53EF;&#x901A;&#x8FC7;&#x8C03;&#x5EA6;&#x63D0;&#x9192;&#x6765;&#x53D1;&#x5E03;&#x901A;&#x77E5;&#xFF0C;&#x4EE5;&#x544A;&#x77E5;&#x7528;&#x6237;&#x5373;&#x5C06;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x4EF6;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x901A;&#x8FC7;&#x5C06;&#x8BE5;&#x63D0;&#x9192;&#x4F20;&#x9012;&#x7ED9;&#x5E94;&#x7528;&#x7684;&#x5E7F;&#x64AD;&#x63A5;&#x6536;&#x5668;&#xFF0C;&#x5E94;&#x7528;&#x5728;&#x63D0;&#x9192;&#x54CD;&#x8D77;&#x4E4B;&#x524D;&#x5373;&#x65E0;&#x9700;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#x3002;&#x8BB8;&#x591A;&#x5E7F;&#x64AD;&#x5747;&#x7531;&#x7CFB;&#x7EDF;&#x53D1;&#x8D77;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x901A;&#x77E5;&#x5C4F;&#x5E55;&#x5DF2;&#x5173;&#x95ED;&#x3001;&#x7535;&#x6C60;&#x7535;&#x91CF;&#x4E0D;&#x8DB3;&#x6216;&#x5DF2;&#x62CD;&#x6444;&#x7167;&#x7247;&#x7684;&#x5E7F;&#x64AD;&#x3002;&#x5E94;&#x7528;&#x4E5F;&#x53EF;&#x53D1;&#x8D77;&#x5E7F;&#x64AD;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x901A;&#x77E5;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x67D0;&#x4E9B;&#x6570;&#x636E;&#x5DF2;&#x4E0B;&#x8F7D;&#x81F3;&#x8BBE;&#x5907;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4F9B;&#x5176;&#x4F7F;&#x7528;&#x3002;&#x5C3D;&#x7BA1;&#x5E7F;&#x64AD;&#x63A5;&#x6536;&#x5668;&#x4E0D;&#x4F1A;&#x663E;&#x793A;&#x754C;&#x9762;&#xFF0C;&#x4F46;&#x5176;&#x53EF;&#x4EE5;<a href="https://developer.android.com/guide/topics/ui/notifiers/notifications" target="_blank">&#x521B;&#x5EFA;&#x72B6;&#x6001;&#x680F;&#x901A;&#x77E5;</a>&#xFF0C;&#x5728;&#x53D1;&#x751F;&#x5E7F;&#x64AD;&#x4E8B;&#x4EF6;&#x65F6;&#x63D0;&#x9192;&#x7528;&#x6237;&#x3002;&#x4F46;&#x5E7F;&#x64AD;&#x63A5;&#x6536;&#x5668;&#x66F4;&#x5E38;&#x89C1;&#x7684;&#x7528;&#x9014;&#x53EA;&#x662F;&#x4F5C;&#x4E3A;&#x901A;&#x5411;&#x5176;&#x4ED6;&#x7EC4;&#x4EF6;&#x7684;<em>&#x901A;&#x9053;</em>&#xFF0C;&#x65E8;&#x5728;&#x6267;&#x884C;&#x6781;&#x5C11;&#x91CF;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x4F1A;&#x6839;&#x636E;&#x5E26; <code>JobScheduler</code> &#x7684;&#x4E8B;&#x4EF6;&#x8C03;&#x5EA6; <code>JobService</code> &#x6765;&#x6267;&#x884C;&#x67D0;&#x9879;&#x5DE5;&#x4F5C;</p>
<h3 id="&#x5185;&#x5BB9;&#x63D0;&#x4F9B;&#x7A0B;&#x5E8F;">&#x5185;&#x5BB9;&#x63D0;&#x4F9B;&#x7A0B;&#x5E8F;</h3>
<p><em>&#x5185;&#x5BB9;&#x63D0;&#x4F9B;&#x7A0B;&#x5E8F;</em>&#x7BA1;&#x7406;&#x4E00;&#x7EC4;&#x5171;&#x4EAB;&#x7684;&#x5E94;&#x7528;&#x6570;&#x636E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5728;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3001;SQLite &#x6570;&#x636E;&#x5E93;&#x3001;&#x7F51;&#x7EDC;&#x4E2D;&#x6216;&#x8005;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x53EF;&#x8BBF;&#x95EE;&#x7684;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x6301;&#x4E45;&#x5316;&#x5B58;&#x50A8;&#x4F4D;&#x7F6E;&#x3002;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x53EF;&#x901A;&#x8FC7;&#x5185;&#x5BB9;&#x63D0;&#x4F9B;&#x7A0B;&#x5E8F;&#x67E5;&#x8BE2;&#x6216;&#x4FEE;&#x6539;&#x6570;&#x636E;&#xFF08;&#x5982;&#x679C;&#x5185;&#x5BB9;&#x63D0;&#x4F9B;&#x7A0B;&#x5E8F;&#x5141;&#x8BB8;&#xFF09;&#x3002;</p>
<h2 id="activity&#x751F;&#x547D;&#x5468;&#x671F;">Activity&#x751F;&#x547D;&#x5468;&#x671F;</h2>
<h3 id="&#x7B80;&#x4ECB;">&#x7B80;&#x4ECB;</h3>
<p>&#x5F53;&#x7528;&#x6237;&#x6D4F;&#x89C8;&#x3001;&#x9000;&#x51FA;&#x548C;&#x8FD4;&#x56DE;&#x5230;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x65F6;&#xFF0C;&#x4F60;&#x5E94;&#x7528;&#x4E2D;&#x7684; Activity &#x5B9E;&#x4F8B;&#x4F1A;&#x5728;&#x5176;&#x751F;&#x547D;&#x5468;&#x671F;&#x7684;&#x4E0D;&#x540C;&#x72B6;&#x6001;&#x95F4;&#x8F6C;&#x6362;&#x3002;Activity &#x7C7B;&#x4F1A;&#x63D0;&#x4F9B;&#x8BB8;&#x591A;&#x56DE;&#x8C03;&#xFF0C;&#x8FD9;&#x4E9B;&#x56DE;&#x8C03;&#x4F1A;&#x8BA9; Activity &#x77E5;&#x6653;&#x67D0;&#x4E2A;&#x72B6;&#x6001;&#x5DF2;&#x7ECF;&#x66F4;&#x6539;&#xFF1A;&#x7CFB;&#x7EDF;&#x6B63;&#x5728;&#x521B;&#x5EFA;&#x3001;&#x505C;&#x6B62;&#x6216;&#x6062;&#x590D;&#x67D0;&#x4E2A; Activity&#xFF0C;&#x6216;&#x8005;&#x6B63;&#x5728;&#x9500;&#x6BC1;&#x8BE5; Activity &#x6240;&#x5728;&#x7684;&#x8FDB;&#x7A0B;&#x3002;</p>
<p>&#x5728;&#x751F;&#x547D;&#x5468;&#x671F;&#x56DE;&#x8C03;&#x65B9;&#x6CD5;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x58F0;&#x660E;&#x7528;&#x6237;&#x79BB;&#x5F00;&#x548C;&#x518D;&#x6B21;&#x8FDB;&#x5165; Activity &#x65F6; Activity &#x7684;&#x884C;&#x4E3A;&#x65B9;&#x5F0F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6B63;&#x6784;&#x5EFA;&#x6D41;&#x5A92;&#x4F53;&#x89C6;&#x9891;&#x64AD;&#x653E;&#x5668;&#xFF0C;&#x5F53;&#x7528;&#x6237;&#x5207;&#x6362;&#x81F3;&#x53E6;&#x4E00;&#x5E94;&#x7528;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x8981;&#x6682;&#x505C;&#x89C6;&#x9891;&#x6216;&#x7EC8;&#x6B62;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x3002;&#x5F53;&#x7528;&#x6237;&#x8FD4;&#x56DE;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x91CD;&#x65B0;&#x8FDE;&#x63A5;&#x7F51;&#x7EDC;&#x5E76;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x4ECE;&#x540C;&#x4E00;&#x4F4D;&#x7F6E;&#x7EE7;&#x7EED;&#x64AD;&#x653E;&#x89C6;&#x9891;&#x3002;&#x6362;&#x8A00;&#x4E4B;&#xFF0C;&#x6BCF;&#x4E2A;&#x56DE;&#x8C03;&#x90FD;&#x652F;&#x6301;&#x4F60;&#x6267;&#x884C;&#x9002;&#x5408;&#x7ED9;&#x5B9A;&#x72B6;&#x6001;&#x53D8;&#x66F4;&#x7684;&#x7279;&#x5B9A;&#x4F5C;&#x4E1A;&#x3002;&#x5728;&#x5408;&#x9002;&#x7684;&#x65F6;&#x95F4;&#x6267;&#x884C;&#x6B63;&#x786E;&#x7684;&#x4F5C;&#x4E1A;&#xFF0C;&#x5E76;&#x59A5;&#x5584;&#x5904;&#x7406;&#x8F6C;&#x6362;&#xFF0C;&#x8FD9;&#x5C06;&#x63D0;&#x5347;&#x5E94;&#x7528;&#x7684;&#x7A33;&#x5065;&#x6027;&#x548C;&#x6027;&#x80FD;&#x3002;</p>
<p><img src="https://raw.githubusercontent.com/yanyi5496/yanyi5496.github.io/image/markdown/image-20200702165314795.png" alt="image-20200702165314795"></p>
<h3 id="activity&#x751F;&#x547D;&#x5468;&#x671F;">Activity&#x751F;&#x547D;&#x5468;&#x671F;</h3>
<p>&#x4E3A;&#x4E86;&#x5728; Activity &#x751F;&#x547D;&#x5468;&#x671F;&#x7684;&#x5404;&#x4E2A;&#x9636;&#x6BB5;&#x4E4B;&#x95F4;&#x5BFC;&#x822A;&#x8F6C;&#x6362;&#xFF0C;Activity &#x7C7B;&#x63D0;&#x4F9B;&#x516D;&#x4E2A;&#x6838;&#x5FC3;&#x56DE;&#x8C03;&#xFF1A;<code>onCreate()</code>&#x3001;<code>onStart()</code>&#x3001;<code>onResume()</code>&#x3001;<code>onPause()</code>&#x3001;<code>onStop()</code> &#x548C; <code>onDestroy()</code>&#x3002;&#x5F53; Activity &#x8FDB;&#x5165;&#x65B0;&#x72B6;&#x6001;&#x65F6;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x8C03;&#x7528;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x56DE;&#x8C03;&#x3002;</p>
<ul>
<li><p>onCreate()</p>
<p>  &#x8BE5;&#x56DE;&#x8C03;&#x5FC5;&#x987B;&#x5B9E;&#x73B0;&#xFF0C;&#x5B83;&#x4F1A;&#x5728;&#x7CFB;&#x7EDF;&#x9996;&#x6B21;&#x521B;&#x5EFA; Activity &#x65F6;&#x89E6;&#x53D1;&#x3002;Activity &#x4F1A;&#x5728;&#x521B;&#x5EFA;&#x540E;&#x8FDB;&#x5165;&#x201C;&#x5DF2;&#x521B;&#x5EFA;&#x201D;&#x72B6;&#x6001;&#x3002;&#x5728; <code>onCreate()</code> &#x65B9;&#x6CD5;&#x4E2D;&#xFF0C;&#x9700;&#x6267;&#x884C;&#x57FA;&#x672C;&#x5E94;&#x7528;&#x542F;&#x52A8;&#x903B;&#x8F91;&#xFF0C;&#x8BE5;&#x903B;&#x8F91;&#x5728; Activity &#x7684;&#x6574;&#x4E2A;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E2D;&#x53EA;&#x5E94;&#x53D1;&#x751F;&#x4E00;&#x6B21;&#x3002;&#x4E00;&#x822C;&#x5728;&#x8BE5;&#x56DE;&#x8C03;&#x4E2D;&#x6267;&#x884C;&#x58F0;&#x660E;&#x754C;&#x9762;&#xFF08;&#x5728; XML &#x5E03;&#x5C40;&#x6587;&#x4EF6;&#x4E2D;&#x5B9A;&#x4E49;&#xFF09;&#x3001;&#x5B9A;&#x4E49;&#x6210;&#x5458;&#x53D8;&#x91CF;&#xFF0C;&#x4EE5;&#x53CA;&#x914D;&#x7F6E;&#x67D0;&#x4E9B;&#x754C;&#x9762;&#x3002;</p>
</li>
<li><p>onStart()</p>
<p>  &#x5F53; Activity &#x8FDB;&#x5165;&#x201C;&#x5DF2;&#x5F00;&#x59CB;&#x201D;&#x72B6;&#x6001;&#x65F6;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x8C03;&#x7528;&#x6B64;&#x56DE;&#x8C03;&#x3002;<code>onStart()</code> &#x8C03;&#x7528;&#x4F7F; Activity &#x5BF9;&#x7528;&#x6237;&#x53EF;&#x89C1;&#xFF0C;&#x56E0;&#x4E3A;&#x5E94;&#x7528;&#x4F1A;&#x4E3A; Activity &#x8FDB;&#x5165;&#x524D;&#x53F0;&#x5E76;&#x652F;&#x6301;&#x4E92;&#x52A8;&#x505A;&#x51C6;&#x5907;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5E94;&#x7528;&#x901A;&#x8FC7;&#x6B64;&#x65B9;&#x6CD5;&#x6765;&#x521D;&#x59CB;&#x5316;&#x7EF4;&#x62A4;&#x754C;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<p>  &#x5F53; Activity &#x8FDB;&#x5165;&#x5DF2;&#x5F00;&#x59CB;&#x72B6;&#x6001;&#x65F6;&#xFF0C;&#x4E0E; Activity &#x751F;&#x547D;&#x5468;&#x671F;&#x76F8;&#x5173;&#x8054;&#x7684;&#x6240;&#x6709;&#x751F;&#x547D;&#x5468;&#x671F;&#x611F;&#x77E5;&#x578B;&#x7EC4;&#x4EF6;&#x90FD;&#x5C06;&#x6536;&#x5230; <code>ON_START</code>&#x4E8B;&#x4EF6;&#x3002;</p>
<p>  <code>onStart()</code> &#x65B9;&#x6CD5;&#x4F1A;&#x975E;&#x5E38;&#x5FEB;&#x901F;&#x5730;&#x5B8C;&#x6210;&#xFF0C;&#x5E76;&#x4E14;&#x4E0E;&#x201C;&#x5DF2;&#x521B;&#x5EFA;&#x201D;&#x72B6;&#x6001;&#x4E00;&#x6837;&#xFF0C;Activity &#x4E0D;&#x4F1A;&#x4E00;&#x76F4;&#x5904;&#x4E8E;&#x201C;&#x5DF2;&#x5F00;&#x59CB;&#x201D;&#x72B6;&#x6001;&#x3002;&#x4E00;&#x65E6;&#x6B64;&#x56DE;&#x8C03;&#x7ED3;&#x675F;&#xFF0C;Activity &#x4FBF;&#x4F1A;&#x8FDB;&#x5165;&#x201C;&#x5DF2;&#x6062;&#x590D;&#x201D;&#x72B6;&#x6001;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C06;&#x8C03;&#x7528; <code>onResume()</code> &#x65B9;&#x6CD5;&#x3002;</p>
</li>
<li><p>onResume</p>
<p>  Activity &#x4F1A;&#x5728;&#x8FDB;&#x5165;&#x201C;&#x5DF2;&#x6062;&#x590D;&#x201D;&#x72B6;&#x6001;&#x65F6;&#x6765;&#x5230;&#x524D;&#x53F0;&#xFF0C;&#x7136;&#x540E;&#x7CFB;&#x7EDF;&#x8C03;&#x7528; <code>onResume()</code> &#x56DE;&#x8C03;&#x3002;&#x8FD9;&#x662F;&#x5E94;&#x7528;&#x4E0E;&#x7528;&#x6237;&#x4E92;&#x52A8;&#x7684;&#x72B6;&#x6001;&#x3002;&#x5E94;&#x7528;&#x4F1A;&#x4E00;&#x76F4;&#x4FDD;&#x6301;&#x8FD9;&#x79CD;&#x72B6;&#x6001;&#xFF0C;&#x76F4;&#x5230;&#x67D0;&#x4E9B;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#xFF0C;&#x8BA9;&#x7126;&#x70B9;&#x8FDC;&#x79BB;&#x5E94;&#x7528;&#x3002;&#x6B64;&#x7C7B;&#x4E8B;&#x4EF6;&#x5305;&#x62EC;&#x63A5;&#x5230;&#x6765;&#x7535;&#x3001;&#x7528;&#x6237;&#x5BFC;&#x822A;&#x5230;&#x53E6;&#x4E00;&#x4E2A; Activity&#xFF0C;&#x6216;&#x8BBE;&#x5907;&#x5C4F;&#x5E55;&#x5173;&#x95ED;&#x3002;</p>
<p>  &#x5F53; Activity &#x8FDB;&#x5165;&#x5DF2;&#x6062;&#x590D;&#x72B6;&#x6001;&#x65F6;&#xFF0C;&#x4E0E; Activity &#x751F;&#x547D;&#x5468;&#x671F;&#x76F8;&#x5173;&#x8054;&#x7684;&#x6240;&#x6709;&#x751F;&#x547D;&#x5468;&#x671F;&#x611F;&#x77E5;&#x578B;&#x7EC4;&#x4EF6;&#x90FD;&#x5C06;&#x6536;&#x5230; <code>ON_RESUME</code> &#x4E8B;&#x4EF6;&#x3002;</p>
<p>  &#x5F53;&#x53D1;&#x751F;&#x4E2D;&#x65AD;&#x4E8B;&#x4EF6;&#x65F6;&#xFF0C;Activity &#x8FDB;&#x5165;&#x201C;&#x5DF2;&#x6682;&#x505C;&#x201D;&#x72B6;&#x6001;&#xFF0C;&#x7CFB;&#x7EDF;&#x8C03;&#x7528; <code>onPause()</code> &#x56DE;&#x8C03;&#x3002;</p>
<p>  &#x5982;&#x679C; Activity &#x4ECE;&#x201C;&#x5DF2;&#x6682;&#x505C;&#x201D;&#x72B6;&#x6001;&#x8FD4;&#x56DE;&#x201C;&#x5DF2;&#x6062;&#x590D;&#x201D;&#x72B6;&#x6001;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C06;&#x518D;&#x6B21;&#x8C03;&#x7528; <code>onResume()</code> &#x65B9;&#x6CD5;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5E94;&#x5B9E;&#x73B0; <code>onResume()</code>&#x4EE5;&#x521D;&#x59CB;&#x5316;&#x5728; <code>onPause()</code>]&#x671F;&#x95F4;&#x91CA;&#x653E;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x5E76;&#x6267;&#x884C;&#x6BCF;&#x6B21; Activity &#x8FDB;&#x5165;&#x201C;&#x5DF2;&#x6062;&#x590D;&#x201D;&#x72B6;&#x6001;&#x65F6;&#x5FC5;&#x987B;&#x5B8C;&#x6210;&#x7684;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x521D;&#x59CB;&#x5316;&#x64CD;&#x4F5C;&#x3002;</p>
</li>
<li><p>onPause</p>
<p>  &#x7CFB;&#x7EDF;&#x5C06;&#x6B64;&#x65B9;&#x6CD5;&#x89C6;&#x4E3A;&#x7528;&#x6237;&#x5C06;&#x8981;&#x79BB;&#x5F00;&#x4F60;&#x7684; Activity &#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x6807;&#x5FD7;&#xFF08;&#x5C3D;&#x7BA1;&#x8FD9;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x610F;&#x5473;&#x7740; Activity &#x4F1A;&#x88AB;&#x9500;&#x6BC1;&#xFF09;&#xFF1B;&#x6B64;&#x65B9;&#x6CD5;&#x8868;&#x793A; Activity &#x4E0D;&#x518D;&#x4F4D;&#x4E8E;&#x524D;&#x53F0;&#xFF08;&#x5C3D;&#x7BA1;&#x5728;&#x7528;&#x6237;&#x5904;&#x4E8E;&#x591A;&#x7A97;&#x53E3;&#x6A21;&#x5F0F;&#x65F6; Activity &#x4ECD;&#x7136;&#x53EF;&#x89C1;&#xFF09;&#x3002;Activity &#x8FDB;&#x5165;&#x6B64;&#x72B6;&#x6001;&#x7684;&#x539F;&#x56E0;&#x6709;&#x5F88;&#x591A;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x5982; <a href="https://developer.android.com/guide/components/activities/activity-lifecycle#onresume" target="_blank">onResume()</a> &#x90E8;&#x5206;&#x6240;&#x8FF0;&#xFF0C;&#x67D0;&#x4E2A;&#x4E8B;&#x4EF6;&#x4F1A;&#x4E2D;&#x65AD;&#x5E94;&#x7528;&#x6267;&#x884C;&#x3002;&#x8FD9;&#x662F;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x60C5;&#x51B5;&#x3002;</li>
<li>&#x5728; Android 7.0&#xFF08;API &#x7EA7;&#x522B; 24&#xFF09;&#x6216;&#x66F4;&#x9AD8;&#x7248;&#x672C;&#x4E2D;&#xFF0C;&#x6709;&#x591A;&#x4E2A;&#x5E94;&#x7528;&#x5728;&#x591A;&#x7A97;&#x53E3;&#x6A21;&#x5F0F;&#x4E0B;&#x8FD0;&#x884C;&#x3002;&#x65E0;&#x8BBA;&#x4F55;&#x65F6;&#xFF0C;&#x90FD;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#xFF08;&#x7A97;&#x53E3;&#xFF09;&#x53EF;&#x4EE5;&#x62E5;&#x6709;&#x7126;&#x70B9;&#xFF0C;&#x56E0;&#x6B64;&#x7CFB;&#x7EDF;&#x4F1A;&#x6682;&#x505C;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x3002;</li>
<li><p>&#x6709;&#x65B0;&#x7684;&#x534A;&#x900F;&#x660E; Activity&#xFF08;&#x4F8B;&#x5982;&#x5BF9;&#x8BDD;&#x6846;&#xFF09;&#x5904;&#x4E8E;&#x5F00;&#x542F;&#x72B6;&#x6001;&#x3002;&#x53EA;&#x8981; Activity &#x4ECD;&#x7136;&#x90E8;&#x5206;&#x53EF;&#x89C1;&#x4F46;&#x5E76;&#x672A;&#x5904;&#x4E8E;&#x7126;&#x70B9;&#x4E4B;&#x4E2D;&#xFF0C;&#x5B83;&#x4FBF;&#x4F1A;&#x4E00;&#x76F4;&#x6682;&#x505C;&#x3002;</p>
<p>&#x5F53; Activity &#x8FDB;&#x5165;&#x5DF2;&#x6682;&#x505C;&#x72B6;&#x6001;&#x65F6;&#xFF0C;&#x4E0E; Activity &#x751F;&#x547D;&#x5468;&#x671F;&#x76F8;&#x5173;&#x8054;&#x7684;&#x6240;&#x6709;&#x751F;&#x547D;&#x5468;&#x671F;&#x611F;&#x77E5;&#x578B;&#x7EC4;&#x4EF6;&#x90FD;&#x5C06;&#x6536;&#x5230; <code>ON_PAUSE</code>&#x4E8B;&#x4EF6;&#x3002;&#x8FD9;&#x65F6;&#xFF0C;&#x751F;&#x547D;&#x5468;&#x671F;&#x7EC4;&#x4EF6;&#x53EF;&#x4EE5;&#x505C;&#x6B62;&#x5728;&#x7EC4;&#x4EF6;&#x672A;&#x4F4D;&#x4E8E;&#x524D;&#x53F0;&#x65F6;&#x65E0;&#x9700;&#x8FD0;&#x884C;&#x7684;&#x4EFB;&#x4F55;&#x529F;&#x80FD;&#x3002;</p>
<p><code>onPause()</code> &#x65B9;&#x6CD5;&#x7684;&#x5B8C;&#x6210;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740; Activity &#x79BB;&#x5F00;&#x201C;&#x5DF2;&#x6682;&#x505C;&#x201D;&#x72B6;&#x6001;&#x3002;&#x76F8;&#x53CD;&#xFF0C;Activity &#x4F1A;&#x4FDD;&#x6301;&#x6B64;&#x72B6;&#x6001;&#xFF0C;&#x76F4;&#x5230;&#x5176;&#x6062;&#x590D;&#x6216;&#x53D8;&#x6210;&#x5BF9;&#x7528;&#x6237;&#x5B8C;&#x5168;&#x4E0D;&#x53EF;&#x89C1;&#x3002;&#x5982;&#x679C; Activity &#x6062;&#x590D;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C06;&#x518D;&#x6B21;&#x8C03;&#x7528; <code>onResume()</code> &#x56DE;&#x8C03;&#x3002;&#x5982;&#x679C; Activity &#x4ECE;&#x201C;&#x5DF2;&#x6682;&#x505C;&#x201D;&#x72B6;&#x6001;&#x8FD4;&#x56DE;&#x201C;&#x5DF2;&#x6062;&#x590D;&#x201D;&#x72B6;&#x6001;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x8BA9; <code>Activity</code> &#x5B9E;&#x4F8B;&#x7EE7;&#x7EED;&#x9A7B;&#x7559;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x5E76;&#x4F1A;&#x5728;&#x7CFB;&#x7EDF;&#x8C03;&#x7528; <code>onResume()</code> &#x65F6;&#x91CD;&#x65B0;&#x8C03;&#x7528;&#x8BE5;&#x5B9E;&#x4F8B;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x65E0;&#x9700;&#x91CD;&#x65B0;&#x521D;&#x59CB;&#x5316;&#x5728;&#x4EFB;&#x4F55;&#x56DE;&#x8C03;&#x65B9;&#x6CD5;&#x5BFC;&#x81F4; Activity &#x8FDB;&#x5165;&#x201C;&#x5DF2;&#x6062;&#x590D;&#x201D;&#x72B6;&#x6001;&#x671F;&#x95F4;&#x521B;&#x5EFA;&#x7684;&#x7EC4;&#x4EF6;&#x3002;&#x5982;&#x679C; Activity &#x53D8;&#x4E3A;&#x5B8C;&#x5168;&#x4E0D;&#x53EF;&#x89C1;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x8C03;&#x7528; <code>onStop()</code>&#x3002;</p>
</li>
</ul>
</li>
<li><p>onStop</p>
<p>  &#x5982;&#x679C;&#x4F60;&#x7684; Activity &#x4E0D;&#x518D;&#x5BF9;&#x7528;&#x6237;&#x53EF;&#x89C1;&#xFF0C;&#x8BF4;&#x660E;&#x5176;&#x5DF2;&#x8FDB;&#x5165;&#x201C;&#x5DF2;&#x505C;&#x6B62;&#x201D;&#x72B6;&#x6001;&#xFF0C;&#x56E0;&#x6B64;&#x7CFB;&#x7EDF;&#x5C06;&#x8C03;&#x7528; <code>onStop()</code> &#x56DE;&#x8C03;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5F53;&#x65B0;&#x542F;&#x52A8;&#x7684; Activity &#x8986;&#x76D6;&#x6574;&#x4E2A;&#x5C4F;&#x5E55;&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;&#x5982;&#x679C; Activity &#x5DF2;&#x7ED3;&#x675F;&#x8FD0;&#x884C;&#x5E76;&#x5373;&#x5C06;&#x7EC8;&#x6B62;&#xFF0C;&#x7CFB;&#x7EDF;&#x8FD8;&#x53EF;&#x4EE5;&#x8C03;&#x7528; <code>onStop()</code>&#x3002;</p>
<p>  &#x8FDB;&#x5165;&#x201C;&#x5DF2;&#x505C;&#x6B62;&#x201D;&#x72B6;&#x6001;&#x540E;&#xFF0C;Activity &#x8981;&#x4E48;&#x8FD4;&#x56DE;&#x4E0E;&#x7528;&#x6237;&#x4E92;&#x52A8;&#xFF0C;&#x8981;&#x4E48;&#x7ED3;&#x675F;&#x8FD0;&#x884C;&#x5E76;&#x6D88;&#x5931;&#x3002;&#x5982;&#x679C; Activity &#x8FD4;&#x56DE;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C06;&#x8C03;&#x7528; <code>onRestart()</code>&#x3002;&#x5982;&#x679C; <code>Activity</code> &#x7ED3;&#x675F;&#x8FD0;&#x884C;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C06;&#x8C03;&#x7528; <code>onDestroy()</code>&#x3002;&#x4E0B;&#x4E00;&#x90E8;&#x5206;&#x5C06;&#x4ECB;&#x7ECD; <code>onDestroy()</code> &#x56DE;&#x8C03;&#x3002;</p>
</li>
<li><p>onDestory</p>
<p>  &#x9500;&#x6BC1; Ativity &#x4E4B;&#x524D;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x5148;&#x8C03;&#x7528; <code>onDestroy()</code>&#x3002;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x6B64;&#x56DE;&#x8C03;&#x7684;&#x539F;&#x56E0;&#x5982;&#x4E0B;&#xFF1A;</p>
<ol>
<li>Activity &#x5373;&#x5C06;&#x7ED3;&#x675F;&#xFF08;&#x7531;&#x4E8E;&#x7528;&#x6237;&#x5F7B;&#x5E95;&#x5173;&#x95ED; Activity &#x6216;&#x7531;&#x4E8E;&#x7CFB;&#x7EDF;&#x4E3A; Activity &#x8C03;&#x7528; <code>finish()</code>&#xFF09;&#xFF0C;&#x6216;&#x8005;</li>
<li><p>&#x7531;&#x4E8E;&#x914D;&#x7F6E;&#x53D8;&#x66F4;&#xFF08;&#x4F8B;&#x5982;&#x8BBE;&#x5907;&#x65CB;&#x8F6C;&#x6216;&#x591A;&#x7A97;&#x53E3;&#x6A21;&#x5F0F;&#xFF09;&#xFF0C;&#x7CFB;&#x7EDF;&#x6682;&#x65F6;&#x9500;&#x6BC1; Activity</p>
<p>&#x5F53; Activity &#x8FDB;&#x5165;&#x5DF2;&#x9500;&#x6BC1;&#x72B6;&#x6001;&#x65F6;&#xFF0C;&#x4E0E; Activity &#x751F;&#x547D;&#x5468;&#x671F;&#x76F8;&#x5173;&#x8054;&#x7684;&#x6240;&#x6709;&#x751F;&#x547D;&#x5468;&#x671F;&#x611F;&#x77E5;&#x578B;&#x7EC4;&#x4EF6;&#x90FD;&#x5C06;&#x6536;&#x5230; <code>ON_DESTROY</code>&#x4E8B;&#x4EF6;&#x3002;&#x8FD9;&#x65F6;&#xFF0C;&#x751F;&#x547D;&#x5468;&#x671F;&#x7EC4;&#x4EF6;&#x53EF;&#x4EE5;&#x5728; Activity &#x88AB;&#x9500;&#x6BC1;&#x4E4B;&#x524D;&#x6E05;&#x7406;&#x6240;&#x9700;&#x7684;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x3002;&#x5982;&#x679C; Activity &#x5373;&#x5C06;&#x7ED3;&#x675F;&#xFF0C;onDestroy() &#x662F; Activity &#x6536;&#x5230;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x751F;&#x547D;&#x5468;&#x671F;&#x56DE;&#x8C03;&#x3002;&#x5982;&#x679C;&#x7531;&#x4E8E;&#x914D;&#x7F6E;&#x53D8;&#x66F4;&#x800C;&#x8C03;&#x7528; onDestroy()&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x7ACB;&#x5373;&#x65B0;&#x5EFA; Activity &#x5B9E;&#x4F8B;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x65B0;&#x914D;&#x7F6E;&#x4E2D;&#x4E3A;&#x65B0;&#x5B9E;&#x4F8B;&#x8C03;&#x7528; <code>onCreate()</code>&#x3002;<code>onDestroy()</code>&#x56DE;&#x8C03;&#x5E94;&#x91CA;&#x653E;&#x5148;&#x524D;&#x7684;&#x56DE;&#x8C03;&#xFF08;&#x4F8B;&#x5982; <code>onStop()</code>&#xFF09;&#x5C1A;&#x672A;&#x91CA;&#x653E;&#x7684;&#x6240;&#x6709;&#x8D44;&#x6E90;&#x3002;</p>
</li>
</ol>
</li>
</ul>
<h3 id="activity-&#x72B6;&#x6001;&#x548C;&#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x5F39;&#x51FA;">Activity &#x72B6;&#x6001;&#x548C;&#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x5F39;&#x51FA;</h3>
<p>&#x7CFB;&#x7EDF;&#x4F1A;&#x5728;&#x9700;&#x8981;&#x91CA;&#x653E; RAM &#x65F6;&#x7EC8;&#x6B62;&#x8FDB;&#x7A0B;&#xFF1B;&#x7CFB;&#x7EDF;&#x7EC8;&#x6B62;&#x7ED9;&#x5B9A;&#x8FDB;&#x7A0B;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x53D6;&#x51B3;&#x4E8E;&#x5F53;&#x65F6;&#x8FDB;&#x7A0B;&#x7684;&#x72B6;&#x6001;&#x3002;&#x53CD;&#x4E4B;&#xFF0C;&#x8FDB;&#x7A0B;&#x72B6;&#x6001;&#x53D6;&#x51B3;&#x4E8E;&#x5728;&#x8FDB;&#x7A0B;&#x4E2D;&#x8FD0;&#x884C;&#x7684; Activity &#x7684;&#x72B6;&#x6001;&#x3002;&#x4E0B;&#x56FE;&#x5C55;&#x793A;&#x4E86;&#x8FDB;&#x7A0B;&#x72B6;&#x6001;&#x3001;Activity &#x72B6;&#x6001;&#x4EE5;&#x53CA;&#x7CFB;&#x7EDF;&#x7EC8;&#x6B62;&#x8FDB;&#x7A0B;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
<p><img src="https://raw.githubusercontent.com/yanyi5496/yanyi5496.github.io/image/markdown/image-20200702173128293.png" alt="image-20200702173128293"></p>
<h3 id="activity&#x72B6;&#x6001;&#x53D8;&#x66F4;">activity&#x72B6;&#x6001;&#x53D8;&#x66F4;</h3>
<ul>
<li><p>&#x914D;&#x7F6E;&#x66F4;&#x6539;</p>
<p>  &#x4F8B;&#x5982;&#x6A2A;&#x7AD6;&#x5C4F;&#x5207;&#x6362;&#xFF0C;Activity&#x4F1A;&#x88AB;&#x9500;&#x6BC1;&#x5E76;&#x91CD;&#x65B0;&#x521B;&#x5EFA;&#x3002;&#x539F;&#x59CB; Activity &#x5B9E;&#x4F8B;&#x5C06;&#x89E6;&#x53D1; <code>onPause()</code>&#x3001;<code>onStop()</code>&#x548C; <code>onDestroy()</code>&#x56DE;&#x8C03;&#x3002;&#x7CFB;&#x7EDF;&#x5C06;&#x521B;&#x5EFA;&#x65B0;&#x7684; Activity &#x5B9E;&#x4F8B;&#xFF0C;&#x5E76;&#x89E6;&#x53D1; <a href="https://developer.android.com/reference/android/app/Activity#onCreate(android.os.Bundle" target="_blank"><code>onCreate()</code></a>)&#x3001;<a href="https://developer.android.com/reference/android/app/Activity#onstart" target="_blank"><code>onStart()</code></a> &#x548C; <a href="https://developer.android.com/reference/android/app/Activity#onResume(" target="_blank"><code>onResume()</code></a>) &#x56DE;&#x8C03;&#x3002;</p>
</li>
<li><p>&#x591A;&#x7A97;&#x53E3;&#x6A21;&#x5F0F;</p>
<p>  &#x5E94;&#x7528;&#x8FDB;&#x5165;&#x591A;&#x7A97;&#x53E3;&#x6A21;&#x5F0F;&#xFF08;API&gt;=24&#xFF0C;android 7.0&#xFF09;&#xFF0C;&#x5728;&#x591A;&#x7A97;&#x53E3;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x867D;&#x7136;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4E24;&#x4E2A;&#x5E94;&#x7528;&#xFF0C;&#x4F46;&#x53EA;&#x6709;&#x4E0E;&#x7528;&#x6237;&#x4EA4;&#x4E92;&#x7684;&#x5E94;&#x7528;&#x4F4D;&#x4E8E;&#x524D;&#x53F0;&#x4E14;&#x5177;&#x6709;&#x7126;&#x70B9;&#x3002;&#x8BE5; Activity &#x5904;&#x4E8E;&#x201C;&#x5DF2;&#x6062;&#x590D;&#x201D;&#x72B6;&#x6001;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x4E2A;&#x7A97;&#x53E3;&#x4E2D;&#x7684;&#x5E94;&#x7528;&#x5219;&#x5904;&#x4E8E;&#x201C;&#x5DF2;&#x6682;&#x505C;&#x201D;&#x72B6;&#x6001;&#x3002;</p>
<p>  &#x5F53;&#x7528;&#x6237;&#x4ECE;&#x5E94;&#x7528; A &#x5207;&#x6362;&#x5230;&#x5E94;&#x7528; B &#x65F6;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x5BF9;&#x5E94;&#x7528; A &#x8C03;&#x7528; <code>onPause()</code>&#xFF0C;&#x5BF9;&#x5E94;&#x7528; B &#x8C03;&#x7528; <code>onResume()</code>&#x3002;&#x6BCF;&#x5F53;&#x7528;&#x6237;&#x5728;&#x5E94;&#x7528;&#x4E4B;&#x95F4;&#x5207;&#x6362;&#x65F6;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C31;&#x4F1A;&#x5728;&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x4E4B;&#x95F4;&#x5207;&#x6362;&#x3002;</p>
<p>  &#x5728;&#x591A;&#x7A97;&#x53E3;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x53EA;&#x6709;&#x6700;&#x8FD1;&#x5728;&#x6307;&#x5B9A;&#x65F6;&#x95F4;&#x5185;&#x4E0E;&#x7528;&#x6237;&#x4EA4;&#x4E92;&#x7684; Activity &#x4E3A;&#x6D3B;&#x52A8;&#x72B6;&#x6001;&#x3002;&#x6B64; Activity &#x88AB;&#x89C6;&#x4E3A;<em>&#x9876;&#x7AEF;</em> Activity&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x552F;&#x4E00;&#x5904;&#x4E8E; <a href="https://developer.android.com/reference/androidx/lifecycle/Lifecycle.State" target="_blank"><code>RESUMED</code></a> &#x72B6;&#x6001;&#x7684; Activity&#x3002;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x53EF;&#x89C1;&#x7684; Activity &#x5747;&#x5904;&#x4E8E; <a href="https://developer.android.com/reference/androidx/lifecycle/Lifecycle.State" target="_blank"><code>STARTED</code></a> &#x800C;&#x975E; <a href="https://developer.android.com/reference/androidx/lifecycle/Lifecycle.State" target="_blank"><code>RESUMED</code></a> &#x7684;&#x72B6;&#x6001;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x5904;&#x4E8E;&#x53EF;&#x89C1;&#x800C;&#x975E;&#x6062;&#x590D;&#x72B6;&#x6001;&#x7684; Activity &#x5728;&#x7CFB;&#x7EDF;&#x4E2D;&#x4EAB;&#x6709;&#x6BD4;&#x4E0D;&#x53EF;&#x89C1; Activity &#x66F4;&#x9AD8;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x3002;&#x5982;&#x679C;&#x7528;&#x6237;&#x4E0E;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x53EF;&#x89C1;&#x7684; Activity &#x4EA4;&#x4E92;&#xFF0C;&#x5219;&#x8BE5; Activity &#x5C06;&#x5904;&#x4E8E;&#x6062;&#x590D;&#x72B6;&#x6001;&#xFF0C;&#x800C;&#x4E4B;&#x524D;&#x7684;&#x9876;&#x7AEF; Activity &#x5C06;&#x8FDB;&#x5165; <a href="https://developer.android.com/reference/androidx/lifecycle/Lifecycle.State" target="_blank"><code>STARTED</code></a> &#x72B6;&#x6001;&#x3002;</p>
<p>  &#x5728;&#x591A;&#x7A97;&#x53E3;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x5E94;&#x7528;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x5904;&#x4E8E; <a href="https://developer.android.com/reference/androidx/lifecycle/Lifecycle.State" target="_blank"><code>RESUMED</code></a> &#x72B6;&#x6001;&#xFF0C;&#x5373;&#x4F7F;&#x8BE5;&#x5E94;&#x7528;&#x5BF9;&#x7528;&#x6237;&#x53EF;&#x89C1;&#x3002;&#x5F53;&#x4E0D;&#x5904;&#x4E8E;&#x9876;&#x7AEF;&#x72B6;&#x6001;&#x65F6;&#xFF0C;&#x5E94;&#x7528;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x5176;&#x64CD;&#x4F5C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5904;&#x4E8E;&#x6B64;&#x72B6;&#x6001;&#x7684;&#x89C6;&#x9891;&#x64AD;&#x653E;&#x5E94;&#x7528;&#x5E94;&#x7EE7;&#x7EED;&#x663E;&#x793A;&#x5176;&#x89C6;&#x9891;&#x3002;&#x51FA;&#x4E8E;&#x6B64;&#x539F;&#x56E0;&#xFF0C;&#x6211;&#x4EEC;&#x5EFA;&#x8BAE;&#x64AD;&#x653E;&#x89C6;&#x9891;&#x7684; Activity <em>&#x4E0D;&#x8981;</em>&#x901A;&#x8FC7;&#x6682;&#x505C;&#x89C6;&#x9891;&#x64AD;&#x653E;&#x6765;&#x54CD;&#x5E94; <a href="https://developer.android.com/reference/androidx/lifecycle/Lifecycle.Event" target="_blank"><code>ON_PAUSE</code></a> &#x751F;&#x547D;&#x5468;&#x671F;&#x4E8B;&#x4EF6;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x8BE5; Activity &#x5E94;&#x901A;&#x8FC7;&#x5F00;&#x59CB;&#x64AD;&#x653E;&#x6765;&#x54CD;&#x5E94; <a href="https://developer.android.com/reference/androidx/lifecycle/Lifecycle.Event" target="_blank"><code>ON_START</code></a>&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x6682;&#x505C;&#x64AD;&#x653E;&#x6765;&#x54CD;&#x5E94; <a href="https://developer.android.com/reference/androidx/lifecycle/Lifecycle.Event" target="_blank"><code>ON_STOP</code></a>&#x3002;&#x5982;&#x679C;&#x4F60;&#x672A;&#x4F7F;&#x7528;<a href="https://developer.android.com/topic/libraries/architecture/lifecycle" target="_blank">&#x751F;&#x547D;&#x5468;&#x671F;</a>&#x8F6F;&#x4EF6;&#x5305;&#xFF0C;&#x800C;&#x662F;&#x76F4;&#x63A5;&#x5904;&#x7406;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E8B;&#x4EF6;&#xFF0C;&#x8BF7;&#x5728;&#x4F60;&#x7684; <code>onStop()</code> &#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x4E2D;&#x6682;&#x505C;&#x89C6;&#x9891;&#x64AD;&#x653E;&#xFF0C;&#x7136;&#x540E;&#x5728; <code>onStart()</code> &#x4E2D;&#x7EE7;&#x7EED;&#x64AD;&#x653E;&#x3002;</p>
</li>
<li><p>Activity &#x6216;&#x5BF9;&#x8BDD;&#x6846;&#x663E;&#x793A;&#x5728;&#x524D;&#x53F0;</p>
<p>  &#x5982;&#x679C;&#x6709;&#x65B0;&#x7684; Activity &#x6216;&#x5BF9;&#x8BDD;&#x6846;&#x51FA;&#x73B0;&#x5728;&#x524D;&#x53F0;&#xFF0C;&#x5E76;&#x4E14;&#x5C40;&#x90E8;&#x8986;&#x76D6;&#x4E86;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x7684; Activity&#xFF0C;&#x5219;&#x88AB;&#x8986;&#x76D6;&#x7684; Activity &#x4F1A;&#x5931;&#x53BB;&#x7126;&#x70B9;&#x5E76;&#x8FDB;&#x5165;&#x201C;&#x5DF2;&#x6682;&#x505C;&#x201D;&#x72B6;&#x6001;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x8C03;&#x7528; <code>onPause()</code>&#x3002;</p>
<p>  &#x5F53;&#x88AB;&#x8986;&#x76D6;&#x7684; Activity &#x8FD4;&#x56DE;&#x5230;&#x524D;&#x53F0;&#x5E76;&#x91CD;&#x65B0;&#x83B7;&#x5F97;&#x7126;&#x70B9;&#x65F6;&#xFF0C;&#x4F1A;&#x8C03;&#x7528; <code>onResume()</code>&#x3002;</p>
<p>  &#x5982;&#x679C;&#x6709;&#x65B0;&#x7684; Activity &#x6216;&#x5BF9;&#x8BDD;&#x6846;&#x51FA;&#x73B0;&#x5728;&#x524D;&#x53F0;&#xFF0C;&#x593A;&#x53D6;&#x4E86;&#x7126;&#x70B9;&#x4E14;&#x5B8C;&#x5168;&#x8986;&#x76D6;&#x4E86;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x7684; Activity&#xFF0C;&#x5219;&#x88AB;&#x8986;&#x76D6;&#x7684; Activity &#x4F1A;&#x5931;&#x53BB;&#x7126;&#x70B9;&#x5E76;&#x8FDB;&#x5165;&#x201C;&#x5DF2;&#x505C;&#x6B62;&#x201D;&#x72B6;&#x6001;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x5FEB;&#x901F;&#x5730;&#x63A5;&#x8FDE;&#x8C03;&#x7528; <code>onPause()</code> &#x548C; <code>onStop()</code>&#x3002;</p>
<p>  &#x5F53;&#x88AB;&#x8986;&#x76D6;&#x7684; Activity &#x7684;&#x540C;&#x4E00;&#x5B9E;&#x4F8B;&#x8FD4;&#x56DE;&#x5230;&#x524D;&#x53F0;&#x65F6;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x5BF9;&#x8BE5; Activity &#x8C03;&#x7528; <code>onRestart()</code>&#x3001;<code>onStart()</code> &#x548C; <code>onResume()</code>&#x3002;&#x5982;&#x679C;&#x88AB;&#x8986;&#x76D6;&#x7684; Activity &#x7684;&#x65B0;&#x5B9E;&#x4F8B;&#x8FDB;&#x5165;&#x540E;&#x53F0;&#xFF0C;&#x5219;&#x7CFB;&#x7EDF;&#x4E0D;&#x4F1A;&#x8C03;&#x7528; onRestart()&#xFF0C;&#x800C;&#x53EA;&#x4F1A;&#x8C03;&#x7528; <code>onStart()</code> &#x548C; <code>onResume()</code>&#x3002;</p>
</li>
<li><p><strong>&#x8FD4;&#x56DE;</strong>&#x6309;&#x94AE;</p>
<p>  &#x5982;&#x679C; Activity &#x4F4D;&#x4E8E;&#x524D;&#x53F0;&#xFF0C;&#x5E76;&#x4E14;&#x7528;&#x6237;&#x70B9;&#x6309;&#x4E86;<strong>&#x8FD4;&#x56DE;</strong>&#x6309;&#x94AE;&#xFF0C;Activity &#x5C06;&#x4F9D;&#x6B21;&#x7ECF;&#x5386; <code>onPause()</code>&#x3001;<code>onStop()</code> &#x548C; <code>onDestroy()</code> &#x56DE;&#x8C03;&#x3002;&#x6D3B;&#x52A8;&#x4E0D;&#x4EC5;&#x4F1A;&#x88AB;&#x9500;&#x6BC1;&#xFF0C;&#x8FD8;&#x4F1A;&#x4ECE;&#x8FD4;&#x56DE;&#x5806;&#x6808;&#x4E2D;&#x79FB;&#x9664;&#x3002;</p>
<p>  &#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x9ED8;&#x8BA4;&#x4E0D;&#x4F1A;&#x89E6;&#x53D1; <code>onSaveInstanceState()</code> &#x56DE;&#x8C03;&#x3002;&#x6B64;&#x884C;&#x4E3A;&#x57FA;&#x4E8E;&#x7684;&#x5047;&#x8BBE;&#x662F;&#xFF0C;&#x7528;&#x6237;&#x70B9;&#x6309;<strong>&#x8FD4;&#x56DE;</strong>&#x6309;&#x94AE;&#x65F6;&#x4E0D;&#x671F;&#x671B;&#x8FD4;&#x56DE; Activity &#x7684;&#x540C;&#x4E00;&#x5B9E;&#x4F8B;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x66FF;&#x6362; <code>onBackPressed()</code> &#x65B9;&#x6CD5;&#x5B9E;&#x73B0;&#x67D0;&#x79CD;&#x81EA;&#x5B9A;&#x4E49;&#x884C;&#x4E3A;&#xFF0C;&#x4F8B;&#x5982;&#x201C;confirm-quit&#x201D;&#x5BF9;&#x8BDD;&#x6846;&#x3002;</p>
</li>
<li><p>&#x7CFB;&#x7EDF;&#x7EC8;&#x6B62;&#x7A0B;&#x5E8F;</p>
<p>  &#x5982;&#x679C;&#x67D0;&#x4E2A;&#x5E94;&#x7528;&#x5904;&#x4E8E;&#x540E;&#x53F0;&#x5E76;&#x4E14;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x4E3A;&#x524D;&#x53F0;&#x5E94;&#x7528;&#x91CA;&#x653E;&#x989D;&#x5916;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x5219;&#x7CFB;&#x7EDF;&#x53EF;&#x80FD;&#x4F1A;&#x7EC8;&#x6B62;&#x540E;&#x53F0;&#x5E94;&#x7528;&#x4EE5;&#x91CA;&#x653E;&#x66F4;&#x591A;&#x5185;&#x5B58;&#x3002;&#x8981;&#x8BE6;&#x7EC6;&#x4E86;&#x89E3;&#x7CFB;&#x7EDF;&#x5982;&#x4F55;&#x786E;&#x5B9A;&#x8981;&#x9500;&#x6BC1;&#x54EA;&#x4E9B;&#x8FDB;&#x7A0B;&#xFF0C;&#x8BF7;&#x9605;&#x8BFB; <a href="#Activity%20&#x72B6;&#x6001;&#x548C;&#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x5F39;&#x51FA;">Activity &#x72B6;&#x6001;&#x548C;&#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x5F39;&#x51FA;</a>&#x4EE5;&#x53CA;<a href="#xx">&#x8FDB;&#x7A0B;&#x548C;&#x5E94;&#x7528;&#x751F;&#x547D;&#x5468;&#x671F;</a>&#x3002;</p>
</li>
</ul>
<h3 id="&#x8FDB;&#x7A0B;&#x548C;&#x5E94;&#x7528;&#x751F;&#x547D;&#x5468;&#x671F;"><span name="xx">&#x8FDB;&#x7A0B;&#x548C;&#x5E94;&#x7528;&#x751F;&#x547D;&#x5468;&#x671F;</span></h3>
<p>&#x4E3A;&#x4E86;&#x786E;&#x5B9A;&#x5728;&#x5185;&#x5B58;&#x4E0D;&#x8DB3;&#x65F6;&#x5E94;&#x8BE5;&#x7EC8;&#x6B62;&#x54EA;&#x4E9B;&#x8FDB;&#x7A0B;&#xFF0C;Android &#x4F1A;&#x6839;&#x636E;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x8FD0;&#x884C;&#x7684;&#x7EC4;&#x4EF6;&#x4EE5;&#x53CA;&#x8FD9;&#x4E9B;&#x7EC4;&#x4EF6;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x5C06;&#x5B83;&#x4EEC;&#x653E;&#x5165;&#x201C;&#x91CD;&#x8981;&#x6027;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x201D;&#x3002;&#x8FD9;&#x4E9B;&#x8FDB;&#x7A0B;&#x7C7B;&#x578B;&#x5305;&#x62EC;&#xFF08;&#x6309;&#x91CD;&#x8981;&#x6027;&#x6392;&#x5E8F;&#xFF09;</p>
<ol>
<li><p>&#x524D;&#x53F0;&#x8FDB;&#x7A0B;</p>
<p> &#x662F;&#x7528;&#x6237;&#x76EE;&#x524D;&#x6267;&#x884C;&#x64CD;&#x4F5C;&#x6240;&#x9700;&#x7684;&#x8FDB;&#x7A0B;&#x3002;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FDB;&#x7A0B;&#x53EF;&#x80FD;&#x4F1A;&#x56E0;&#x4E3A;&#x5176;&#x6240;&#x5305;&#x542B;&#x7684;&#x5404;&#x79CD;&#x5E94;&#x7528;&#x7EC4;&#x4EF6;&#x800C;&#x88AB;&#x89C6;&#x4E3A;&#x524D;&#x53F0;&#x8FDB;&#x7A0B;&#x3002;&#x5982;&#x679C;&#x4EE5;&#x4E0B;&#x4EFB;&#x4E00;&#x6761;&#x4EF6;&#x6210;&#x7ACB;&#xFF0C;&#x5219;&#x8FDB;&#x7A0B;&#x4F1A;&#x88AB;&#x8BA4;&#x4E3A;&#x4F4D;&#x4E8E;&#x524D;&#x53F0;&#xFF1A;</p>
<ul>
<li><p>&#x5B83;&#x6B63;&#x5728;&#x7528;&#x6237;&#x7684;&#x4E92;&#x52A8;&#x5C4F;&#x5E55;&#x4E0A;&#x8FD0;&#x884C;&#x4E00;&#x4E2A; <code>Activity</code>&#xFF08;&#x5176; <code>onResume()</code> &#x65B9;&#x6CD5;&#x5DF2;&#x88AB;&#x8C03;&#x7528;&#xFF09;&#x3002;</p>
</li>
<li><p>&#x5B83;&#x6709;&#x4E00;&#x4E2A; <code>BroadcastReceiver</code> &#x76EE;&#x524D;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#xFF08;&#x5176; <code>BroadcastReceiver.onReceive()</code> &#x65B9;&#x6CD5;&#x6B63;&#x5728;&#x6267;&#x884C;&#xFF09;&#x3002;</p>
</li>
<li><p>&#x5B83;&#x6709;&#x4E00;&#x4E2A; <code>Service</code> &#x76EE;&#x524D;&#x6B63;&#x5728;&#x6267;&#x884C;&#x5176;&#x67D0;&#x4E2A;&#x56DE;&#x8C03;&#xFF08;<code>Service.onCreate()</code>&#x3001;<code>Service.onStart()</code> &#x6216; <code>Service.onDestroy()</code>&#xFF09;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
</li>
<li><p>&#x7CFB;&#x7EDF;&#x4E2D;&#x53EA;&#x6709;&#x5C11;&#x6570;&#x6B64;&#x7C7B;&#x8FDB;&#x7A0B;&#xFF0C;&#x800C;&#x4E14;&#x9664;&#x975E;&#x5185;&#x5B58;&#x8FC7;&#x4F4E;&#xFF0C;&#x5BFC;&#x81F4;&#x8FDE;&#x8FD9;&#x4E9B;&#x8FDB;&#x7A0B;&#x90FD;&#x65E0;&#x6CD5;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#xFF0C;&#x624D;&#x4F1A;&#x5728;&#x6700;&#x540E;&#x4E00;&#x6B65;&#x7EC8;&#x6B62;&#x8FD9;&#x4E9B;&#x8FDB;&#x7A0B;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x6B64;&#x65F6;&#x8BBE;&#x5907;&#x5DF2;&#x8FBE;&#x5230;&#x5185;&#x5B58;&#x5206;&#x9875;&#x72B6;&#x6001;&#xFF0C;&#x56E0;&#x6B64;&#x5FC5;&#x987B;&#x6267;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#x624D;&#x80FD;&#x4F7F;&#x7528;&#x6237;&#x754C;&#x9762;&#x4FDD;&#x6301;&#x54CD;&#x5E94;&#x3002;</p>
</li>
</ul>
</li>
<li><p>&#x53EF;&#x89C1;&#x8FDB;&#x7A0B;</p>
<p> &#x6B63;&#x5728;&#x8FDB;&#x884C;&#x7528;&#x6237;&#x5F53;&#x524D;&#x77E5;&#x6653;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x56E0;&#x6B64;&#x7EC8;&#x6B62;&#x8BE5;&#x8FDB;&#x7A0B;&#x4F1A;&#x5BF9;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x9020;&#x6210;&#x660E;&#x663E;&#x7684;&#x8D1F;&#x9762;&#x5F71;&#x54CD;&#x3002;&#x5728;&#x4EE5;&#x4E0B;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;&#x8FDB;&#x7A0B;&#x5C06;&#x88AB;&#x89C6;&#x4E3A;&#x53EF;&#x89C1;&#xFF1A;</p>
<ul>
<li>&#x5B83;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684; <code>Activity</code> &#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x5BF9;&#x7528;&#x6237;&#x53EF;&#x89C1;&#xFF0C;&#x4F46;&#x4E0D;&#x5728;&#x524D;&#x53F0;&#xFF08;&#x5176; <code>onPause()</code> &#x65B9;&#x6CD5;&#x5DF2;&#x88AB;&#x8C03;&#x7528;&#xFF09;&#x3002;&#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x524D;&#x53F0; Activity &#x663E;&#x793A;&#x4E3A;&#x4E00;&#x4E2A;&#x5BF9;&#x8BDD;&#x6846;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x5BF9;&#x8BDD;&#x6846;&#x5141;&#x8BB8;&#x5728;&#x5176;&#x540E;&#x9762;&#x770B;&#x5230;&#x4E0A;&#x4E00;&#x4E2A; Activity&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;</li>
<li>&#x5B83;&#x6709;&#x4E00;&#x4E2A; <code>Service</code> &#x6B63;&#x5728;&#x901A;&#x8FC7; <code>Service.startForeground()</code>&#xFF08;&#x8981;&#x6C42;&#x7CFB;&#x7EDF;&#x5C06;&#x8BE5;&#x670D;&#x52A1;&#x89C6;&#x4E3A;&#x7528;&#x6237;&#x77E5;&#x6653;&#x6216;&#x57FA;&#x672C;&#x4E0A;&#x5BF9;&#x7528;&#x6237;&#x53EF;&#x89C1;&#x7684;&#x670D;&#x52A1;&#xFF09;&#x4F5C;&#x4E3A;&#x524D;&#x53F0;&#x670D;&#x52A1;&#x8FD0;&#x884C;&#x3002;</li>
<li><p>&#x7CFB;&#x7EDF;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x5176;&#x6258;&#x7BA1;&#x7684;&#x670D;&#x52A1;&#x5B9E;&#x73B0;&#x7528;&#x6237;&#x77E5;&#x6653;&#x7684;&#x7279;&#x5B9A;&#x529F;&#x80FD;&#xFF0C;&#x4F8B;&#x5982;&#x52A8;&#x6001;&#x58C1;&#x7EB8;&#x3001;&#x8F93;&#x5165;&#x6CD5;&#x670D;&#x52A1;&#x7B49;&#x3002;</p>
<p>&#x76F8;&#x6BD4;&#x524D;&#x53F0;&#x8FDB;&#x7A0B;&#xFF0C;&#x7CFB;&#x7EDF;&#x4E2D;&#x8FD0;&#x884C;&#x7684;&#x8FD9;&#x4E9B;&#x8FDB;&#x7A0B;&#x6570;&#x91CF;&#x8F83;&#x4E0D;&#x53D7;&#x9650;&#x5236;&#xFF0C;&#x4F46;&#x4ECD;&#x76F8;&#x5BF9;&#x53D7;&#x63A7;&#x3002;&#x8FD9;&#x4E9B;&#x8FDB;&#x7A0B;&#x88AB;&#x8BA4;&#x4E3A;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x9664;&#x975E;&#x7CFB;&#x7EDF;&#x4E3A;&#x4E86;&#x4F7F;&#x6240;&#x6709;&#x524D;&#x53F0;&#x8FDB;&#x7A0B;&#x4FDD;&#x6301;&#x8FD0;&#x884C;&#x800C;&#x9700;&#x8981;&#x7EC8;&#x6B62;&#x5B83;&#x4EEC;&#xFF0C;&#x5426;&#x5219;&#x4E0D;&#x4F1A;&#x8FD9;&#x4E48;&#x505A;&#x3002;</p>
</li>
</ul>
</li>
<li><p>&#x670D;&#x52A1;&#x8FDB;&#x7A0B;</p>
<p> &#x5305;&#x542B;&#x4E00;&#x4E2A;&#x5DF2;&#x4F7F;&#x7528; <code>startService()</code> &#x65B9;&#x6CD5;&#x542F;&#x52A8;&#x7684; <code>Service</code>&#x3002;&#x867D;&#x7136;&#x7528;&#x6237;&#x65E0;&#x6CD5;&#x76F4;&#x63A5;&#x770B;&#x5230;&#x8FD9;&#x4E9B;&#x8FDB;&#x7A0B;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x901A;&#x5E38;&#x6B63;&#x5728;&#x6267;&#x884C;&#x7528;&#x6237;&#x5173;&#x5FC3;&#x7684;&#x4EFB;&#x52A1;&#xFF08;&#x4F8B;&#x5982;&#x540E;&#x53F0;&#x7F51;&#x7EDC;&#x6570;&#x636E;&#x4E0A;&#x4F20;&#x6216;&#x4E0B;&#x8F7D;&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#x7CFB;&#x7EDF;&#x4F1A;&#x59CB;&#x7EC8;&#x4F7F;&#x6B64;&#x7C7B;&#x8FDB;&#x7A0B;&#x4FDD;&#x6301;&#x8FD0;&#x884C;&#xFF0C;&#x9664;&#x975E;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x5185;&#x5B58;&#x6765;&#x4FDD;&#x7559;&#x6240;&#x6709;&#x524D;&#x53F0;&#x548C;&#x53EF;&#x89C1;&#x8FDB;&#x7A0B;&#x3002;</p>
<p> &#x5DF2;&#x7ECF;&#x8FD0;&#x884C;&#x4E86;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#xFF08;&#x4F8B;&#x5982; 30 &#x5206;&#x949F;&#x6216;&#x66F4;&#x957F;&#x65F6;&#x95F4;&#xFF09;&#x7684;&#x670D;&#x52A1;&#x7684;&#x91CD;&#x8981;&#x6027;&#x53EF;&#x80FD;&#x4F1A;&#x964D;&#x4F4D;&#xFF0C;&#x4EE5;&#x4F7F;&#x5176;&#x8FDB;&#x7A0B;&#x964D;&#x81F3;&#x4E0B;&#x6587;&#x6240;&#x8FF0;&#x7684;&#x7F13;&#x5B58; LRU &#x5217;&#x8868;&#x3002;&#x8FD9;&#x6709;&#x52A9;&#x4E8E;&#x907F;&#x514D;&#x8D85;&#x957F;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#x7684;&#x670D;&#x52A1;&#x56E0;&#x5185;&#x5B58;&#x6CC4;&#x9732;&#x6216;&#x5176;&#x4ED6;&#x95EE;&#x9898;&#x5360;&#x7528;&#x5927;&#x91CF;&#x5185;&#x5B58;&#xFF0C;&#x8FDB;&#x800C;&#x59A8;&#x788D;&#x7CFB;&#x7EDF;&#x6709;&#x6548;&#x5229;&#x7528;&#x7F13;&#x5B58;&#x8FDB;&#x7A0B;&#x3002;</p>
</li>
<li><p>&#x7F13;&#x5B58;&#x8FDB;&#x7A0B;</p>
<p> &#x662F;&#x76EE;&#x524D;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x9700;&#x8981;&#x5185;&#x5B58;&#xFF0C;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x9700;&#x8981;&#x81EA;&#x7531;&#x5730;&#x7EC8;&#x6B62;&#x8BE5;&#x8FDB;&#x7A0B;&#x3002;&#x5728;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E9B;&#x662F;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x4E2D;&#x6D89;&#x53CA;&#x7684;&#x552F;&#x4E00;&#x8FDB;&#x7A0B;&#xFF1A;&#x8FD0;&#x884C;&#x826F;&#x597D;&#x7684;&#x7CFB;&#x7EDF;&#x5C06;&#x59CB;&#x7EC8;&#x6709;&#x591A;&#x4E2A;&#x7F13;&#x5B58;&#x8FDB;&#x7A0B;&#x53EF;&#x7528;&#xFF08;&#x4E3A;&#x4E86;&#x66F4;&#x9AD8;&#x6548;&#x5730;&#x5207;&#x6362;&#x5E94;&#x7528;&#xFF09;&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x9700;&#x8981;&#x5B9A;&#x671F;&#x7EC8;&#x6B62;&#x6700;&#x65E9;&#x7684;&#x8FDB;&#x7A0B;&#x3002;&#x53EA;&#x6709;&#x5728;&#x975E;&#x5E38;&#x5371;&#x6025;&#xFF08;&#x4E14;&#x5177;&#x6709;&#x4E0D;&#x826F;&#x5F71;&#x54CD;&#xFF09;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x7F13;&#x5B58;&#x8FDB;&#x7A0B;&#x624D;&#x4F1A;&#x88AB;&#x7EC8;&#x6B62;&#xFF0C;&#x6B64;&#x65F6;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x5F00;&#x59CB;&#x7EC8;&#x6B62;&#x670D;&#x52A1;&#x8FDB;&#x7A0B;&#x3002;</p>
<p> &#x8FD9;&#x4E9B;&#x8FDB;&#x7A0B;&#x901A;&#x5E38;&#x5305;&#x542B;&#x7528;&#x6237;&#x5F53;&#x524D;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A; <code>Activity</code> &#x5B9E;&#x4F8B;&#xFF08;<code>onStop()</code> &#x65B9;&#x6CD5;&#x5DF2;&#x88AB;&#x8C03;&#x7528;&#x5E76;&#x8FD4;&#x56DE;&#xFF09;&#x3002;&#x53EA;&#x8981;&#x5B83;&#x4EEC;&#x6B63;&#x786E;&#x5B9E;&#x73B0;&#x5176; Activity &#x751F;&#x547D;&#x5468;&#x671F;&#xFF08;&#x8BE6;&#x60C5;&#x8BF7;&#x89C1; <code>Activity</code>&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x5F53;&#x7CFB;&#x7EDF;&#x7EC8;&#x6B62;&#x6B64;&#x7C7B;&#x6D41;&#x7A0B;&#x65F6;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x7528;&#x6237;&#x8FD4;&#x56DE;&#x8BE5;&#x5E94;&#x7528;&#x65F6;&#x7684;&#x4F53;&#x9A8C;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x5173;&#x8054;&#x7684; Activity &#x5728;&#x65B0;&#x7684;&#x8FDB;&#x7A0B;&#x4E2D;&#x91CD;&#x65B0;&#x521B;&#x5EFA;&#x65F6;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x6062;&#x590D;&#x4E4B;&#x524D;&#x4FDD;&#x5B58;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
<p> &#x8FD9;&#x4E9B;&#x8FDB;&#x7A0B;&#x4FDD;&#x5B58;&#x5728;&#x4F2A; LRU &#x5217;&#x8868;(&#x6700;&#x8FD1;&#x6700;&#x5C11;&#x4F7F;&#x7528;)&#x4E2D;&#xFF0C;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x662F;&#x4E3A;&#x4E86;&#x56DE;&#x6536;&#x5185;&#x5B58;&#x800C;&#x7EC8;&#x6B62;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x3002;&#x6B64;&#x5217;&#x8868;&#x7684;&#x786E;&#x5207;&#x6392;&#x5E8F;&#x653F;&#x7B56;&#x662F;&#x5E73;&#x53F0;&#x7684;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#xFF0C;&#x4F46;&#x5B83;&#x901A;&#x5E38;&#x4F1A;&#x5148;&#x5C1D;&#x8BD5;&#x4FDD;&#x7559;&#x66F4;&#x591A;&#x6709;&#x7528;&#x7684;&#x8FDB;&#x7A0B;&#xFF08;&#x6BD4;&#x5982;&#x6258;&#x7BA1;&#x7528;&#x6237;&#x7684;&#x4E3B;&#x5C4F;&#x5E55;&#x5E94;&#x7528;&#x3001;&#x7528;&#x6237;&#x6700;&#x540E;&#x770B;&#x5230;&#x7684; Activity &#x7684;&#x8FDB;&#x7A0B;&#x7B49;&#xFF09;&#xFF0C;&#x518D;&#x4FDD;&#x7559;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x8FDB;&#x7A0B;&#x3002;&#x8FD8;&#x53EF;&#x4EE5;&#x9488;&#x5BF9;&#x7EC8;&#x6B62;&#x8FDB;&#x7A0B;&#x5E94;&#x7528;&#x5176;&#x4ED6;&#x653F;&#x7B56;&#xFF1A;&#x6BD4;&#x5982;&#x5BF9;&#x5141;&#x8BB8;&#x7684;&#x8FDB;&#x7A0B;&#x6570;&#x91CF;&#x7684;&#x786C;&#x9650;&#x5236;&#xFF0C;&#x5BF9;&#x8FDB;&#x7A0B;&#x53EF;&#x6301;&#x7EED;&#x4FDD;&#x6301;&#x7F13;&#x5B58;&#x72B6;&#x6001;&#x7684;&#x65F6;&#x95F4;&#x957F;&#x77ED;&#x7684;&#x9650;&#x5236;&#x7B49;&#x3002;</p>
</li>
</ol>
<h2 id="fragment">Fragment</h2>
<p><code>Fragment</code> &#x8868;&#x793A; <code>FragmentActivity</code> &#x4E2D;&#x7684;&#x884C;&#x4E3A;&#x6216;&#x754C;&#x9762;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x4E2A; Activity &#x4E2D;&#x7EC4;&#x5408;&#x591A;&#x4E2A;fragment&#xFF0C;&#x4ECE;&#x800C;&#x6784;&#x5EFA;&#x591A;&#x7A97;&#x683C;&#x754C;&#x9762;&#xFF0C;&#x5E76;&#x5728;&#x591A;&#x4E2A; Activity &#x4E2D;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#x67D0;&#x4E2A;fragment&#x3002;&#x53EF;&#x4EE5;&#x5C06;fragment&#x89C6;&#x4E3A; Activity &#x7684;&#x6A21;&#x5757;&#x5316;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x5B83;&#x5177;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#xFF0C;&#x80FD;&#x63A5;&#x6536;&#x81EA;&#x5DF1;&#x7684;&#x8F93;&#x5165;&#x4E8B;&#x4EF6;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x5728; Activity &#x8FD0;&#x884C;&#x65F6;&#x6DFB;&#x52A0;&#x6216;&#x79FB;&#x9664;fragment&#xFF08;&#x8FD9;&#x6709;&#x70B9;&#x50CF;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C; Activity &#x4E2D;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#x7684;&#x201C;&#x5B50; Activity&#x201D;&#xFF09;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x65B0;&#x95FB;&#x5E94;&#x7528;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;fragment&#x5728;&#x5DE6;&#x4FA7;&#x663E;&#x793A;&#x6587;&#x7AE0;&#x5217;&#x8868;&#xFF0C;&#x4F7F;&#x7528;&#x53E6;&#x4E00;&#x4E2A;fragment&#x5728;&#x53F3;&#x4FA7;&#x663E;&#x793A;&#x6587;&#x7AE0; &#x2014; &#x4E24;&#x4E2A;fragment&#x5E76;&#x6392;&#x663E;&#x793A;&#x5728;&#x4E00;&#x4E2A; Activity &#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;fragment&#x90FD;&#x62E5;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x5957;&#x751F;&#x547D;&#x5468;&#x671F;&#x56DE;&#x8C03;&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x5404;&#x81EA;&#x5904;&#x7406;&#x81EA;&#x5DF1;&#x7684;&#x7528;&#x6237;&#x8F93;&#x5165;&#x4E8B;&#x4EF6;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x7528;&#x6237;&#x65E0;&#x9700;&#x4F7F;&#x7528;&#x4E00;&#x4E2A; Activity &#x6765;&#x9009;&#x62E9;&#x6587;&#x7AE0;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x53E6;&#x4E00;&#x4E2A; Activity &#x6765;&#x9605;&#x8BFB;&#x6587;&#x7AE0;&#xFF0C;&#x800C;&#x662F;&#x53EF;&#x4EE5;&#x5728;&#x540C;&#x4E00;&#x4E2A; Activity &#x5185;&#x9009;&#x62E9;&#x6587;&#x7AE0;&#x5E76;&#x8FDB;&#x884C;&#x9605;&#x8BFB;&#xFF0C;&#x5982;&#x56FE; 1 &#x4E2D;&#x7684;&#x5E73;&#x677F;&#x7535;&#x8111;&#x5E03;&#x5C40;&#x6240;&#x793A;&#x3002;</p>
<p>&#x5E94;&#x5C06;&#x6BCF;&#x4E2A;fragment&#x90FD;&#x8BBE;&#x8BA1;&#x4E3A;&#x53EF;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#x7684;&#x6A21;&#x5757;&#x5316; Activity &#x7EC4;&#x4EF6;&#x3002;&#x6362;&#x8A00;&#x4E4B;&#xFF0C;&#x7531;&#x4E8E;&#x6BCF;&#x4E2A;fragment&#x90FD;&#x4F1A;&#x901A;&#x8FC7;&#x5404;&#x81EA;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x56DE;&#x8C03;&#x6765;&#x5B9A;&#x4E49;&#x81EA;&#x5DF1;&#x7684;&#x5E03;&#x5C40;&#x548C;&#x884C;&#x4E3A;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x4E00;&#x4E2A;fragment&#x52A0;&#x5165;&#x591A;&#x4E2A; Activity&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5E94;&#x91C7;&#x7528;&#x53EF;&#x590D;&#x7528;&#x5F0F;&#x8BBE;&#x8BA1;&#xFF0C;&#x907F;&#x514D;&#x76F4;&#x63A5;&#x901A;&#x8FC7;&#x67D0;&#x4E2A;fragment&#x64CD;&#x7EB5;&#x53E6;&#x4E00;&#x4E2A;fragment&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x9887;&#x4E3A;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x6A21;&#x5757;&#x5316;fragment&#x5141;&#x8BB8;&#x66F4;&#x6539;fragment&#x7684;&#x7EC4;&#x5408;&#x65B9;&#x5F0F;&#xFF0C;&#x4ECE;&#x800C;&#x9002;&#x5E94;&#x4E0D;&#x540C;&#x7684;&#x5C4F;&#x5E55;&#x5C3A;&#x5BF8;&#x3002;&#x5728;&#x8BBE;&#x8BA1;&#x53EF;&#x540C;&#x65F6;&#x652F;&#x6301;&#x5E73;&#x677F;&#x7535;&#x8111;&#x548C;&#x624B;&#x673A;&#x7684;&#x5E94;&#x7528;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5E03;&#x5C40;&#x914D;&#x7F6E;&#x4E2D;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#x7684;fragment&#xFF0C;&#x4EE5;&#x6839;&#x636E;&#x53EF;&#x7528;&#x7684;&#x5C4F;&#x5E55;&#x7A7A;&#x95F4;&#x4F18;&#x5316;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x624B;&#x673A;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x80FD;&#x5728;&#x540C;&#x4E00; Activity &#x5185;&#x50A8;&#x5B58;&#x591A;&#x4E2A;fragment&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x5FC5;&#x987B;&#x5229;&#x7528;&#x5355;&#x72EC;&#x7684;fragment&#x6765;&#x5B9E;&#x73B0;&#x5355;&#x7A97;&#x683C;&#x754C;&#x9762;&#x3002;</p>
<p>&#x4E0B;&#x56FE;&#x4E3A;Fragment&#x751F;&#x547D;&#x5468;&#x671F;&#xFF08;&#x5F53;&#x5176;Activity&#x8FD0;&#x884C;&#x65F6;&#xFF09;</p>
<p><img src="https://raw.githubusercontent.com/yanyi5496/yanyi5496.github.io/image/markdown/fragment_lifecycle.png" alt="img"></p>
<p><code>Fragment</code> &#x7C7B;&#x7684;&#x4EE3;&#x7801;&#x4E0E; <code>Activity</code> &#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x3002;&#x5B83;&#x5305;&#x542B;&#x4E0E; Activity &#x7C7B;&#x4F3C;&#x7684;&#x56DE;&#x8C03;&#x65B9;&#x6CD5;&#xFF0C;&#x5982; <code>onCreate()</code>&#x3001;<code>onStart()</code>&#x3001;<code>onPause()</code> &#x548C; <code>onStop()</code>&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x8981;&#x5C06;&#x73B0;&#x6709; Android &#x5E94;&#x7528;&#x8F6C;&#x6362;&#x4E3A;&#x4F7F;&#x7528;fragment&#xFF0C;&#x53EF;&#x80FD;&#x53EA;&#x9700;&#x5C06;&#x4EE3;&#x7801;&#x4ECE; Activity &#x7684;&#x56DE;&#x8C03;&#x65B9;&#x6CD5;&#x79FB;&#x5165;fragment&#x76F8;&#x5E94;&#x7684;&#x56DE;&#x8C03;&#x65B9;&#x6CD5;&#x4E2D;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x60A8;&#x81F3;&#x5C11;&#x5E94;&#x5B9E;&#x73B0;&#x4EE5;&#x4E0B;&#x751F;&#x547D;&#x5468;&#x671F;&#x65B9;&#x6CD5;&#xFF1A;</p>
<ul>
<li><p><code>onCreate()</code></p>
<p>  &#x7CFB;&#x7EDF;&#x4F1A;&#x5728;&#x521B;&#x5EFA;&#x7247;&#x6BB5;&#x65F6;&#x8C03;&#x7528;&#x6B64;&#x65B9;&#x6CD5;&#x3002;&#x5F53;&#x7247;&#x6BB5;&#x7ECF;&#x5386;&#x6682;&#x505C;&#x6216;&#x505C;&#x6B62;&#x72B6;&#x6001;&#x7EE7;&#x800C;&#x6062;&#x590D;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x5E0C;&#x671B;&#x4FDD;&#x7559;&#x6B64;&#x7247;&#x6BB5;&#x7684;&#x57FA;&#x672C;&#x7EC4;&#x4EF6;&#xFF0C;&#x5219;&#x5E94;&#x5728;&#x60A8;&#x7684;&#x5B9E;&#x73B0;&#x4E2D;&#x5C06;&#x5176;&#x521D;&#x59CB;&#x5316;&#x3002;</p>
</li>
<li><p><code>onCreateView()</code></p>
<p>  &#x7CFB;&#x7EDF;&#x4F1A;&#x5728;&#x7247;&#x6BB5;&#x9996;&#x6B21;&#x7ED8;&#x5236;&#x5176;&#x754C;&#x9762;&#x65F6;&#x8C03;&#x7528;&#x6B64;&#x65B9;&#x6CD5;&#x3002;&#x5982;&#x8981;&#x4E3A;&#x60A8;&#x7684;&#x7247;&#x6BB5;&#x7ED8;&#x5236;&#x754C;&#x9762;&#xFF0C;&#x60A8;&#x4ECE;&#x6B64;&#x65B9;&#x6CD5;&#x4E2D;&#x8FD4;&#x56DE;&#x7684; <code>View</code> &#x5FC5;&#x987B;&#x662F;&#x7247;&#x6BB5;&#x5E03;&#x5C40;&#x7684;&#x6839;&#x89C6;&#x56FE;&#x3002;&#x5982;&#x679C;&#x7247;&#x6BB5;&#x672A;&#x63D0;&#x4F9B;&#x754C;&#x9762;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x8FD4;&#x56DE; null&#x3002;</p>
</li>
<li><p><code>onPause()</code></p>
<p>  &#x7CFB;&#x7EDF;&#x4F1A;&#x5C06;&#x6B64;&#x65B9;&#x6CD5;&#x4F5C;&#x4E3A;&#x7528;&#x6237;&#x79BB;&#x5F00;&#x7247;&#x6BB5;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x4FE1;&#x53F7;&#xFF08;&#x4F46;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x610F;&#x5473;&#x7740;&#x6B64;&#x7247;&#x6BB5;&#x4F1A;&#x88AB;&#x9500;&#x6BC1;&#xFF09;&#x8FDB;&#x884C;&#x8C03;&#x7528;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x60A8;&#x5E94;&#x5728;&#x6B64;&#x65B9;&#x6CD5;&#x5185;&#x786E;&#x8BA4;&#x5728;&#x5F53;&#x524D;&#x7528;&#x6237;&#x4F1A;&#x8BDD;&#x7ED3;&#x675F;&#x540E;&#x4ECD;&#x7136;&#x6709;&#x6548;&#x7684;&#x4EFB;&#x4F55;&#x66F4;&#x6539;&#xFF08;&#x56E0;&#x4E3A;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x8FD4;&#x56DE;&#xFF09;&#x3002;</p>
</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="AAC.html" class="navigation navigation-prev " aria-label="Previous page: 1.2.1 AAC">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="架构组件.html" class="navigation navigation-next " aria-label="Next page: 1.2.3 架构组件">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1.2.2 安卓基础","level":"1.2.2.1.1","depth":4,"next":{"title":"1.2.3 架构组件","level":"1.2.2.2","depth":3,"path":"android/基础/架构组件.md","ref":"android/基础/架构组件.md","articles":[{"title":"1.2.4 数据库存储","level":"1.2.2.2.1","depth":4,"path":"android/基础/数据库存储.md","ref":"android/基础/数据库存储.md","articles":[]}]},"previous":{"title":"1.2.1 AAC","level":"1.2.2.1","depth":3,"path":"android/基础/AAC.md","ref":"android/基础/AAC.md","articles":[{"title":"1.2.2 安卓基础","level":"1.2.2.1.1","depth":4,"path":"android/基础/安卓基础.md","ref":"android/基础/安卓基础.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["expandable-chapters"],"pluginsConfig":{"expandable-chapters":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"android/基础/安卓基础.md","mtime":"2020-07-24T02:01:52.559Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-07-24T02:46:39.759Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

